{
  "quizSrc": [
    {
      "term": "What is a goal-oriented process that is directed toward ensuring that organizational processes are in place to maximize productivity of employees, teams, and ultimately, the organization?A. team managementB. careerdevelopmentC. performance managementD. organization development",
      "definition": "C. performance management"
    },
    {
      "term": "What are specific guides to behavior on the job?A. rulesB. ethicsC. moralsD. standards",
      "definition": "A. rules"
    },
    {
      "term": "HR must focus on expanding its .............and high-level corporate participation with an emphasis on adding value.A. mobileB. technicalC. strategicD. tactical",
      "definition": "C. strategic"
    },
    {
      "term": "What are the two components of nonfinancial compensation?A. job and salaryB. job and job environmentC. salary and job environmentD. premium pay and job schedule",
      "definition": "B. job and job environment"
    },
    {
      "term": "True or false: To overcome problems of private information, organizations can only use screening strategies,not signaling strategies?A. TrueB. False",
      "definition": "B. False"
    },
    {
      "term": "According to a survey, most employers who administer tests to applicants are measuringA . job skillsB. psychological behaviorsC. interpersonal behaviorsD. ethical opinions",
      "definition": ""
    },
    {
      "term": "What is an example of a situation in which you need to adjust for supply factors?A. You need your workers to do a less appealing job.B. The workforce is more educatedC. You ask your workers to work in a less attractive work environmentD. All of these",
      "definition": "D. All of these"
    },
    {
      "term": "A good recruitment policyA. is flexible enough to accommodate changes in the organizationB. has its own policies and does not comply with government policy on hiringC. requires more investment for the organizationD. ensures short term employment opportunities for its employees",
      "definition": "A. is flexible enough to accommodate changes in the organization"
    },
    {
      "term": "What is a goal-oriented conversation in which the interviewer and applicant exchange information called?A development interviewB. recruitment interviewC. employment interviewD. training interview",
      "definition": "C. employment interview"
    },
    {
      "term": "An HR strategy that focuses on minimizing labor costs and strictly supervising workers is commonly called a ____ road strategy.A. LowB. High",
      "definition": "A. Low"
    },
    {
      "term": "What are rewards related to the job itself or to from the psychological and/or physical environment in whichthe person works called?A. vacationB. nonfinancialC. benefitsD. sick pay",
      "definition": "B. nonfinancial"
    },
    {
      "term": "A formal approach used by the organization to ensure that people with the proper qualificatic experiences are available when needed is referred to asA. career development.В. succession planning.C. career planning.D. training",
      "definition": "A. career development."
    },
    {
      "term": "Which of the following is used to measure job knowledge?A. aptitude testsB. interest inventoriesC. achievement testsD. projective tests",
      "definition": "C. achievement tests"
    },
    {
      "term": "Mike, a manager at a distribution center, has learned that one of his subordinates assaulted a co-worker. Mike uses the progressive disciplinary action approach when dealing with employee violations. Which of the following punishments will the subordinate most likely receive?A. oral warningB. written warningC. suspensionD. termination",
      "definition": "D. termination"
    },
    {
      "term": "The process of rewarding employees by giving them a stake in the company, which further enhances theirperformance is called theA. Gain sharingB. Annual bonusC. Employee stock planD. Profit sharing",
      "definition": "C. Employee stock plan"
    },
    {
      "term": "According to Mintzberg, there are three inlormational roles, which includesA. MonitorB. SpokespersonC. DisseminatorD. All of the answers are correct",
      "definition": "D. All of the answers are correct"
    },
    {
      "term": "According to Mintzberg's theory, which of the following is one of sets of leadership roles?A. TechnicalB. internationalC. PracticalD. interpersonal",
      "definition": "D. interpersonal"
    },
    {
      "term": "Lyle, an HR specialist at a publishing company, is in the process of choosing from a group of applicants the individual best suited for an assistant editor position. Lyle is most likely involved in the function of ..............A. selectionB. HR planningC. job analysisD. recruitment",
      "definition": "A. selection"
    },
    {
      "term": "Economists say that labor is a derived demand. Why is this concept important for managers to understand?A.Because whatever affects demand for an organization's product or service can affect strategies, policies, and tactics for managing people.B.Because what employees demand can affect strategies, policies, and tactics for managing people.C.Because strategies, policies, and tactics for managing people are derived from a country's legal regulations.",
      "definition": "A.Because whatever affects demand for an organization's product or service can affect strategies, policies, and tactics for managing people."
    },
    {
      "term": "Employee engagement is an important issue for HR because it_A. alters perceptionsB. increases selection ratiosC. slows the recruiting processD. affects organizational performance",
      "definition": "D. affects organizational performance"
    },
    {
      "term": "Which of the following statements are true? (you must correctly check all that apply)A.An organizational strategy based on unique goods or services is typically supported by an HR strategy that tries to develop, reward, and engage workers.B.An organization's business strategy and its HR strategy should be unrelated to each other.C.An organizational strategy based on low-cost leadership is typically supported by an HR strategy that tries to contain labor expenses and drive workers.D.An organizational strategy does not completely determine an organization's HR strategy. In other words, organizations with any type of business strategy can choose an HR strategy that develops, rewards, and engages employees.",
      "definition": "A.An organizational strategy based on unique goods or services is typically supported by an HR strategy that tries to develop, reward, and engage workers.   C.An organizational strategy based on low-cost leadership is typically supported by an HR strategy that tries to contain labor expenses and drive workers.   D.An organizational strategy does not completely determine an organization's HR strategy. In other words, organizations with any type of business strategy can choose an HR strategy that develops, rewards, and engages employees."
    },
    {
      "term": "Which of the following beliefs underlies high-road human resources strategies?A.The interests of an organization and its employees can be aligned.B.The employment relationship is characterized by some important conflicts of interest between an organization and its employees.C.Labor markets work reasonably well in allocating and rewarding workers.",
      "definition": "A.The interests of an organization and its employees can be aligned."
    },
    {
      "term": "What type of indirect financial compensation is the most expensive for most businesses?A. life insuranceB. health care insuranceC. retirement programsD. unemployment compensation",
      "definition": "B. health care insurance"
    },
    {
      "term": "Which of the following is not one of the five elements of leadership?A. LeadingafollowingB. HumanC. ChangeD. influencing",
      "definition": "B. Human"
    },
    {
      "term": "HRM is associated with the management ofA. Community membersB. Organizational peopleC. Financial resourcesD. General people.",
      "definition": "B. Organizational people"
    },
    {
      "term": "A human resource generalist normally performs tasksA. at entry levels.B. in either compensation or labor relations.C. in fewer than three functional areas.D. in a variety of human resource-related functions.",
      "definition": "D. in a variety of human resource-related functions."
    },
    {
      "term": "Certain characteristics of a recruiter don't have an influence on the attitudes and behaviors of the applicants?A. TrueB. False",
      "definition": "B. False"
    },
    {
      "term": "Which one of the following is NOT one of the criteria of a Googte interview?A. GPA in universityB. General cognitive abilityC. GoogleynessD. Leadership",
      "definition": "A. GPA in university"
    },
    {
      "term": "Marginal analysis from economics teaches managers... (you must check all that apply)A...that what it takes to hire or retain the last needed worker strongly influences compensation and other elements of the job for everyone in that position.B.Work is a lousy activity tolerated to earn income.C....that it's particular challenging to motivate someone when the last extra hour that you want someone to work is right on the edge of whether they want to work more or not.D....to think about the additional benefit compared to the additional cost of a possible managerial decision.",
      "definition": "A...that what it takes to hire or retain the last needed worker strongly influences compensation and other elements of the job for everyone in that position.  C....that it's particular challenging to motivate someone when the last extra hour that you want someone to work is right on the edge of whether they want to work more or not.  D....to think about the additional benefit compared to the additional cost of a possible managerial decision."
    },
    {
      "term": "What staffing task impacts virtually every aspect of human resource manageme it?A. selectionB. job analysisC. recruitmentD. human resource planning",
      "definition": "B. job analysis"
    },
    {
      "term": "Economic theory predicts that if an employer pays a fixed wage or salary rather than performance-based pay, workers will...A.shirkB.quitC.complainD.work hard",
      "definition": "A.shirk"
    },
    {
      "term": "Ellen enjoys working at Starbucks because of her interactions with customers and co-workers. The satisfaction that Ellen feels would best be categorized as ............A. performance satisfactionB. emotional healthC. indirect financial compensationD. nonfinancial compensation",
      "definition": "D. nonfinancial compensation"
    },
    {
      "term": "The goal of___is to formally communicate problem issues to employees in a direct and timely manner so that they can improve their performance.A. progressive disciplinary actionB. performance appraisalsC. succession planningD. Broad banding",
      "definition": "A. progressive disciplinary action"
    },
    {
      "term": "Which of the following are possible unintended consequences using financial incentives to motivate workers? (you must check all that apply)A.\"What gets measured gets done\"B.Employees worker harder than without incentivesC.Poor teamworkD.\"If you don't like it, quit\"E.Reduced non-monetary (Intrinsic) motivationF.Overstimulation",
      "definition": "A.\"What gets measured gets done\"  C.Poor teamwork  E.Reduced non-monetary (Intrinsic) motivation  F.Overstimulation"
    },
    {
      "term": "True or false: Principal-agent problems can always be solved by additional monitoring.A.FalseB.True",
      "definition": "A.False"
    },
    {
      "term": "True or false: When evaluating a signal of private information, it's important to consider whether the signal is easy for others to imitate.A.TrueB.False",
      "definition": "A.True"
    },
    {
      "term": "Economics highlights worker self-interest. This is important for raising managerial awareness of... (you must check all that apply)( 3 đáp án )A.Shareholder valueB.Strategic use of private informationC.Principal-agent problemsDShirking and loafing",
      "definition": "B.Strategic use of private information  C.Principal-agent problems Shirking and loafing"
    },
    {
      "term": "What is the utilization of the firm's human resources to achieve organizational objectives called?A. human resource managementB. human resource managerC. organizingD. planning",
      "definition": "A. human resource management"
    },
    {
      "term": "It is useful for managers to understand what affects labor supply because...A...this helps managers understand workers' decision-making processes about where and when to work, and under what conditions.B...this helps managers understand what might happen if the organization needs to add more employees to supply more goods to its customers.",
      "definition": "A...this helps managers understand workers' decision-making processes about where and when to work, and under what conditions."
    },
    {
      "term": "The primary purpose of conducting a stress interview is to determineA. why an applicant wants to work for the firmB. how an applicant solves complex problemsC. why an applicant lied on the resumeD. how an applicant handles criticism",
      "definition": "D. how an applicant handles criticism"
    },
    {
      "term": "The question of whether employers and employees really are economic and legal equals is... (you must check all that apply)A...an issue that is largely ignored in pluralist, Marxist, radical, and critical critiques of approaches that favor labor market competition for setting wages and other terms and conditions of employment.B...the subject of intense debates going back more than 100 years.C...important because it determines whether or not employees need the protection of laws and labor unions.D...an issue that is largely ignored in high-road HR strategies.",
      "definition": "B...the subject of intense debates going back more than 100 years.   C...important because it determines whether or not employees need the protection of laws and labor unions.   D...an issue that is largely ignored in high-road HR strategies."
    },
    {
      "term": "True or False: The source of the recruitment message should be credible and an expertA. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "Managers should be trying to create conditions that result in...A...employees who are satisfied with their job.B...employees who are committed to their organization.C...employees who are engaged in their job.",
      "definition": "C...employees who are engaged in their job."
    },
    {
      "term": "An HR Manager in a large multinational firm is involved in establishing an international structure of roles forpeople and assigning responsibilities. What is the managerial function that the HR manager is performingA. OrganizingB. StaffingC. DirectingD. Controlling",
      "definition": "A. Organizing"
    },
    {
      "term": "In the selection process, which step is right before the step of making a selection and offer?A. ScreeningB. Reviewing work samplesC. Checking referencesD. Background check",
      "definition": "C. Checking references"
    },
    {
      "term": "To promote intrinsic motivation among workers they manage, managers should promote which needs? (you must check all that apply)( 3 đáp án )A.Financial securityB.AutonomyC.CompetenceD.Social belonging",
      "definition": "B.Autonomy   C.Competence   D.Social belonging"
    },
    {
      "term": "True or false: To promote positive job attitudes, managers should only be concerned with the characteristics of each job.A.FalseB.True",
      "definition": "A.False"
    },
    {
      "term": "To help feel good about ourselves, we identify with certain groups and in doing so, we emphasize the positive nature of their own group (\"in-group\") compared to others (\"out-groups\"). Which of the following does not result from this.A.Free-rider problems in groups such that some group members do not fully contribute.B.Inter-group conflict.C.Discrimination against out-group members by in-group members.D.Differences between those groups we identify with and those we do not are magnified.",
      "definition": "A.Free-rider problems in groups such that some group members do not fully contribute."
    },
    {
      "term": "To derive personal identity from belonging to an occupation, employees will...A...behave in ways that conform to societal or peer expectations for that occupation, even if the organization wishes them to behave differently.B...not worry about conforming to societal or peer expectations for that occupation.C...behave in ways that conform to societal or peer expectations for that occupation, unless the organization wishes them to behave differently.",
      "definition": "A...behave in ways that conform to societal or peer expectations for that occupation, even if the organization wishes them to behave differently."
    },
    {
      "term": "Consider an employee who (a) is only concerned with distributive justice, but not other aspects, and (b) believes she is working harder than her co-workers but getting paid the same. The employee's manager should expect her to... (you must check all that apply)A...do nothing.B...reduce her effort to match that of her co-workers.C...ask for a raise.D...complain about the fairness of the policies for determining pay.",
      "definition": "B...reduce her effort to match that of her co-workers.   C...ask for a raise."
    },
    {
      "term": "Some questions that can help managers think about employee perceptions of procedural justice include: (you must check all that apply)A.Did the procedure result in fair outcomes?B.During the procedure, did the manager treat the employee with respect?C.Has the procedure been free of bias?D.Has the procedure been applied consistently?E.Has an employee been able to express his/her views and feelings during the procedure?",
      "definition": "C.Has the procedure been free of bias?   D.Has the procedure been applied consistently?   E.Has an employee been able to express his/her views and feelings during the procedure?"
    },
    {
      "term": "Managers should only apply insights from psychology after they examine their workers and see...A...conscious-status individuals who are also concerned with norms or peer pressure.B...self-interested individuals working for money.C...individuals focused on obtaining intrinsic rewards and avoiding frustration.",
      "definition": "C...individuals focused on obtaining intrinsic rewards and avoiding frustration."
    },
    {
      "term": "Which one is not one of the characteristics of \"democratic leadership style\" according to Likert?A. Employee-centeredB. ConsiderationC. FlexibilityD. Concern for employees",
      "definition": "C. Flexibility"
    },
    {
      "term": "Performance bonus is an example of a/anA. Intrinsic rewardB. Extrinsic rewardC. intrinsic wage paymentD. Extrinsic wage payment",
      "definition": "B. Extrinsic reward"
    },
    {
      "term": "Norms or peer pressure can come from many sources, including... (Check 3 options)A...the worker as an individual.B...work group.C...organization.D...country.",
      "definition": "B...work group.   C...organization.   D...country."
    },
    {
      "term": "True or false: Various forms of social norms will always support managers in eliciting desired work behaviors.A.False.B.True.",
      "definition": "A.False."
    },
    {
      "term": "True or false: Because of biological differences, women are naturally suited to care for others, and this justifies an enduring, unequal sexual division of labor.A.FalseB.True",
      "definition": "A.False"
    },
    {
      "term": "For managers, what is the relevance of seeing work as caring for and serving others? (you must check all that apply)A.Caring for and serving others isn't real work so it has little to do with managers.B.Workers who value caring or serving might be demotivated if they feel that these meanings of work are devalued by an organization or a society.C.Workers who value caring or serving might be motivated if a manager provides opportunities for fulfilling these goals, either directly or indirectly.",
      "definition": "B.Workers who value caring or serving might be demotivated if they feel that these meanings of work are devalued by an organization or a society.   C.Workers who value caring or serving might be motivated if a manager provides opportunities for fulfilling these goals, either directly or indirectly."
    },
    {
      "term": "Managers should... (you must check all that apply)A.Recognize and reward performance.B.Do everyone else's job.C.Overlook the importance of humility, civility, and integrity.D.Hire and/or develop staff with the needed the knowledge, skills, and abilities (KSAs).",
      "definition": "A.Recognize and reward performance.   D.Hire and/or develop staff with the needed the knowledge, skills, and abilities (KSAs)."
    },
    {
      "term": "When managing in a unionized workplace, managers should... (you must check all that apply)A.Respect employee voice and the bilateral nature of the relationship with unions.B.Follow any required bargaining or consultation procedures.C.Blame the union if the relationship is adversarial or uncooperative.",
      "definition": "A.Respect employee voice and the bilateral nature of the relationship with unions.   B.Follow any required bargaining or consultation procedures."
    },
    {
      "term": "What does it mean to be a good front stage, backstage manager? (you must check all that apply)A.Shut people out and make backroom deals.B.When you are dealing with someone else, think about whether you have an audience and what the audience expects.C.Use the privacy of the backstage to exchange information, talk frankly, explore options, and problem solve.D.Get caught up in the emotions of front stage performances.E.When you are dealing with someone else, engage in perspective taking by considering whether they have an audience and what that audience expects.",
      "definition": "B.When you are dealing with someone else, think about whether you have an audience and what the audience expects.   C.Use the privacy of the backstage to exchange information, talk frankly, explore options, and problem solve.   E.When you are dealing with someone else, engage in perspective taking by considering whether they have an audience and what that audience expects."
    },
    {
      "term": "True or false: When thinking about protections against unjust or unfair \"adverse employment actions,\" this only applies to employee terminations.A.FalseB.True",
      "definition": "False"
    },
    {
      "term": "From a pluralist industrial relations perspective, laws are needed to balance efficiency, equity, and voice because... (you must check all that apply)( 2 đáp án )A...conflicts of interests in the employment relationship mean that managers cannot be relied on to look out for the welfare of employees.B....the interests of employees are more important than the interests of employers.C...employers typically have greater bargaining power than individual employees.",
      "definition": "A...conflicts of interests in the employment relationship mean that managers cannot be relied on to look out for the welfare of employees.   C...employers typically have greater bargaining power than individual employees."
    },
    {
      "term": "There's an asymmetry in the extent to which employment-at-will exists in most countries because...A. ...employees cannot quit for any reason but organizations can fire someone for any reason.B. ...employees can quit for any reason but organizations cannot fire someone for any reason.",
      "definition": "A. ...employees can quit for any reason but organizations cannot fire someone for any reason."
    },
    {
      "term": "Which one(s) of these are associated with the free market perspective on workplace law and regulation? (you must check all that apply)A.The role of the law should be limited to the smooth functioning of the employment relationship by providing orderly rules that facilitate economic transactions such as enforceable contracts and protections for property rights.B.Employment and labor laws are largely unnecessary because labor markets fairly reward employees.C.Some employment laws are useful to push companies toward win-win, high-road HR practices, and prevent the worst abuses that undermine good employers.",
      "definition": "A.The role of the law should be limited to the smooth functioning of the employment relationship by providing orderly rules that facilitate economic transactions such as enforceable contracts and protections for property rights.   B.Employment and labor laws are largely unnecessary because labor markets fairly reward employees."
    },
    {
      "term": "True or false: In the United States, there are no federal requirements for sick leave, paid holidays or vacations, or breaks, but some states require breaks based on time at work.A.TrueB.False",
      "definition": "A.True"
    },
    {
      "term": "U.S. labor law... (you must check all that apply)A....protects the right of employees to strike in all occupations, including in the entire public sector.B...protects workers joining together to increase their bargaining power and exercise voice, even without the presence of an actual labor union.C...requires organizations to bargain in good faith with labor unions that represent a majority of workers.D...provides for orderly procedures for determining when workers want to be represented by a union.",
      "definition": "B...protects workers joining together to increase their bargaining power and exercise voice, even without the presence of an actual labor union.   C...requires organizations to bargain in good faith with labor unions that represent a majority of workers.   D...provides for orderly procedures for determining when workers want to be represented by a union."
    },
    {
      "term": "........... is a formal &amp; detailed study of jobs.A. Job EvaluationB. Job AnaiysisC. Job ClassificationD. Job enrichment",
      "definition": "B. Job Anaiysis    C. Job Classification              A. Job Evaluation    C. Job Classification           C. Job Classification             B. Job Anaiysis  A. Job Evaluation  A. Job Evaluation      "
    },
    {
      "term": "HR should do more than just make sure that managers are complying with organizational policies and with legal regulations. In other words, HR should not be the HR ______.A.PoliceB. ManagersC. RegulatorsD. Supervisors",
      "definition": "A.Police"
    },
    {
      "term": "What are the cons of structured questionnaires?( chon 2)a. Time to developb. Can only be given to one employee at a timec. Distortion of responses",
      "definition": "a. Time to develop   c. Distortion of responses"
    },
    {
      "term": "What is a pros of job observation?a. Actual exposure to the jobb. Good for jobs done mentallyc. Requires some training time",
      "definition": "a. Actual exposure to the job"
    },
    {
      "term": "Is the ripple effect a potential disadvantage of an internal or external approach?a. Internalb. External",
      "definition": "a. Internal"
    },
    {
      "term": "True or false: Managers should manage defensively such that they primarily try to avoid legal action.A. TrueB. False",
      "definition": "B. False"
    },
    {
      "term": "True or False: external hires are 81% more likely to be fired from their new jobs than were those who had been promoted from within the firma. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "What is an option during a labor shortage? (chọn 2)a. Force someone to retireb. Fire an employee you don't likec. Reassign Workd. Outsource",
      "definition": "c. Reassign Work  d. Outsource"
    },
    {
      "term": "The benefits of being an Employer of Choice DOES NOT include:a. Likely to have a great reputationb. Probably make it easier to recruit new employeesc. Employees like working for your companyd. Guarantees business success",
      "definition": "d. Guarantees business success   c. Employees like working for your company       b. Probably make it easier to recruit new employees             c. Employees like working for your company           c. Employees like working for your company                a. Likely to have a great reputation   c. Employees like working for your company     "
    },
    {
      "term": "True or False: Global competition is a trend in the workforce.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "What are disadvantages of an external approach?a. Hurts moraleb. Lack of fresh ideasc. Less expensive",
      "definition": "a. Hurts morale"
    },
    {
      "term": "What does workforce planning do?(chọn 3)a. Align workforce requirements to strategic plansb. Identify and implement workforce shortage and reduction strategiesc. Discover where gaps exist between current and future competency requirementsd. None of the other",
      "definition": "a. Align workforce requirements to strategic plans  b. Identify and implement workforce shortage and reduction strategies  c. Discover where gaps exist between current and future competency requirements"
    },
    {
      "term": "Apple uses what competitive advantage?a. Customer Intimacyb. Operational Excellencec. Product Leadership",
      "definition": "c. Product Leadership"
    },
    {
      "term": "True or False: Training is important to creating an effective recruitera. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "What are potential targets for company's doing targeted recruiting?a. Raceb. Genderc. Studentsd. All of the above",
      "definition": "d. All of the above"
    },
    {
      "term": "What is the primary goal of training and development?A. behavioral modificationB. efficient orientationC. improved performanceD. federal compliance",
      "definition": "C. improved performance"
    },
    {
      "term": "What popular social media website is used in sourcing for recruitment? (also find passive candidates)a. Facebookb. Twitterc. LinkedIn",
      "definition": "c. LinkedIn"
    },
    {
      "term": "True or False: There is no law against using social media in the recruiting process?A. TrueB. False",
      "definition": "True"
    },
    {
      "term": "True or False: There is a federal law that prohibits the use of social media in the recruitment or background check process.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "What is the purpose of an affirmative action plan?a. to fill a quota of minoritiesb. to punish employersc. to improve employmentoutcomes for groups that have been traditionally underrepresented",
      "definition": "c. to improve employmentoutcomes for groups that have been traditionally underrepresented"
    },
    {
      "term": "What is the traditional EEOC definition for diversity?a. differences in gender, race, and ageb. all the ways in which we differc. different attitudes, perspectives and backgrounds among applicants",
      "definition": "a. differences in gender, race, and age"
    },
    {
      "term": "True or False: Diversity recruiting is a trenda. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "Inclusion is about...a. quantityb. qualityc. quantity and qualityd. none of the other",
      "definition": "b. quality"
    },
    {
      "term": "Select the factors that affect global markets( 3 đáp án )a. education-human capitalb. culturec. political-legal systemd. US unemployment rate",
      "definition": "a. education-human capital  b. culture  c. political-legal system"
    },
    {
      "term": "True or False: Applicant Tracking systems can be used to organize candidates who apply to a positiona. Trueb.False",
      "definition": "a. True"
    },
    {
      "term": "A background check can consist of... Check all that apply.a. Drug Screenb. Credit Checkc. Criminal Background Checkd. None of the other",
      "definition": "a. Drug Screen  b. Credit Check  c. Criminal Background Check"
    },
    {
      "term": "Firm based competencies are...a. How well will the candidate fit into the organizational cultureb. The specific capabilities that the job will require over the next few yearsc. The candidate has the skills to lead his or her prospective team, and how do they overlap with other members' skills",
      "definition": "a. How well will the candidate fit into the organizational culture"
    },
    {
      "term": "Workers reporting substance use and abuse... (check all that apply)a. have higher rates of turnover and absenteeismb. are more likely to have missed two + days of work in the past month due to illness or injuryc. are most likely to steal",
      "definition": "a. have higher rates of turnover and absenteeism  b. are more likely to have missed two + days of work in the past month due to illness or injury"
    },
    {
      "term": "The most effective disciplinary action addresses the employee's .........A. attitudeB. behaviorC. personalityD. conscience",
      "definition": "B. behavior"
    },
    {
      "term": "What laws apply to background checks? Select all that applya. Ban the Boxb. Fair Credit Reporting Actc. EEOCd. None of the other",
      "definition": "a. Ban the Box  b. Fair Credit Reporting Act  c. EEOC"
    },
    {
      "term": "True or False: Users are encouraged to use selection procedures which are just valid.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "How can you avoid bias?a. Trainingb. You cannot avoid biasc. Using one assessor",
      "definition": "a. Training"
    },
    {
      "term": "What would you do if an employee lied to you\" is an example of what kind of interview question?a. Knowledgeb. Situationalc. Behaviorald. Other",
      "definition": "b. Situational"
    },
    {
      "term": "True or False: You should complete an evaluation after each interview.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "True or False: A job description should be included in the offer packagea. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "Which of the following is NOT part of a performance management mindset?a. Performance management should be viewed as bottom line issue.b. Performance management should be viewed as an event.c. Performance management is about development of employees.",
      "definition": "b. Performance management should be viewed as an event."
    },
    {
      "term": "When performance is aligned with mission, strategy and goals, it can have a positive effect on which of the following?a. Customer satisfactionb. Profitabilityc. Employee satisfactiond. All of the above answers are correct",
      "definition": "d. All of the above answers are correct"
    },
    {
      "term": "Which of the following are NOT \"culture neutral\", from a performance management perspective?a. Individualistic type of organizationb. Aligning team and organizational goalsc. Providing clear expectations",
      "definition": "a. Individualistic type of organization"
    },
    {
      "term": "Senior management wants to develop a more strategic approach to performance management. Which of the follow shifts are needed to accomplish the transition?a. Have the managers drive the performance management program rather than just HR.b. Hold managers accountable for ongoing feedback for their employees.c. Use data to assess organizational strengths.d. All of the above answers are correct.",
      "definition": "d. All of the above answers are correct."
    },
    {
      "term": "A strategic performance management system seeks to achieve which of the following?a. Allow employees to get larger increases.b. Become more effective in document performance for legal and administrative purposes.c. Align mission, strategy and values with team and individual goals.d. Become more efficient in the administrative functions of performance management.",
      "definition": "c. Align mission, strategy and values with team and individual goals."
    },
    {
      "term": "As a member of the senior management team, you want to make sure there is consistency among the managers in various departments and no poorly written reviews with language that could cause legal in performance ratings. Which or the following design elements from the lecture would best accomplish those objectives?a. HR or management oversight.b. Transparency.c. Comprehensive.d. None of the answers are correct.",
      "definition": "a. HR or management oversight."
    },
    {
      "term": "Which of the following is a positive impact of performance management on the employees as discussed in the lecture?a. Decreased motivation due to no flexibility in their jobs.b. All of the other.c. Better understanding of the job duties and performance standards.d. Larger increases in compensation.",
      "definition": "c. Better understanding of the job duties and performance standards."
    },
    {
      "term": "Which of the following is NOT an ongoing performance activities outlined in the strategic performance management model?a. Employee coaching.b. Monitoring employee performance.c. Discussing the Job descriptions.d. Two way communication on performance activities.",
      "definition": "c. Discussing the Job descriptions."
    },
    {
      "term": "Which of the following training topics would help to best solve an issue of favoritism in the review process?a. Rater error training.b. Training on documenting performance.c. Handling difficult performance discussions.d. Performance review training.",
      "definition": "a. Rater error training."
    },
    {
      "term": "Which of the following is NOT a performance management best practice?a. Automate when possible for efficiency and better analytics.b. Have employees give reviews to their peers.c. Have a process to give employees a \"voice\" for input on performance management process.d. Ensure performance management processes are communicate to all employees.",
      "definition": "b. Have employees give reviews to their peers."
    },
    {
      "term": "Performance reviews have a number of purposes, which of the following would NOT be considered a purpose of the performance review?a. To build a case against an employee in order to terminate the employee.b. Platform for feedback.c. Identifies areas for development.d. Motivational tool.",
      "definition": "a. To build a case against an employee in order to terminate the employee."
    },
    {
      "term": "Which of the following methods of job analysis takes time to develop and may have the problem of distorted responses?A. Critical incident analysisB. Job observationC. Structured questionnaireD. Job performance",
      "definition": "C. Structured questionnaire"
    },
    {
      "term": "What is the NOT an advantage of a common window approach?a. Gives manager an opportunity to review all at their employees at the same time.b. Is easier to allocate salary increases based on performance.c. More likely manager will accurately assess / compare employee performance.d. The common window approach can be time consuming if the manager has a large number of employees.",
      "definition": "d. The common window approach can be time consuming if the manager has a large number of employees."
    },
    {
      "term": "Which of the following components of feedback is considered ineffective (avoid this)?a. Feedback should be given in the form of a feedback \"sandwich\" (e.g. You did great, but ...).b. Identify consequences for not improving performance.c. Feedback must be verifiable.d. Give feedback privately.",
      "definition": "a. Feedback should be given in the form of a feedback \"sandwich\" (e.g. You did great, but ...)."
    },
    {
      "term": "Which of the following are desired characteristics in the person selected to give feedback in the multi-rater process?( 3 đáp án ) a. Increases legal liability because non-managers are involved in the process.b. Someone who has observed the employees behavior.c. Someone who will be brutally honest with the employee.d. Conveys a strong commitment to the performance management process.",
      "definition": "a. Increases legal liability because non-managers are involved in the process. b. Someone who has observed the employees behavior. d. Conveys a strong commitment to the performance management process."
    },
    {
      "term": "\"Disseminator\" meansA. A person who gets the information from outsideB. A person who disperses the information into the unitC. A person who processes the information after getting it from other peopleD. None of the answers are correct",
      "definition": "B. A person who disperses the information into the unit"
    },
    {
      "term": "There are a number of pro's and con's for multi-rater feedback. Which of the following are reasons why we might want to use multi-rater feedback?( 3 đáp án )a. It reduces manger's workload, because they will not be the only one involved in the performance review process.b. Employees will have a chance to receive feedback from other people besides their managers.c. Multi rater feedback decreases potential bias.d. Multi rater feedback provides a platform for managers to discuss difficult issues.",
      "definition": "b. Employees will have a chance to receive feedback from other people besides their managers.  c. Multi rater feedback decreases potential bias.  d. Multi rater feedback provides a platform for managers to discuss difficult issues."
    },
    {
      "term": "Feedback is a key ingredient in helping employees grow. Without feedback it is difficult to understand areas for development. Which of the following costs do we suffer when we do NOT give employees feedback?\"( 3 đáp án ) a. Employees are not given direction on \"development opportunities\" (areas to improve).b. Chronic poor performance.c. Employees have an inaccurate perception of their performance.d. Consistent lateness.",
      "definition": "a. Employees are not given direction on \"development opportunities\" (areas to improve).  b. Chronic poor performance.  c. Employees have an inaccurate perception of their performance."
    },
    {
      "term": "Healthy and safe employees are more likely to ( ) A. earn managerial promotionsB. request salary increasesC. remain productiveD. join labor unions",
      "definition": "C. remain productive"
    },
    {
      "term": "Non-monetary rewards are:a. Very common, but often customizedb. Valued by employeesc. Valuable to employersd. All of the above",
      "definition": "d. All of the above"
    },
    {
      "term": "Which of the following are considered intentional errors in the performance evaluation process?a. Leniency and strictness errors.b. Similar to me / different from me errors.c. Recency / primacy effect errors.d. Sampling error.",
      "definition": "a. Leniency and strictness errors."
    },
    {
      "term": "Managers sometimes inflate and deflate ratings for various reasons. Which of the following best describes the actual impact of rater inflation / deflation (i.e. a reason why we should NOT inflate/deflate ratings)?a. Inflating ratings will give a well deserved raise and will increase performance.b. Inflating ratings does not give employees to get accurate feedback. Thus, the employee is denied the opportunity to actually improve performance.c. Deflating employee errors will teach employees a lesson and send a message that you are a tough manager.d. Inflating rating will create better performance because the employee will feel better.",
      "definition": "b. Inflating ratings does not give employees to get accurate feedback. Thus, the employee is denied the opportunity to actually improve performance."
    },
    {
      "term": "Three of the following are typically components of \"rater error training.\" Which of the following components is NOT a typical part of \"rater error training\" programs as discussed in our video lessons?a. Understand different types of rater errors/distortions and why managers commit these errors.b. Big picture overview of the performance management system.c. Calibration and frame of reference training.d. Understanding of the compensation system.",
      "definition": "d. Understanding of the compensation system."
    },
    {
      "term": "The reasoning behind the quote \"culture eats strategy for breakfast\" is best described as:a. Culture will undermine the strategy if employees are not on board.b. Culture is far more important than any strategy.c. Senior managers do not value strategy.",
      "definition": "a. Culture will undermine the strategy if employees are not on board."
    },
    {
      "term": "In one of our video lectures, we used a parking sign as potential symbol of culture. It read Reserved \"Executive Parking Only\" . What does this say about the culture of that organization?a. Employee focused.b. Customer focused.c. Hierarchy focused.",
      "definition": "c. Hierarchy focused."
    },
    {
      "term": "One of our lectures discussed the \"3 R's\" as a model for civility. This was a way to strengthen the organization's cultural immunity system. Which of the below is/are sign(s) of respect? (choose all that apply)a. Active listening.b. Inclusion of others.c. Pro-activity.d. Direct communication with positive tone and non verbals.",
      "definition": "a. Active listening.  b. Inclusion of others.  d. Direct communication with positive tone and non verbals."
    },
    {
      "term": "Do unto others as they would have done unto themselves\" was identified as:a. The Customer Rule.b. The Platinum Rule.c. The Golden Rule.",
      "definition": "b. The Platinum Rule."
    },
    {
      "term": "The hard costs of incivility are more easily quantifiable or identified. Which of the following is a hard cost of incivility?a. Difficulty hiring and attracting applicants.b. Quit and stay employees.c. Reputation in the market place.d. Costs of recruiting and retaining.",
      "definition": "d. Costs of recruiting and retaining."
    },
    {
      "term": "Which of the following would be considered \"organizational civility dividends\" resulting from a positive workforce culture?\"( 3 đáp án )a. Increased employee turnover.b. Employer of choice.c. Increased share price.d. Customers as promoters.",
      "definition": "b. Employer of choice.  c. Increased share price.  d. Customers as promoters."
    },
    {
      "term": "Which of the following organizational strategies is most effective in building a positive culture?a. Innovationb. Strengths based / Appreciative inquiry approachc. Product excellence",
      "definition": "b. Strengths based / Appreciative inquiry approach"
    },
    {
      "term": "Leaders in organizations that embrace civility are held accountable for all of the following EXCEPT:a. Modeling behaviors.b. Reinforcing desired behaviors.c. Coaching employees on positive behaviors.d. Ensuring attendance policies are enforced.",
      "definition": "d. Ensuring attendance policies are enforced."
    },
    {
      "term": "Building civility into the fabric of your HR practices is the key to linking performance and culture. Which of the following was NOT part of the fabric?a. Treat the employee with respect during the termination process.b. Have your marketing plan include culture.c. Have recruiters include culture in the recruiting materials.d. During exit interviews ask the question of why the started to look elsewhere.",
      "definition": "b. Have your marketing plan include culture."
    },
    {
      "term": "Allowing for mistakes is a sound strategy for a positive culture.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "Which of the following is NOT an element of the pay mix?a. Base cashb. Short term incentivesc. Long-term incentivesd. Key performance indicatorse. Benefits",
      "definition": "d. Key performance indicators"
    },
    {
      "term": "Which of the following statements about the Strategic Messaging Model is NOT correct?a. Messaging includes how we communicate the pay mix to employees.b. Mix includes relative allocation of compensation across the pay mix.c. Money includes the value of the total compensation package.d. In general, we choose our money, mix, and messaging before we choose whom we want to attract, retain, and motivate.",
      "definition": "d. In general, we choose our money, mix, and messaging before we choose whom we want to attract, retain, and motivate."
    },
    {
      "term": "Which of the following statements about the Strategic Messaging Model is correct?A. Messaging includes how we communicate the pay mix to employees.B. In general, we choose our money, mix, and messaging before we choose whom we want to attract, retain, and motivate.C. When choosing the messages there is no need to ask how any one benefit offering boosts the employee value propositionD. B and C",
      "definition": "A. Messaging includes how we communicate the pay mix to employees."
    },
    {
      "term": "Suppose your organization wants to match pay on the external labor market. Using surveys, you find that the median pay in the external market for that job is $35,000 per year. Which of the following is true?a. The bottom of the pay range for that job should be $35,000 per year.b. The top of the pay range for that job should be $35,000 per year.c. The typical employee for that job should earn about $35,000 per year.d. The cap in pay for employees in that job should end at $35,000 per year.e. Entry-level employees for that job should begin at $35,000 per year.",
      "definition": "c. The typical employee for that job should earn about $35,000 per year."
    },
    {
      "term": "Which of the following statements about compensation surveys is FALSE?a. For compliance, compensation departments should use third-parties to administer surveys.b. For compliance, compensation departments should make sure pay survey data are more than three months old.c. For best accuracy, compensation departments should make sure that internal jobs and benchmarked jobs are in the same industry and geography.d. For best accuracy, compensation departments should make sure that internal jobs and benchmarked jobs have the same job titles.",
      "definition": "d. For best accuracy, compensation departments should make sure that internal jobs and benchmarked jobs have the same job titles."
    },
    {
      "term": "Suppose that some new technology (like Coursera!) instantly made it cheap and easy for anyone to become a lawyer. What effect will this have on labor supply and labor demand?a. Labor demand will increaseb. Neither curve will changec. Labor demand will decreased. Labor supply will increasee. The labor supply and labor demand curves will both changef. Labor supply will decrease",
      "definition": "d. Labor supply will increase"
    },
    {
      "term": "Consider the following statements about employees who are promoted. Which is NOT true?a. Employees who are promoted will change job grades.b. Employees who are promoted can go from relatively high on their grade's pay range to being relatively low of the new grade's pay range.c. Employees who are promoted will generally see an increase in base pay.d. An employee who is promoted will get a new pay range, with the maximum of the pay range corresponding to base plus the total possible incentive pay.",
      "definition": "d. An employee who is promoted will get a new pay range, with the maximum of the pay range corresponding to base plus the total possible incentive pay."
    },
    {
      "term": "Which of the following statements about pay structures and internal benchmarks is NOT correct?a. Pay tends to increase in job grades because higher grades tend to have workers with greater skills and experience.b. Pay tends to increase in job grades because higher grades tend to have workers whose productivity is associated with greater revenue.c. The control rates tell you the pay at benchmarked jobs.d. The pay policy line must perfectly intersect all of the control rates.",
      "definition": "d. The pay policy line must perfectly intersect all of the control rates."
    },
    {
      "term": "Using a typical merit-based raise criteria, which of the following employees would likely get the largest annual raise?a. An employee high on the pay range, with high evaluations.b. An employee low on the pay range, with high evaluations.c. An employee who has not been recently promoted, but has been receiving high evaluations for a long time.d. An employee in the middle of the pay range with average evaluations.",
      "definition": "b. An employee low on the pay range, with high evaluations."
    },
    {
      "term": "When interviewing a candidate for a sales position, the recruiter notices that the candidate has a very weak handshake. The recruiter happens to believe that people with a weak handshake is not very assertive, which is a key component of being a salesperson- 80 throughout the rest of the interview, the recruiter will interpret everything the candidate says to show that she is not assertive. This is an example of the:A. Contrast biasB. ln-group biasC. Confirmation biasD. Halo bias",
      "definition": "C. Confirmation bias"
    },
    {
      "term": "Which of the following statements about pay bands is NOT true?a. They typically span multiple non-contiguous grades within the same ladder (e.g. associates are levels 1-3 and 7-9).b. They typically combine multiple contiguous grades.c. They typically combine jobs that are roughly similar in job level, prestige, and pay.",
      "definition": "a. They typically span multiple non-contiguous grades within the same ladder (e.g. associates are levels 1-3 and 7-9)."
    },
    {
      "term": "Which of the following scenarios illustrates the halo bias?a. The evaluator knows that the employee has EXCELLENT reliability. This contaminates his ratings for the employee's technical skills, customer service skills, and willingness to help others. The latter ratings are now biased UPWARD.b. The evaluator knows that the employee has POOR technical skills. This contaminates her ratings for the employee's reliability, customer service skills, and willingness to help others. The latter ratings are now biased UPWARD.c. The evaluator knows that the employee has POOR technical skills. This contaminates her ratings for the employee's reliability, customer service skills, and willingness to help others. The latter ratings are now biased DOWNWARD.d. The evaluator knows that the employee has EXCELLENT reliability. This contaminates his ratings for the employee's technical skills, customer service skills, and willingness",
      "definition": "a. The evaluator knows that the employee has EXCELLENT reliability. This contaminates his ratings for the employee's technical skills, customer service skills, and willingness to help others. The latter ratings are now biased UPWARD."
    },
    {
      "term": "What performance metric might be found on Behaviorally-Anchored Rating Scale?a. The employee's customer satisfaction scores are at least 4.5 out of 5.0.b. The employee displays courtesy and patience when speaking to frustrated customers.c. The employee generates $10 million in new business.",
      "definition": "b. The employee displays courtesy and patience when speaking to frustrated customers."
    },
    {
      "term": "Which of the following are NOT an example of a Key Performance Indicators?a. Average customer service scoreb. Total dollar value of sales generatedc. Year-end bonusd. Units produced",
      "definition": "c. Year-end bonus"
    },
    {
      "term": "Which of the following statements about tournament incentives is accurate? (check all that apply)a. Tournament incentives work well when employees work together in teamsb. Tournament incentives promote competition between employeesc. Tournament incentives helps maintain the effectiveness of incentives when outside factors affect many employees' productivityd. Tournament incentives encourage employees to share best practices",
      "definition": "b. Tournament incentives promote competition between employees c. Tournament incentives helps maintain the effectiveness of incentives when outside factors affect many employees' productivity"
    },
    {
      "term": "Which of the following statements about tournament incentives is accurate? a. Tournament incentives work well when employees work together in teamsb. Tournament incentives promote competition between employeesc. Tournament incentives helps maintain the effectiveness of incentives when outside factors affect many employees' productivityd. Tournament incentives encourage employees to share best practices",
      "definition": "c. Tournament incentives helps maintain the effectiveness of incentives when outside factors affect many employees' productivity"
    },
    {
      "term": "When India was a British Colony, the British tried to reduce the population of cobras by providing incentives for people to hunt them. They did so by providing a bounty for dead cobras. However, this led people to begin breeding snakes, so that they may be slaughtered and delivered for bounty. Ultimately, this incentive suffered from thea. Control problemb. Alignment problemc. Measurement problemd. Metering problem",
      "definition": "b. Alignment problem"
    },
    {
      "term": "A salesperson is paid 1% of revenue generated up to $1,000,000, 2% of revenue generated up to $2,000,000, and 3% of revenue generated thereafter. This is an example of what kind of an incentive?a. Flatb. Acceleratedc. Linear (positive slope)d. Linear (negative slope)",
      "definition": "b. Accelerated"
    },
    {
      "term": "Which of the following statements is true?a. Phantom shares work like stock grants, except the criteria for granting them is known only to the firm.b. Performance shares are only issued after a stock reaches a certain price.c. Stock options are only issued after a stock reaches a certain price.",
      "definition": "b. Performance shares are only issued after a stock reaches a certain price."
    },
    {
      "term": "When an employee joins her organization, she gets an option to purchase 1000 shares with a strike price of $2 per share, and these shares vest over four years. One year later, the stock price is $3 per share. Two years later, the stock price is $4 per share. The employee then quits and exercises any vested options. Which of the following statements is true?a. The employee exercises the option, purchasing 250 shares at $3 per share, and 250 shares at $4 per share.b. The employee exercises the option to purchase 500 shares, paying $2 per share.c. The employee exercises the option to purchase 1000 shares, paying $4 per share.d. The employee exercises the option to purchase 500 shares, paying $4 per share.e. The employee exercises the option to purchase 1000 shares, paying $2 per share.f. The employee cannot exercise any options.",
      "definition": "b. The employee exercises the option to purchase 500 shares, paying $2 per share."
    },
    {
      "term": "Which of these employees is most likely to receive a stock option that is qualified under the IRS Code Section 409A, meaning that any incentives would qualify as an incentive stock option (ISO)?a. A Chief Financial Officer whose compensation package includes a stock option grant.b. A programmer whose compensation package includes a stock option grant.c. A barista who participates in his employer's employee stock option purchase program.",
      "definition": "a. A Chief Financial Officer whose compensation package includes a stock option grant."
    },
    {
      "term": "Which of the following statutes provides job-protected unpaid leave for new parents?a. FMLAb. FLSAc. EEOd. NLRA",
      "definition": "a. FMLA"
    },
    {
      "term": "Which of the following would be TRUE of someone recognized by the FLSA as a trainee?a. The trainee would not provide immediate benefit to their employer.b. The trainee's job duties would be exempt under the FLSA.c. The trainee's employer would be not covered under the FLSA.d. The trainee must not be paid more than $455 per week.e. All of the other.f. None of the other.",
      "definition": "a. The trainee would not provide immediate benefit to their employer."
    },
    {
      "term": "Suppose that, for some condition, an insuree has a $1,000 deductible and 50% coinsurance until a $10,000 cap. The health care provider's fees amount to $600. What is the insuree's liability?a. $600b. $0c. $1,000d. $300",
      "definition": "a. $600"
    },
    {
      "term": "Which of the following statements about the ACA health insurance exchange marketplaces are correct?a. All states have their own state-specific health insurance exchanges.b. All states participate in the health insurance exchange created by the federal government.c. Some states create health insurance exchanges, and other states defer to an exchange set up by the federal government.",
      "definition": "c. Some states create health insurance exchanges, and other states defer to an exchange set up by the federal government."
    },
    {
      "term": "True or False: Defined contribution plans are generally tax advantaged because they allow you to defer taxable income until you're in a lower tax bracket.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "Li Li's pension fund mandates that she will receive $1800 per month for the rest of her life. This is an example of what kind of fund?a. Defined Contribution (e.g. 401k)b. Defined Benefitc. Simplified Employee Pension",
      "definition": "b. Defined Benefit"
    },
    {
      "term": "Pierre's pension plan allows him to choose the amount of his contribution and how his contributions are invested. The better his chosen investments perform, the more money he'll have in his plan's account when he retires. This is an example of what kind of a pension plan?a. Defined Contribution (e.g. 401k)b. Social Securityc. Defined Benefit",
      "definition": "a. Defined Contribution (e.g. 401k)"
    },
    {
      "term": "Which of the following is generally regarded as a best practice?a. Shifting the allocation of a pension fund away from stocks and toward investment grade bonds as workers approach retirement age.b. Actively picking individual stocks with a pension fund.c. Choosing funds with high management fees.",
      "definition": "a. Shifting the allocation of a pension fund away from stocks and toward investment grade bonds as workers approach retirement age."
    },
    {
      "term": "Which of the following is a TRUE statements about ERISA?a. ERISA provides minimum standards of fiduciary responsibility for employers that provide pension plans.b. ERISA requires that employers that offer pension plans contribute at least 3% of an employee's salary.c. ERISA requires that employers provide access to a qualified pension plan.",
      "definition": "a. ERISA provides minimum standards of fiduciary responsibility for employers that provide pension plans."
    },
    {
      "term": "Non-monetary rewards are:a. Always less important than cash compensationb. Always more important than cash compensationc. Only important when you are newly hiredd. Important to both employees and employers",
      "definition": "d. Important to both employees and employers"
    },
    {
      "term": "When it comes to Non-Monetary Rewards, employers think:a. This is a big waste of timeb. It will cost way too much moneyc. We can offer non-monetary rewards so that we can reduce employee compensationd. This might be a good way to show our company culture and values",
      "definition": "d. This might be a good way to show our company culture and values"
    },
    {
      "term": "For recognition to be effective it should:a. Recognize something importantb. Include a cash awardc. Be given by the CEOd. Be done in a way that is meaningful in the culture",
      "definition": "Be done in a way that is meaningful in the culture | Recognize something important"
    },
    {
      "term": "(Check 2 đáp án) In implementation, non-monetary rewards program designs:a. Can be informal, and set up between a manager and the employeeb. Should be very formalized, and include many details, options and approvalsc. Can be formal, and set up by the company, likely including written guidelines or practicesd. Must be kept confidential, and implemented occasionally",
      "definition": "a. Can be informal, and set up between a manager and the employee c. Can be formal, and set up by the company, likely including written guidelines or practices"
    },
    {
      "term": "QN=36 (Check all) Employees who want work flexibility:a. Might prefer to work on a part-time scheduleb. Are sometimes people dealing with family emergenciesc. Could be anyone. Almost all of us need work flexibility at some pointd. Are lazy and do not want to work very hard",
      "definition": "a. Might prefer to work on a part-time schedule b. Are sometimes people dealing with family emergencies c. Could be anyone. Almost all of us need work flexibility at some point"
    },
    {
      "term": "True or false: managers cannot be leaders, and leaders cannot be managers.A.TrueB.False",
      "definition": "B.False"
    },
    {
      "term": "QN=38 Can things go wrong with non-monetary reward programs?a. Yes, despite best intentions.b. Maybe, but you have to be very unluckyc. Not really. Problems mostly occur in cash compensation programs",
      "definition": "a. Yes, despite best intentions."
    },
    {
      "term": "Why is job analysis an important process?A.Because it provides a performance rating for each employee that serves as the basis for compensation and rewards.B.Because it puts work tasks together into sensible jobs and identifies job requirements that serve as the basis for hiring employees.C.Because it reveals the strengths and weaknesses of employees that serve as the basis for training employees and establishing developmental goals.",
      "definition": "B.Because it puts work tasks together into sensible jobs and identifies job requirements that serve as the basis for hiring employees."
    },
    {
      "term": "Which best describes the foundational assumptions of Taylorism, also known as scientific management?A.To manage workers effectively, managers need to pay attention to psychological and social conditions, not just technical conditions.B..Business owners are industrious, ambitious, thrifty, and sober; workers are not.c.Workers are diverse so they need to be managed in ways tailored to their own goals and values.D.Workers want to earn income in the most efficient way possible, but it is managers who best know how to structure work tasks to fulfill this goal.",
      "definition": "D.Workers want to earn income in the most efficient way possible, but it is managers who best know how to structure work tasks to fulfill this goal."
    },
    {
      "term": "An organization's strategy for managing people is determined...A.Solely by internal factors (such as business strategy).B.Solely by organizational choices and values without paying any attention to external or internal factors.C.Partly by a combination of external factors (such as competition), internal factors (such as business strategy), but not completely because organizations have choices about how to manage people.D.Solely by various external factors (such as competition).",
      "definition": "C.Partly by a combination of external factors (such as competition), internal factors (such as business strategy), but not completely because organizations have choices about how to manage people."
    },
    {
      "term": "True or false: In selecting a personal managerial style, managers should only pay attention to their own strengths and weakness, not the situation or the needs of employees.A.FalseB.True",
      "definition": "A.False"
    },
    {
      "term": "Which of the following beliefs typically underlies low-road human resources strategies?A.A business serves society best by satisfying market demand for its goods and services and providing high financial returns for shareholders.b.Corporations are a part of society and should serve not just shareholders and customers, but other stakeholders, too.",
      "definition": "A.A business serves society best by satisfying market demand for its goods and services and providing high financial returns for shareholders."
    },
    {
      "term": "Which is the single-best personal managerial style?A.Coercive.B.AuthoritativeC.AffiliativeD.DemocraticE.PacesettingF.CoachingG.None of the above because there is no single-best style that fits with all situations.",
      "definition": "G.None of the above because there is no single-best style that fits with all situations."
    },
    {
      "term": "Most individuals in modern societies need to work for pay in order to survive. So this means that which of the following are important for managers? (you must check all that apply)A.Financial stress can take on extra meaning in the workplace.B.Work can seem like a curse (the way it's always been, the way it will always be).C.People only work for money (that is, money is the sole motivator for all workers).",
      "definition": "A.Financial stress can take on extra meaning in the workplace. B.Work can seem like a curse (the way it's always been, the way it will always be)."
    },
    {
      "term": "When Dan has a better performance than other teammates, he gets a larger raise in his monthly salary. This is an example of tying performance evaluation to which component of the pay mix?A. Long-term incentivesB. Short-term incentivesC. Benefits and perksD. Base cash",
      "definition": "B. Short-term incentives"
    },
    {
      "term": "A human resource information system (HRIS) is essential to all of the following HR responsibilities EXCEPT ( )A. recruitment and selectionB. creation of mobile HR applicationsC. oversight of legal and regulatory complianceD. benefits administration",
      "definition": "B. creation of mobile HR applications"
    },
    {
      "term": "What type work does a human resource generalist performs?A. very repetitiveB. highly specialized in natureC. wide variety of human resource-related activitiesD. one of the five functional areas of human resource management",
      "definition": "C. wide variety of human resource-related activities"
    },
    {
      "term": "Steve is an HR specialist at Cisco Systems. Steve needs to determine the number, skill, and location of employees that Cisco will need in 12 months in order to achieve the tirm's strategic plan. Which of the following would best meet Steve's needs?A. laborsupply analysisB. availability forecastC. sales forecastingD. requirements forecast",
      "definition": "D. requirements forecast"
    },
    {
      "term": "The .............of appraisal compares each employee's performance to a predetermined standard or expected level of output.A. behaviorally anchored rating scale methodB. critical incident methodC. forced distribution methodD. work standards method",
      "definition": "D. work standards method"
    },
    {
      "term": "How many percent of companies which are excellent of developing millennial leader?A. 9B. 7C. 8D. 10",
      "definition": "B. 7"
    },
    {
      "term": "True or false: Many countries outside of the United States have greater protections against unjust dismissal, require employment contracts, and mandate a variety of leave benefits.A.TrueB.False",
      "definition": "A.True"
    },
    {
      "term": "A popular appraisl method involves input Wom-mulrm and external sources is best known as .......A. paired comparisonB. criticaiincidentC. rating scaleD. 360-degree feedback evaluation",
      "definition": "D. 360-degree feedback evaluation"
    },
    {
      "term": "What human resource task pervades all functional areas of human resource management?A. trainingB. human resource planningC. human resource researchD. developmentDevelopment)\" class=\"ZoomableImage-rawImage SetPageTerm-image\" height=\"100\" src=\"https://quizlet.com/cdn-cgi/image/f=auto,fit=cover,h=200,onerror=redirect,w=240/https://o.quizlet.com/SLASMbfMJarRjyOwPcVrzg.png\" width=\"120\" loading=\"lazy\">",
      "definition": "D. developmentDevelopment)\" class=\"ZoomableImage-rawImage SetPageTerm-image\" height=\"100\" src=\"https://quizlet.com/cdn-cgi/image/f=auto,fit=cover,h=200,onerror=redirect,w=240/https://o.quizlet.com/SLASMbfMJarRjyOwPcVrzg.png\" width=\"120\" loading=\"lazy\">      A. training      A. training         C. human resource research    A. training        A. training D. developmentDevelopment)\" class=\"ZoomableImage-rawImage SetPageTerm-image\" height=\"100\" src=\"https://quizlet.com/cdn-cgi/image/f=auto,fit=cover,h=200,onerror=redirect,w=240/https://o.quizlet.com/SLASMbfMJarRjyOwPcVrzg.png\" width=\"120\" loading=\"lazy\">    A. training       C. human resource research     A. training   A. training   A. training         A. training         C. human resource research    A. training  A. training           D. developmentDevelopment)\" class=\"ZoomableImage-rawImage SetPageTerm-image\" height=\"100\" src=\"https://quizlet.com/cdn-cgi/image/f=auto,fit=cover,h=200,onerror=redirect,w=240/https://o.quizlet.com/SLASMbfMJarRjyOwPcVrzg.png\" width=\"120\" loading=\"lazy\">           "
    },
    {
      "term": "Perfect competition is an important issue to consider because...A...if labor markets truly are perfectly competitive, then the invisible hand of free market competition is the best way to (a) allocate labor to its best uses, and (b) reward employees with pay equal to the value they produce.B...if labor markets truly are perfectly competitive, then interventions like labor unions or government regulation will not distort (a) the allocation of labor to its best uses, and (b) the rewarding of employees with pay equal to the value they produce.C...employers need to recruit and retain employees and this happens in labor markets with labor traded like a commodity",
      "definition": "A...if labor markets truly are perfectly competitive, then the invisible hand of free market competition is the best way to (a) allocate labor to its best uses, and (b) reward employees with pay equal to the value they produce."
    },
    {
      "term": "In a .............interview, a panel questions several candidates simultaneously.A. formalB. massC. panelD. topical",
      "definition": "B. mass"
    },
    {
      "term": "As a pediatric nurse, Cary experiences a significant amount of job satisfaction, which is considered............A. indirect compensationB. personal equityC. nonfinancial compensationD. organizational fit",
      "definition": "C. nonfinancial compensation"
    },
    {
      "term": "Which of the following is the most commonly used selection tool?A. interviewB. telephone mferenceC. personality testD. referenceletter",
      "definition": "A. interview"
    },
    {
      "term": "QN=57 Employees generally want the same out of the review process as managers do. Which of the following represents what employees want from the review process?( 3 đáp án )a. Job enrichment and career opportunities.b. Feedback on a regular basis.c. Involvement in goal setting.d. Writing their own Job descriptions.",
      "definition": "a. Job enrichment and career opportunities. b. Feedback on a regular basis. c. Involvement in goal setting."
    },
    {
      "term": "In the Job characteristics approach, which element answers the question of whether the employee owns the task from start to finish?A. AutonomyB. Skill varietyC. Task significanceD. Task identity",
      "definition": "D. Task identity"
    },
    {
      "term": "\"What would you do if an employee lied to you\" is an example of what kind of interview?A. KnowledgeB. OtherC. Behavioral.D. Situational.",
      "definition": "D. Situational."
    },
    {
      "term": "Examples of gaining compelling future through non-monetary rewards DOES NOT include:A. Company reputationsB. Learning. mentoring and feedbackC. CompanyvaluesD. Personal growth",
      "definition": "A. Company reputations"
    },
    {
      "term": "Which of the following are advantages of hiring internally?chose 2 a. Encourages long-term commitmentb. Nice PR for organizationsc. Increases diversityd. Allows for new ideas",
      "definition": "a. Encourages long-term commitment b. Nice PR for organizations"
    },
    {
      "term": "A person with high openness to experience mightA. have high emotional intelligence. social intelligence or even cultural intelligenceB. be very loyal and committed to their organizationsC. adapt to change quicklyD. be trustworthy",
      "definition": "C. adapt to change quickly                A. have high emotional intelligence. social intelligence or even cultural intelligence  A. have high emotional intelligence. social intelligence or even cultural intelligence     C. adapt to change quickly          C. adapt to change quickly         C. adapt to change quickly      C. adapt to change quickly         A. have high emotional intelligence. social intelligence or even cultural intelligence        C. adapt to change quickly        C. adapt to change quickly       C. adapt to change quickly A. have high emotional intelligence. social intelligence or even cultural intelligence  "
    },
    {
      "term": "................. helps the organization in achieving short term and long term goals by effective utilization of human resources. It involves the development of HR objectives and their alignment with organizational objectivesA. Employee relations managementB. Human relations managementC. Strategic human resource managementD. Compensation management",
      "definition": "C. Strategic human resource management"
    },
    {
      "term": "Which of the following is an example of indirect financial compensation?A. social securityB. sales commissionC. annual bonusD. hourly wage",
      "definition": "A. social security"
    },
    {
      "term": "Which of the following is not indicated by high motivating potential score?A. High employee motivationB. High employee performanceC. High employee turnoverD. High employee satisfaction",
      "definition": "C. High employee turnover"
    },
    {
      "term": "All of the following are categories of employment compensation EXCEPT ( )A. direct financialB. nonfinancialC. indirect financialD. psychological",
      "definition": "D. psychological"
    },
    {
      "term": "The ability to recognize and manage emotions is best known as ..............A. interpersonal communicationB. emotional analysisC. behavioral managementD. emotional intelligence",
      "definition": "D. emotional intelligence"
    },
    {
      "term": "Wages, salaries, and commissions are most likely examples of .............A. indirect financial compensationB. employmeniincentivesC. employment benefitsD. direct financial compensation",
      "definition": "D. direct financial compensation"
    },
    {
      "term": "Economic theorizing sees work as both a pain cost and an opportunity cost. This is useful for managers because.......A. ...this means workers will never want to work hard.B. ...this means that there are never any psychological rewards from working.C. ...this means that managers have to compensate workers for these costs in order to get them to work hard.",
      "definition": "C. ...this means that managers have to compensate workers for these costs in order to get them to work hard."
    },
    {
      "term": "The process of determining the specific tasks to be performed, the methods used in performing these tasks, and how the job relates to other work in the organization refers to (......... )A. job designB. job analysisC. job enrichmentD. job enlargement",
      "definition": "B. job analysis            B. job analysis  D. job enlargement          D. job enlargement              B. job analysis   A. job design     A. job design  D. job enlargement          B. job analysis           A. job design                A. job design   A. job design    C. job enrichment   A. job design     B. job analysis  A. job design        C. job enrichment   D. job enlargement             A. job design        A. job design               D. job enlargement          A. job design C. job enrichment              C. job enrichment               A. job design            C. job enrichment      B. job analysis           B. job analysis  D. job enlargement                  A. job design  A. job design                A. job design        A. job design    A. job design     C. job enrichment    A. job design      A. job design            C. job enrichment    C. job enrichment  A. job design C. job enrichment            A. job design C. job enrichment              B. job analysis  A. job design  A. job design                 C. job enrichment              A. job design   C. job enrichment A. job design      D. job enlargement            A. job design      D. job enlargement       A. job design  D. job enlargement          B. job analysis             C. job enrichment   D. job enlargement     B. job analysis           D. job enlargement     A. job design    B. job analysis  A. job design        A. job design   C. job enrichment        C. job enrichment        B. job analysis     C. job enrichment C. job enrichment                 B. job analysis      A. job design D. job enlargement D. job enlargement          B. job analysis  A. job design  A. job design        D. job enlargement                    A. job design  D. job enlargement    C. job enrichment              D. job enlargement           B. job analysis  "
    },
    {
      "term": "A document that provides information regarding the tasks, duties, and responsibilities of the job is referred to as a ...........A. job analysisB. job descriptionC. job specificationD. job document",
      "definition": "B. job description"
    },
    {
      "term": "Which of the following companies was cited as an example of operational excellence in the lesson?A. NikeB. AppleC. NordstromsD. FedEx",
      "definition": "D. FedEx"
    },
    {
      "term": "Select the challenges for mobile device usage recruitmenta. Timeb. Testingc. Text/Contentd. All of the above",
      "definition": "d. All of the above"
    },
    {
      "term": "Michael's pension fund mandates that he will receive $2000 per month for the rest of her life. This is an example of what kind of pension plan?A. Simplified Employee PensionB. Defined BenefitC. Defined ContributionD. All of these",
      "definition": "B. Defined Benefit"
    },
    {
      "term": "The process of determining and recording all the pertinent information about a specific including the tasks involved, the knowledge and skill sets required to perform the job is termedjob, asA. Job descriptionB. Job designC. JobAnalysisD. Job evaluation",
      "definition": "C. JobAnalysis"
    },
    {
      "term": "Students give feedbacks on teachers' teaching skills. This evaluation is an example of....... A. A realistic evaluation B. Management by Objectives (MBO)C. Behaviorally-Anchored Rating Scale (BARS)D. Critical Incidents evaluation",
      "definition": "D. Critical Incidents evaluation"
    },
    {
      "term": "How is compensation, as described in your text, defined?A. the wages individuals receive each pay periodB. wage schedules and wage rates listed in the union contractC. the total or' all rewards provided employees in return for their servicesD. the internal alignment of intrinsic rewards",
      "definition": "C. the total or' all rewards provided employees in return for their services"
    },
    {
      "term": "What are NOT included in short-term incentives?A. SalaryB. RewardsC. BonusesD. Commissions",
      "definition": "A. Salary"
    },
    {
      "term": "Which one of the following is NOT one of the ways for companies like Apple and Google to recruit creative people?A. Company cultureB. CompetenciesC. Job designD. Cost cutting",
      "definition": "D. Cost cutting"
    },
    {
      "term": "What is the type of interview which lists the questions ahead of time?A. behavioral interviewB. structured interviewC. unstructured interviewD. situational interview",
      "definition": "B. structured interview"
    },
    {
      "term": "The utilization of individuals to achieve organizational objectives isA. human resource management.B. human resource researchC. human resource planning.D. human resource leadership.",
      "definition": "A. human resource management."
    },
    {
      "term": "The process of ensuring that there are the right number of qualified people in the right jobs for best results is termedA. Human Resource PlanningB. RecruitmentC. RetrenchmentD. Downsizing",
      "definition": "A. Human Resource Planning"
    },
    {
      "term": "What is a top-level manager called who reports directly to the corporation's chief executive officer (CEO) or to the head of a major division?A. generalistB. executiveC. managerD. specialist",
      "definition": "B. executive"
    },
    {
      "term": "Which of the following is NOT correct about non-monetary rewards?A. Need to be customized for employees with different valuesB. Only valuable to employeesC. Only valuable to employersD. B and C",
      "definition": "D. B and C"
    },
    {
      "term": "True or False: Promote within whenever possible?A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "What is the term that is designed to provide learners with the knowledge and skills needed for their present job?A. trainingB. careerplanningC. succession planningD. development",
      "definition": "A. training"
    },
    {
      "term": "- According to the People Manager Value Proposition, which of the following questions is NOT a startegy?- According to the People Manager Value Proposition, which of the following questions is NOT answered by HR strategy?A. How to manage employees' performance?B. How to motivate and reward employees?C. Which market to penetrate for the new product?D. Who and how to attract and retain?",
      "definition": "C. Which market to penetrate for the new product?"
    },
    {
      "term": "The systematic process of matching the internal and external supply of people with job openings anticipated in the organization over a specified period of time is referred to asA. performance appraisal.B. recruitment.C- human resource planning.D. selection.",
      "definition": ""
    },
    {
      "term": "Employees who receive high performance evaluations fortheir prior year's accomplishments are awarded a fixed cash award. This is an'example of tying evaluations to what element of the pay mix?A. Short-tenn incentivesB. Long-term incentivesC- Non-monetaryD. Base pay",
      "definition": "A. Short-tenn incentives"
    },
    {
      "term": "True or False: Job observation is a good method for job analysis for jobs done mentallyA. TrueB. False",
      "definition": "B. False"
    },
    {
      "term": "Which of the following most likely combines aspects of behavioral and situational questioning?A. computerized interviewsB. panel interviewsC. mass interviewsD. case interviews",
      "definition": "D. case interviews"
    },
    {
      "term": "What are factors outside an organization's boundaries that affect a firrn's human resources make-up called?A. corporate environmentB. external environmentC. social environmentD. corporate culture",
      "definition": "B. external environment"
    },
    {
      "term": "During a job interview, Sara is asked to describe a time when she was responsible for motivating others. Which of the following most likely describes this type of interview?A. groupinterviewB. stress interviewC. behavioral interviewD. board interview",
      "definition": "C. behavioral interview"
    },
    {
      "term": "Which of the following HR approaches is most popular currentlyA. Scientific management approachB. Systems approachC. Human resources approachD. Technical approach",
      "definition": "C. Human resources approach"
    },
    {
      "term": "......... is the process by which the knowledge of an employee, his skills , abilities and motives to perform a job must match the requirements of the jobA. Placement B. Job analysis C. Selection D. Recruitment",
      "definition": "A. Placement C. Selection              B. Job analysis      A. Placement    C. Selection   ......... is the process by which the knowledge of an employee, his skills , abilities and motives to perform a job must match the requirements of the job             C. Selection       A. Placement       B. Job analysis         A. Placement C. Selection          C. Selection                                                         C. Selection  C. Selection  A. Placement                                           C. Selection         C. Selection       C. Selection        C. Selection                       C. Selection    C. Selection  A. Placement  C. Selection        C. Selection    ......... is the process by which the knowledge of an employee, his skills , abilities and motives to perform a job must match the requirements of the job     C. Selection           C. Selection   C. Selection        C. Selection                                C. Selection                C. Selection  C. Selection      C. Selection    C. Selection  A. Placement  C. Selection        C. Selection  B. Job analysis A. Placement       C. Selection  C. Selection               C. Selection                    C. Selection                C. Selection       C. Selection        C. Selection     C. Selection   A. Placement  C. Selection   C. Selection              A. Placement        A. Placement "
    },
    {
      "term": "What is \"Theory X\" about?A. People are not lazy. just because you cannot give them enough motivation.B. People love working as long as they find the passion in it.C. People love working. under some conditions.D. People are lazy. They dislike work and will avoid it if possible.",
      "definition": "D. People are lazy. They dislike work and will avoid it if possible."
    },
    {
      "term": "Which of the following is NOT one of the low predictors of job success?A. interestsB. IQC. years of educationD. GPA",
      "definition": "B. IQ"
    },
    {
      "term": "Which one is true about coercive power?A. It can create a harmony working climate.B. it is often favored by employees.C. It is the same as reward power.D. It is performed when managers punish their employees.",
      "definition": "D. It is performed when managers punish their employees."
    },
    {
      "term": "..........is the systematic process of analyzing and evaluating jobs to determine their relative worth in an organizationA. Job evaluationB. Job enrichmentC. Job designD. Job analysis",
      "definition": "A. Job evaluation"
    },
    {
      "term": "Craig is applying for a sales position at a commercial real estate firm. The HR manager gave Craig the Myers-Briggs test during the selection process. Which of the following is most'likely being measured by the firm?A. psychomotorskillsB- vocational interestC- personality traitsD. cognitive abilities",
      "definition": ""
    },
    {
      "term": "Employees who have joined together for the purpose of dealing with their employees are called a (an)A. organization.B. association.C. conspiracy.D. union.",
      "definition": "D. union."
    },
    {
      "term": "Ultimately, performance management links organizational strategy to organizationalA culture.B. resultsC. rewardsD. goalsetting.",
      "definition": "B. results"
    },
    {
      "term": "Agreeableness could be a good trait of leadership becauseA. People who are agreeable could adapt to change quicklyB. People who are agreeable might be trustworthyC. People who are agreeable could be very loyal and committed to their organizationsD. People who are agreeable might have high emotional intelligence, social intelligence or even cultural intelligence",
      "definition": "D. People who are agreeable might have high emotional intelligence, social intelligence or even cultural intelligence"
    },
    {
      "term": "Why do we need to do surveys about labor market?A. Understanding how labor market works helps employers understand when to adjust their pay.B. The labor market determines pay.C. Both of theseD. None of these",
      "definition": "C. Both of these"
    },
    {
      "term": "Which of the following refers to a procedure designed to predict future job performance based on an applicant's oral responses to oral inquiries?A. work sample simulationB. reference checkC. arbitrationD. selection interview",
      "definition": "D. selection interview"
    },
    {
      "term": "\"Tell me about a time when you were faced with a tremendous challenge at work but managed to overcome that challenge.\" is the ( ... ) type of interview questions.A. KnowledgeB. TheoreticalC. SituationalD. Behavioral",
      "definition": "D. Behavioral"
    },
    {
      "term": "Ben works at a small advertising agency as a graphic artist. Ben enjoys his job because the company allows employees to have flexible schedules and to telecommute when necessary. Which of the following best describes this type of employee compensation?A. indirect financial compensationB. nonfinancial compensationC. required compensationD. direct financial compensation",
      "definition": "B. nonfinancial compensation"
    },
    {
      "term": "How should evaluation criteria for a performance appraisal system be determined?A. job specificationB. strategic planningC. observationD. job analysis",
      "definition": "D. job analysis"
    },
    {
      "term": "Which of the following is a common characteristic of computerized interviews?A. puzzle questionsB. open-ended questionsC. multiplechoice questionsD. follow-upquestions",
      "definition": "C. multiplechoice questions"
    },
    {
      "term": "When we talk about \"laissez-faire leader\", it usually meansA. None of the answers are correctB. Democratic leaderC. Autocratic leaderD. Delegative leader",
      "definition": "D. Delegative leader"
    },
    {
      "term": "A control technique that helps in measuring the cost and value of people for an organization and helps management to value human resources isA. Value based accountingB. Human resource accountingC. Employee control systemsD. Organizational control systems",
      "definition": "B. Human resource accounting"
    },
    {
      "term": "What is included in the Pay Mix?A. Benefits and perksB. Base cashC. All of theseD. Long-term and short-term incentives",
      "definition": "C. All of these"
    },
    {
      "term": "What is the most important part of your first interactions with the new hire?A. Good communicationB. Filling out the proper paperworkC. Introducing the new hire to the teamD. Bonding a network for the new hire",
      "definition": "A. Good communication"
    },
    {
      "term": "Which informal train and devepolment method involves transferring knowledge from an experienced worker to a new employee?A. role playingB. business gamesC. on-the-job trainingD. classroom lecture",
      "definition": "C. on-the-job training"
    },
    {
      "term": "Which of the following is NOT one of the advantages of internal hiring?A. Training for specific needs is possible.B. It is less expensive.C. It is motivating.D. It is good for diversity.",
      "definition": "D. It is good for diversity."
    },
    {
      "term": "Which component of the job description refers to required factual information?A. AbilitiesB. SkillsC. KnowledgeD. None of the others",
      "definition": "C. Knowledge"
    },
    {
      "term": "Which HRM function consists of training and development, individual career planning and development activities, organization development, and performance management and appraisal?A. management by objectivesB. employee and labor relationsC. organizational developmentD. human resource development",
      "definition": "D. human resource development"
    },
    {
      "term": "Eric, an HR manager, is using a job evaluation method in which he assigns numerical values to specific job factors before calculating the sum of the values. Which method is Eric most likely using?A. pointB. rankingC. classificationD. factor comparison",
      "definition": "A. point"
    },
    {
      "term": "Which of these is defined as any practice or activity carried on by the organization with the primary purpose of identifying and attracting potential employees?A. Personnel policies.B. Recruitment.C. SelectionD. A leading indicator analysis",
      "definition": "B. Recruitment."
    },
    {
      "term": "Current trends in executive pay involve linking compensation with ( )A. multi-year contract packagesB. deferred stock optionsC. performance resultsD. seniority systems",
      "definition": "C. performance results"
    },
    {
      "term": "The process of attracting individuals on a timely basis, in sufficient numbers, and with appropriate qualifications, to apply for jobs with an organization is referred to as ..........A. HR planningB. selectionC. appraisalD. recruitment",
      "definition": "D. recruitment"
    },
    {
      "term": "Which term refers to a goal-oriented process directed toward ensuring that organizational processes are in place to maximize productivity of employees, teams, and the organization?A. performance appraisalB. development analysisC. strategic HR planningD. performance management",
      "definition": "D. performance management"
    },
    {
      "term": "Compensation, as described in your text, refers toA. total of all rewards provided employees in return for their services.B. the internal alignment of intrinsic awards.C. wage schedules and wage rates listed in the union contract.D. the wages individuals receive each pay period.",
      "definition": "A. total of all rewards provided employees in return for their services."
    },
    {
      "term": "The systematic process of determining the skills, duties and knowledge required for performing jobs in an organization is referred to as a job ( ) A. descriptionB. specificationC. qualificationD. analysis",
      "definition": "D. analysis"
    },
    {
      "term": "What is one stage of the new hire socialization process?A. Going out with co-workers-B. Understanding where you, as a new employee, fit in the organizational context.C- Completing all new hire paperwork-D- Doing well on thefirst performance review-",
      "definition": "B. Understanding where you, as a new employee, fit in the organizational context."
    },
    {
      "term": "Jennifer works in an advisory or staff capacity, working with other managers to help them deal with human resource matters. Jennifer is most likely employed as a(n) ...................A. account executiveB. line managerC. HR managerD. project manager",
      "definition": "C. HR manager"
    },
    {
      "term": "Which human resource management function consists not Only of training and development individual career planning and development activities, Organization development, and performent management and appraisal?A staffingB. employee and labor relationsC. training and developmentD. human resource development",
      "definition": "D. human resource development"
    },
    {
      "term": "What is the systematic process of determining the skills, duties, and knowledge required for performing jobs in an organization?A. human resource planningB. human resource analysisC. human resource researchD. job analysis",
      "definition": "D. job analysis"
    },
    {
      "term": "What type of interview would most likely include the statement, \"Tell me about a time when you worked successfully in a team environment\"?A. situationalB. behavioralC. puzzleD. stress",
      "definition": "B. behavioral"
    },
    {
      "term": "The extent to which employees are aware of their interests, skills, strengths and weaknesses regarding their career goals is termed.A. Career motivationB. Career resilienceC. Career insightD. Career identity",
      "definition": "C. Career insight"
    },
    {
      "term": "In job design,........... means em powering workers by adding more decision-making authority to the job.A. Job enlargementB. Job enrichmentC. Job specializationD. Job rotation",
      "definition": "B. Job enrichment"
    },
    {
      "term": "A company's....... is the number of times on average that employees have to be replaced during a year.A. retention percentageB- quantity of hireC- turnover rateD- cost per hire",
      "definition": ""
    },
    {
      "term": "What type of insurance is a benefit commonly provided to protect an employee's family in the event of the employee's death?A. Iong-temt careB. utilization careC. group life insuranceD. disability insurance",
      "definition": "C. group life insurance"
    },
    {
      "term": "..............test measures a person ability to classify things, identify relationships and derive analogies. It measures several factors like logical reasoning, analytical skills and general knowledgeA. Intelligence testB. Performance testsC. Emotional testsD. Social tests",
      "definition": "A. Intelligence test"
    },
    {
      "term": "Showing a worker how to operate a bulldozer or an administrative assistant how to schedule appointments are examples of ............A. trainingB. developmentC. morale improvementD- behavioral development",
      "definition": "A. training"
    },
    {
      "term": "What is NOT one of the purposes of performance evaluation?A. The boss can give feedbacks through performance evaluation-B- The boss can give recommendation through performance evaluation, so that the employee can do better in the future.C- Performance evaluation provides 'some criteria for who gets laid off or who gets terminated or who gets promoted or so on.D- Performance evaluation can be disclosed as public news around the organization.",
      "definition": ""
    },
    {
      "term": "Maria is chronically tardy to work. In response, Maria's manager has given Maria time off with pay to think about whether she wants to follow the rules and continue working for the company- Which disciplinary method is Maria's manager most likely using?A- progressive disciplinary actionB- hot stove approachC. disciplinary action without punishmentD. punitive disciplinary action",
      "definition": "C. disciplinary action without punishment"
    },
    {
      "term": "..........is the consistency between the test items or problems and the kinds of situations or problemsthat occur on the job-A Criterion-related validityB. Content validityC- Construct validityD- Test validity",
      "definition": "B. Content validity"
    },
    {
      "term": "As an HR manager, what tool would you most likely use to determine if internal equity exists at your firm?A- job analysisB. job evaluationC- compensation surveyD. behavioral methods study",
      "definition": "B. job evaluation"
    },
    {
      "term": "Human Resource Management aims to maximize employees as well as organizationalA EffectivenessB- EconomyC- EfficiencyD- Planning",
      "definition": ""
    },
    {
      "term": "Which of the following protects employees against an earnings loss when they are totally incapacitated?A unemployment insuranceB- disability insuranceC- paid time offD- sabbaticals",
      "definition": ""
    },
    {
      "term": "Managers conducting, performance evaluations tend to overweight instances that'occurred in the last week more than those that happened six months-ago. This is an example of what kind of bias?A. RecencyB- HaloC- AnchoringD- None of these",
      "definition": "A. Recency"
    },
    {
      "term": "HR department maintains a set of proposals and actions that act as reference points for managers in their dealings with employees- What is this called?A. HR GuideB. HR ethicsC. HR poIicyD. Managerial policy",
      "definition": "C. HR poIicy"
    },
    {
      "term": "True or false: There is one personal managerial style that is best in all situations?A TrueB. False",
      "definition": "B. False"
    },
    {
      "term": "Which of the following is NOT one of the elements of the external environment that a company has to consider in workforce planning?A- EconomyB- CompetitorsC- OperationsD- Legislation",
      "definition": ""
    },
    {
      "term": "The statement of the required set of knowledge, skills and competencies for a job is called theA. Job specificationB. Job descriptionC. Job classificationD. Job Analysis",
      "definition": "A. Job specification"
    },
    {
      "term": "Which of the following are parts of the legal considerations that affect human resource management?A. executive ordersB. court decisionsC. lawsD. all of the above",
      "definition": "D. all of the above"
    },
    {
      "term": "A job description for a truck driver may list \"basic truck maintenance skills\" under: | Job duties | KSAs | Job summary | Job context | Job title",
      "definition": "KSAs"
    },
    {
      "term": "Gaming Laboratories periodically assigns coaches to its employees. The firm most likely provides coaches to enhance ____A. long-term planningB. team building skillsC. task performanceD. career growth",
      "definition": "C. task performance"
    },
    {
      "term": "A benefit plan where an employee gets a chance to choose from a lot of benefits is also calledA. Holiday benefit planB. Restaurant benefit planC. Cafeteria benefit planD. Variable/Flexible benefit plan",
      "definition": "D. Variable/Flexible benefit plan"
    },
    {
      "term": "During the selection process for a telemarketing position, Alex was given a test to measure his awareness of the job's duties. Which type of test did Alex most likely take?A. psychomotor abilitiesB. cognitive aptitudeC. job knowledgeD. work-sample",
      "definition": "C. job knowledge"
    },
    {
      "term": "Human resource professionals can give the CEO and CFO a powerful understanding of the role __ plays in the organization and the way it combines with business processes to expand or shrink shareholder value.A. lawsB. executive ordersC. human capitalD. management",
      "definition": "C. human capital"
    },
    {
      "term": "____tests include assessments of general reasoning ability and of specific mental abilities like memory and inductive reasoning.A. Motor abilityB. PersonalityC. AchievementD. Cognitive",
      "definition": "D. Cognitive"
    },
    {
      "term": "What is included in the Total Rewards Model?A. Individual growthB. Total pay and positive workplaceC. Compelling futureD. All of these",
      "definition": "D. All of these"
    },
    {
      "term": "What is NOT true about demand side factors?A. They are those factors that drive the productivity, and the price of their labor.B. They could be factors such as how attractive the job is.C. They never change.D. A and B",
      "definition": "C. They never change."
    },
    {
      "term": "The process of selecting and developing employees in the organization to occupy key positions in the future is termedA. Career planningB. Succession planningC. Career developmentD. Human resource enhancement",
      "definition": "B. Succession planning"
    },
    {
      "term": "Which of the following is NOT TRUE in terms of diversity recruiting?A. It is necessary.B. ltis challenging.C. It is not a trend.D. It is all about women and racial",
      "definition": "D. It is all about women and racial"
    },
    {
      "term": "What human resource management task involves protecting employees from injuries caused by work-related accidents?A. accident preventionB. injury analysisC. workplace analysisD. safety",
      "definition": "D. safety"
    },
    {
      "term": "What human resource management task refers to the employees' freedom from physical or emotional illness?A. utilization reviewB. physical reviewC. healthD. workplace analysis",
      "definition": "C. health"
    },
    {
      "term": "A popular appraisal method that involves input from multiple levels within the firm and external sources is best known as___A. 360-degree feedback evaluationB. rating scaleC. critical incidentD. paired comparison",
      "definition": "A. 360-degree feedback evaluation"
    },
    {
      "term": "ln workforce planning, what is the step after the implementation step?A. EvaluationB. Data analysisC. Data collectionD. None of the others",
      "definition": "A. Evaluation"
    },
    {
      "term": "A democratic leader may oftenA. Ignore opinions of other peopleB. Let hisfher subordinates join the decision-making process and consider their opinions before making final decisionC. Make all the decisions without any considerationD. Let his/her subordinate make their own decisions",
      "definition": "B. Let hisfher subordinates join the decision-making process and consider their opinions before making final decision"
    },
    {
      "term": "Judgments made in the....... of an interview predicted the outcome of the interview?A. first 5 secondsB. first 10 secondsC. first 2 minutesD. first 5 minutes",
      "definition": "B. first 10 seconds"
    },
    {
      "term": "Sharon's employer offers a defined contribution plan. The firm contributes stock shares to a trust in hopes of aligning employee interests with the interest of the firm. Sharon is most likely invested in a(n) __A. employee stock option planB. defined contribution planC. defined benefit planD. cash balance plan",
      "definition": "A. employee stock option plan"
    },
    {
      "term": "A formal system of review and evaluation of an individual or team task performance is referred to as ...........A. performance appraisalB. strategic planningC. performance managementD. succession planning",
      "definition": "A. performance appraisal"
    },
    {
      "term": "Which one of the following is one of the elements of the internal environment that a company has to consider in workforce planning?A TurnoverB. GlobalizationC. TechnologyD. Customer demands",
      "definition": ""
    },
    {
      "term": "The process of structuring work and designating the specific activities at the individual or group level is called asA. Job designB. Job descriptionC. Job analysisD. Job specification",
      "definition": "A. Job design"
    },
    {
      "term": "Which term refers to validations from those who know the applicant that provide additional insight into the information furnished by the applicant?A background testsB. employer referralsC. polygraph testsD. reference checks",
      "definition": "D. reference checks"
    },
    {
      "term": "True or false: All organizations in the same competitive space have to have the same type of HR strategy?A. TrueB. False",
      "definition": "B. False"
    },
    {
      "term": "What is the process through which the organization chooses, from a group of applicants, those individuals best suited both for the open position and for the company called?A. human resource developmentB. selectionC. recruitmentD. human resource planning",
      "definition": "B. selection"
    },
    {
      "term": "Which term refers to the process through which an organization ensures that it always has the proper number of employees with the appropriate skills in the right jobs, at the right time, to achieve organizational objectives?A. staffingB. recruitmentC. selectionD. HR planning",
      "definition": "A. staffing    C. selection                C. selection                B. recruitment    C. selection    "
    },
    {
      "term": "Which term refers to the process of choosing from a group of qualified applicants the individual best suited for a particular position?A. recruitmentB. selectionC. HR planningD. job bidding",
      "definition": "B. selection"
    },
    {
      "term": "Which term refers to the total of all rewards provided to employees in return for their services?A. benefitsB. commissionsC. bonusesD. compensation",
      "definition": "D. compensation"
    },
    {
      "term": "John is a general manager of a manufacturing company. He often has to attend many meetings every day and build the relationship with customers and suppliers to make sure the supply chain of company is always smooth and fluent. Which role John is performing?A. LeadershipB. LiaisonC. FigureheadD. Monitor",
      "definition": "B. Liaison"
    },
    {
      "term": "The development function of human resources has three dimensions. Which of the following does NOT fall under themA. Employee trainingB. Management developmentC. Career developmentD. Identifying ways to motivate employees",
      "definition": "D. Identifying ways to motivate employees"
    },
    {
      "term": "Which of the following provides learners with the knowledge and skills needed for their present jobs?A. trainingB. developmentC. career planningD. succession planning",
      "definition": "A. training"
    },
    {
      "term": "When determining the best way to motivate employees, why shouldn't managers rely solely on HR staff for directions. (check all that apply)A. Managers know their employees best. B. People are unique so there are various drivers of motivation.C. Work can mean different things to different people, so there are various drivers of motivation.D. It's not a manager's job to motivate workers, they should be self-motivated.E. HR is just a pencil-pushing function.",
      "definition": "A. Managers know their employees best. B. People are unique so there are various drivers of motivation. C. Work can mean different things to different people, so there are various drivers of motivation."
    },
    {
      "term": "Onboarding is a part of employee ( )A. engagementB. empowermentC. task assignmentD. compensation",
      "definition": "A. engagement"
    },
    {
      "term": "The job identification section of the job description includes the ..........A required skills of the jobB. size of companyC. reporting relationshipD. primary duties and tasks",
      "definition": "C. reporting relationship"
    },
    {
      "term": "What is pay that a person receives in the form of wages, salaries, commissions and bonuses called?A. direct financialB. benefitsC. incentivesD. enticements",
      "definition": "A. direct financial"
    },
    {
      "term": "The process of hiring an external provider to do the work that was previously done internally is referred to as...........A. broadbandingB. job enlargingC. outsourcingD. onboarding",
      "definition": "C. outsourcing"
    },
    {
      "term": "What HRtool gives employees he opportunity capitalze on thei sengs and overcomedentifieddeficrencres?A. manager self-serviceB. employee orientationC- performance appraisalD- selection tests",
      "definition": ""
    },
    {
      "term": "As part of the selection process for a position at UPS, Jack has been asked to lift weights and jump rope. Which of the following is most likely being measured by UPS?A interpersonal skillsB- cognitive skillsC- physical abilitiesD- achievements",
      "definition": ""
    },
    {
      "term": "When criterion-related validity is used, the scores on the selection test are compared to .......A. scores on the pre—testB- job performance factorsC- scores on the post-testD- a national norm",
      "definition": ""
    },
    {
      "term": "An ongoing process whereby an individual sets career goals and identifies the means to achieve them is called..........A. succession planningB. career developmentC- career planningD. training",
      "definition": ""
    },
    {
      "term": "............is defined as a hierarchical set of jobs and their associated pay ranges.A. Salary structureB. Job titleC. Pay benchmarkD. Pay grade",
      "definition": "A. Salary structure"
    },
    {
      "term": "Max, a newspaper photographer, is allowed to choose his own working hours, With certan fimitations.Which of the following is most likely offered by Max's employer?A. telecommutingB. job sharingC. part-timeworkD. flextime",
      "definition": "D. flextime"
    },
    {
      "term": "How to become a political leader? (Choose INCORRECT answer)A Develop good relationships with people inB- Learn (un)written rules in the organization cultureC. Need to be perceived as loyal and honestD- Help other people fulfill their wishes.",
      "definition": ""
    },
    {
      "term": "All financial rewards that are NOT included in direct financial compensation are known as ..........A bonusesB- wagesC. commissionsD- benefits",
      "definition": ""
    },
    {
      "term": "What is the discipline dealing with what is good and bad, or right and wrong or with moral duty and obligation called?A social responsibilityB- legal responsibilityC- ethicsD. social contract",
      "definition": ""
    },
    {
      "term": "Job analysis information is used to prepare ........A job requisitions8. budget reportsC. job specificationsD- corporate assessments",
      "definition": "C. job specifications"
    },
    {
      "term": "A long-term use of ............can be hard on employees, leading to problems with burnout, quality, safety.A temporary laborB- overtimeC. outsourcingD- reassigning work",
      "definition": ""
    },
    {
      "term": "Mary is a leader of a project team. She is said to be a very creative person, who often provides many innovative and valuable ideas to the team. The role which she is performing is:A LiaisonB- DisseminatorC- EntrepreneurD. Resource allocator",
      "definition": ""
    },
    {
      "term": "Individuals who normally act in an advisory or staff capacity, working with other managers to help them deal with human resource matters, are referred to asA. executives.B. line managers.C. human resource managers.D. project managers",
      "definition": "C. human resource managers."
    },
    {
      "term": "What impacts the brand and reputation of a company?A Size and AgeB. Profitability-0. Location.D. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "Grafton Industries administers selection tests to job candidates. The tests measure a range of abilities including memory, vocabulary, verbal fluency, and numerical ability, so they are most likely........ tests.A. standardizedB- intelligenceC- achievementD. personality",
      "definition": ""
    },
    {
      "term": "The heart of a continuous effort designed to improve employee competency and organizationis referred to as____.A. succession planningB. organizational planningC. training and developmentD. communicating and integrating",
      "definition": "C. training and development"
    },
    {
      "term": "Which one of the following is NOT one of the three basic paths to competitive advantage?A. competitor analysisB. operational excellenceC. product leadershipD. customer intimacy",
      "definition": "A. competitor analysis"
    },
    {
      "term": "Which one of the following is NOT one of the characteristics of an effective recruiter?A. Diversity and sensitivity skillsB. Knowledge of the lawC. Attractive appearanceD. Preparation in advance",
      "definition": "C. Attractive appearance"
    },
    {
      "term": "Which one of the following is NOT one of the criteria of a Google interview?A. General cognitive abilityB. LeadershipС. GoogleynessD. GPA in university",
      "definition": "D. GPA in university"
    },
    {
      "term": "Which of the following is correct about non-monetary rewards?A. Very common and customizedB. Highly valued by employeesC. Valuable to employers in motivating and improving employees' performanceD. All of these",
      "definition": "D. All of these"
    },
    {
      "term": "What does it mean by \"know thyself\"?A. Understanding how you will act in various different situationsB. Understanding your subordinatesC. Understanding your colleaguesD. Understanding your teammates",
      "definition": "A. Understanding how you will act in various different situations"
    },
    {
      "term": "A manager can exert \"referent power\" on his/her employees whenA. he/she has good relationship with them.B. he/she has resources to reward them.C. he/she has special knowledge which their employees do not have.D. he/she has special information which is necessary to employees' work.",
      "definition": "A. he/she has good relationship with them."
    },
    {
      "term": "True or false: Setting compensation incentives involves finding the right balance between risk and insurance?A. TrueВ. False",
      "definition": "A. True"
    },
    {
      "term": "Candidates who are content in their current position and have unique skill sets that a recruitement to their organization are called........... candidatesA. passiveB. reluctantC. potentialD. inactive",
      "definition": "A. passive"
    },
    {
      "term": "What is the most common cause for the failure of performance appraisal systems?A. unclear goals and expectationsB. irrelevant development plansC. time consuming for managersD. high implementation costs",
      "definition": "A. unclear goals and expectations"
    },
    {
      "term": "Why is it important to ensure that HR plans are flexible?A. To accommodate changes to senior management teamsB. To adapt to changing skills and qualificationsC. To accommodate the rapidly changing environment in which most organizations operateD. To ensure a diverse labor force is maintained at all times",
      "definition": "C. To accommodate the rapidly changing environment in which most organizations operate"
    },
    {
      "term": "What refers to management's perception of the degree to which the prospective employee firm's culture or value system?A. occupational fitB. personality fitC. co-worker fitD. organizational fit",
      "definition": "D. organizational fit"
    },
    {
      "term": "The process of searching for prospective employees and stimulating them to apply for jobs is termed asA. PromotionB. RecruitmentC. SelectionD. Placement",
      "definition": "B. Recruitment"
    },
    {
      "term": "Compensation, includes what rewards received as a result of employment?A. direct financialB. nonfinancialC. indirect financialD. all of the above",
      "definition": "D. all of the above"
    },
    {
      "term": "An HR strategy that emphasizes employee engagement and discretion can be summed up by which phrase?A.\"If you don't like it, quit.\"B.\"If you don't like it, let's talk about it.\"",
      "definition": "B.\"If you don't like it, let's talk about it.\""
    },
    {
      "term": "What are individuals called who normally act in an advisory or staff capacity when working managers regarding human resource matters?A. line managersB. operant employersC. senior managersD. human resource managers",
      "definition": "D. human resource managers"
    },
    {
      "term": "What is the start of benchmarking pay?A. Deciding on the final pay planB. Producing a job descriptionC. Matching benchmarksD. Making adjustments",
      "definition": "B. Producing a job description"
    },
    {
      "term": "What involves invoking a penalty against an employee who fails to meet established standards ?A. metricsB. probationC. disciplinary actionD. internal employee relations",
      "definition": "C. disciplinary action"
    },
    {
      "term": "During an interview, Tanya discusses her numerous accomplishments at previous jobs and praises the interviewer frequently. Tanya is most likely using __________.A) impression managementB) talent managementC) mixed motivesD) behaviour modification",
      "definition": "A) impression management"
    },
    {
      "term": "What selection method continues to be the primary method companies use to evaluate applicationA. background checksB. cognitive ability testsC. employment interviewsD. assessment centers",
      "definition": "C. employment interviews"
    },
    {
      "term": "A goal-directed summary of a person's experience, education, and training developed for use in the selection process is known as a(n):A) resume.B) application form.C) job requisition.D) work sample test.",
      "definition": "A) resume"
    },
    {
      "term": "Which of the following is not one of type of power of leaders?A. ExpertВ. InformationC. AppearanceD. Coercive",
      "definition": "C. Appearance"
    },
    {
      "term": "QN=35 Learning at work is:a. Great, but my manager should see me doing itb. Great, as it is a way to learn more about my job and other jobsc. Fine, as long as it doesn't lead to extra workd. Fine, as long as it does not take too long",
      "definition": "b. Great, as it is a way to learn more about my job and other jobs"
    },
    {
      "term": "Which of the following are elements of Taylorism, also known as scientific management? (you must correctly check all that apply).NOTE: this is an example of a question that has more than one correct response--you must check ALL of the correct responses in order to get the question correct. | Managers should drive workers through strict monitoring, discipline, and even threats. | To motivate workers, getting the human conditions of work are just as important as getting the technical conditions right. | Managers, not workers, are seen as having the knowledge and expertise to find the one best way to do each job. | Jobs should be broken into small, standardized, repetitive tasks.",
      "definition": "Managers, not workers, are seen as having the knowledge and expertise to find the one best way to do each job. | Jobs should be broken into small, standardized, repetitive tasks."
    },
    {
      "term": "Which of the following are typically features of a high-road HR strategy? (you must correctly check all that apply).NOTE: this is an example of a question that has more than one correct response--you must check ALL of the correct responses in order to get the question correct. | Employee autonomy and discretion | Unquestioned supervisor authority | Employee training | Labor or trade unions | Above-average pay and benefits | Low levels of profitability",
      "definition": "Employee autonomy and discretion | Employee training | Above-average pay and benefits"
    },
    {
      "term": "True or false: There is one personal managerial style that is best in all situations. | False | True",
      "definition": "False"
    },
    {
      "term": "True or false: All organizations in the same competitive space have to have the same type of HR strategy. | False | True",
      "definition": "False"
    },
    {
      "term": "Which of the following is not an example of labor being a derived demand? | Offering flexible work schedules because this is what workers with family responsibilities want. | Offering flexible work schedules because customers with family responsibilities want extended hours of operation. | Offering flexible work schedules because customers do not expect immediate responses to their inquiries.",
      "definition": "Offering flexible work schedules because this is what workers with family responsibilities want."
    },
    {
      "term": "Which of the following are required for HR to be strategic? (check all that apply) | HR needs to be an expert in every business function. | HR is focused on organizational needs, not just on the administration of HR policies. | HR tasks are a line manager's responsibility, with help from an HR partner. | HR tasks are primarily the responsibility of an HR staff person, perhaps with input from line managers.",
      "definition": "HR is focused on organizational needs, not just on the administration of HR policies. | HR tasks are a line manager's responsibility, with help from an HR partner."
    },
    {
      "term": "True or false: No matter how one thinks the employment relationship works, high-road HR strategies are always seen as desirable. | False. | True",
      "definition": "False."
    },
    {
      "term": "Though there are exceptions because organizations can choose their HR strategy, a low-road HR strategy typically tries to support a business strategy based on competing on _____? |",
      "definition": "cost"
    },
    {
      "term": "In the video lesson \"The Many Meanings of Work,\" how many different ways of thinking about work were presented? | One | Two | Five | More than five",
      "definition": "More than five"
    },
    {
      "term": "True or false: Work is what it is. Some jobs are lousy, but we can't do anything to change that. | False | True.",
      "definition": "False"
    },
    {
      "term": "Mainstream economic theorizing sees work as a lousy activity that workers tolerate in order to earn income. One way that work is seen as lousy is as a pain cost (e.g., hot, dangerous, boring, stressful). A second way is as an _________ cost. |",
      "definition": "opportunity"
    },
    {
      "term": "One of the key concerns that emerges from economic analysis of workers is a concern with opportunism. Which is the best definition of opportunism? | The cost that comes from missing an opportunity to do something. | Not giving full work effort in one's job. | Pursuing one's own self-interests even when they run counter to others' interests.",
      "definition": "Pursuing one's own self-interests even when they run counter to others' interests."
    },
    {
      "term": "If workers behave in ways consistent with standard economic models, solution(s) to principal-agent problems include... (check all that apply) | Autonomy | Peer pressure | Monitoring | Financial incentives",
      "definition": "Monitoring | Financial incentives"
    },
    {
      "term": "True or false: Setting compensation incentives involves finding the right balance between risk and insurance. | False | True",
      "definition": "True"
    },
    {
      "term": "True or false: To overcome problems of private information, organizations can only use screening strategies, not signaling strategies. | True | False",
      "definition": "False"
    },
    {
      "term": "The amount of work an individual wants to sell to an employer is called labor _____. |",
      "definition": "supply"
    },
    {
      "term": "Labor is a special commodity because... (check all that apply) | It has productive value. | It is traded in economic markets. | It involves people.",
      "definition": "It has productive value. | It involves people."
    },
    {
      "term": "True or false: For individuals who believe that labor markets are perfectly or ideally competitive, the best protection against worker exploitation is competition for workers among employers, not a labor union or a government law. | False | True",
      "definition": "True"
    },
    {
      "term": "True or false: Efficiency, equity, and voice can be useful for managers to think about because it's one way of summarizing workers' interests. | True. | False",
      "definition": "True."
    },
    {
      "term": "Which of the following is needed for an economic contest or tournament to be an effective incentive mechanism that motivates high work effort? | Insurance against excessive income loss. | A known prize that is large enough to compensate for extra effort. | A clear pay-for-performance program that rewards each worker's effort.",
      "definition": "A known prize that is large enough to compensate for extra effort."
    },
    {
      "term": "True or false: Even for individuals who are well-off and claim they are not working for money, money can be important as a sign of self-worth and the value or respect given to them by the organization. | False | True",
      "definition": "True"
    },
    {
      "term": "An economic or monetary focus on work highlights the importance of extrinsic motivation. A psychological, non-monetary focus highlights the importance of _______ motivation. |",
      "definition": "intrinsic"
    },
    {
      "term": "What job characteristics tend to promote positive job attitudes among employees? (check all that apply) | Autonomy | Financial incentives | Skill variety | Task significance | Task identity",
      "definition": "Autonomy | Skill variety | Task significance | Task identity"
    },
    {
      "term": "True or false: When workers use their work to shape their identity, they do so solely by labeling themselves with various identifiers (e.g., \"I am a ____ working for _____.\"). | True | False",
      "definition": "False"
    },
    {
      "term": "Sociology usefully draws our attention to the influence of ______ institutions in the workplace, such as norms and culture. |",
      "definition": "social"
    },
    {
      "term": "Employees are believed to conform with norms and other social pressures in order to... (check all that apply) | ...avoid being harassed and ostracized. | ...earn high income. | ...achieve a sense of belonging.",
      "definition": "...avoid being harassed and ostracized. | ...achieve a sense of belonging."
    },
    {
      "term": "True or false: Treating work as a commodity results in society placing value on work that is seen as a precious commodity, which then devalues women's caring activities that are traditionally done in the household for no pay. | True | False",
      "definition": "True"
    },
    {
      "term": "True or false: Thinking about work as serving others is irrelevant for managers. | True | False",
      "definition": "False"
    },
    {
      "term": "The component of justice that focuses on the fairness of outcomes is called _______ justice. |",
      "definition": "distributive"
    },
    {
      "term": "The component of justice that focuses on the fairness of policies and rules is called _______ justice. |",
      "definition": "procedural"
    },
    {
      "term": "When managing a work group, before applying insights from economics, psychology, sociology, or other academic disciplines, managers should first make sure that... | ...the assumptions of that perspective fit with my own values. | ...the assumptions of that perspective fit with the values of the work group. | ...there isn't more practical advice available because blogs, business magazines, and other non-academic sources don't rely on any assumptions.",
      "definition": "...the assumptions of that perspective fit with the values of the work group."
    },
    {
      "term": "The vast complexity of work means that... | ...each employee you manage might have a different motivational factor, but each person will only have one. | ...each employee you manage might have a different combinations of multiple motivational factors.",
      "definition": "...each employee you manage might have a different combinations of multiple motivational factors."
    },
    {
      "term": "The component of justice that focuses on the fairness of outcomes is called _______ justice. |",
      "definition": "distributive"
    },
    {
      "term": "The component of justice that focuses on the fairness of policies and rules is called _______ justice. |",
      "definition": "procedural"
    },
    {
      "term": "When managing a work group, before applying insights from economics, psychology, sociology, or other academic disciplines, managers should first make sure that... | ...the assumptions of that perspective fit with my own values. | ...the assumptions of that perspective fit with the values of the work group. | ...there isn't more practical advice available because blogs, business magazines, and other non-academic sources don't rely on any assumptions.",
      "definition": "...the assumptions of that perspective fit with the values of the work group."
    },
    {
      "term": "The vast complexity of work means that... | ...each employee you manage might have a different motivational factor, but each person will only have one. | ...each employee you manage might have a different combinations of multiple motivational factors.",
      "definition": "...each employee you manage might have a different combinations of multiple motivational factors."
    },
    {
      "term": "To help feel good about ourselves, we identify with certain groups and in doing so, we emphasize the positive nature of their own group (\"in-group\") compared to others (\"out-groups\"). Which of the following does not result from this. | Free-rider problems in groups such that some group members do not fully contribute. | Inter-group conflict. | Discrimination against out-group members by in-group members. | Differences between those groups we identify with and those we do not are magnified.",
      "definition": "Free-rider problems in groups such that some group members do not fully contribute."
    },
    {
      "term": "Norms or peer pressure can come from many sources, including... (you must check all that apply) | ...the worker as an individual. | ...work group. | ...organization. | ...country.",
      "definition": "...work group. | ...organization. | ...country."
    },
    {
      "term": "Managers should... (check all that apply) | Set appropriate performance objectives and help them achieve these objectives. | Take all the credit. | Micro-manage their team and assume they know best. | Determine the knowledge, skills, and abilities (KSA) required of their team.",
      "definition": "Set appropriate performance objectives and help them achieve these objectives. | Determine the knowledge, skills, and abilities (KSA) required of their team."
    },
    {
      "term": "True or false: A manager should use employee engagement scores for his/her work group over time and in comparison with other work groups to watch for warning signs of problems in the work group. | False | True",
      "definition": "True"
    },
    {
      "term": "When managing in a unionized environment, managers need to remember two words. Bilateral and _______. | ",
      "definition": "proactive"
    },
    {
      "term": "True or false: When you are dealing with someone else, it's their problem, not yours, if they have an audience that is watching. | True | False",
      "definition": "False"
    },
    {
      "term": "Does the law see the employment relationship like any other economic transaction? | Yes | No | Sort of",
      "definition": "Sort of"
    },
    {
      "term": "Employment-at-will requires... (check all that apply) | That workers have the legal right to work for whoever they want, when they want, for whatever compensation they can obtain, and quit whenever they please. | That organizations have the legal right to hire whoever they want, at whatever compensation workers will agree to, and fire workers at any time for any reason. | That everyone who is willing to work is guaranteed a job.",
      "definition": "That workers have the legal right to work for whoever they want, when they want, for whatever compensation they can obtain, and quit whenever they please. | That organizations have the legal right to hire whoever they want, at whatever compensation workers will agree to, and fire workers at any time for any reason."
    },
    {
      "term": "True or false: True employment-at-will rarely exists. | True | False",
      "definition": "True"
    },
    {
      "term": "Unjust dismissal laws typically restrict the discipline and discharge of employees unless this is related to... (check all that apply) | ...a desire to lower labor costs. | ...faulty information. | ...a lack of work. | ...job performance.",
      "definition": "...a lack of work. | ...job performance."
    },
    {
      "term": "Employment law pertains to the rights of workers as ________. | ",
      "definition": "individuals"
    },
    {
      "term": "Labor law pertains to the rights of workers as ________. | ",
      "definition": "groups"
    },
    {
      "term": "True or false: In the United States, labor law only applies to workplaces where there are labor unions or formal labor union activity such as an organizing drive. | True | False",
      "definition": "False"
    },
    {
      "term": "What is the most important or useful thing you've learned in this course? | ",
      "definition": "0"
    },
    {
      "term": "Is there anything that was covered in this course that you are still confused about? (if nothing, just enter \"0\") | ",
      "definition": "0"
    },
    {
      "term": "Is there anything that you would have liked to have learned more about in this course? (if nothing, just enter \"0\") | ",
      "definition": "0"
    },
    {
      "term": "True or false: Employment-at-will is useful as a functional benchmark for managers to think about what they can and cannot legally do as a manager. | True | False",
      "definition": "True"
    },
    {
      "term": "Comparing Delta and American Airlines represents which external force? | Competitors | Threat of Substitution | Globalization | Geography",
      "definition": "Competitors"
    },
    {
      "term": "Which of the following is not an example of an internal force? | Labor market | Turnover | Current labor profile | Employee development",
      "definition": "Labor market"
    },
    {
      "term": "Which is not one of the paths of competitive advantage that were talked about? | Customer Intimacy | Operational Excellence | Product Leadership | Brand Recognition",
      "definition": "Brand Recognition"
    },
    {
      "term": "Walmart has which competitive advantage? | None of the above | Product Leadership | Customer Intimacy | Operational Excellence",
      "definition": "Operational Excellence"
    },
    {
      "term": "What is the first step in workforce planning? | Data Analysis | Strategy | Evaluation | Data Collection",
      "definition": "Strategy"
    },
    {
      "term": "Which is not an advantage of an internal approach? | Less Expensive | New Ideas | Motivating | Train for specific needs",
      "definition": "New Ideas"
    },
    {
      "term": "Which of the following are solutions to labor shortages? | Temporary labor | Outsource | Reassign Work | Replace with Technology | All of the Above",
      "definition": "All of the Above"
    },
    {
      "term": "What factors should you consider when deciding how to handle labor shortage? | How many workers? | What job did they work? | The reason people left | How many workers? -and- What job did they work?",
      "definition": "How many workers? -and- What job did they work?"
    },
    {
      "term": "What are examples of trends in the workforce? | National Competition | Lack of Workforce Diversity | Workforce Skills Gap",
      "definition": "Workforce Skills Gap"
    },
    {
      "term": "Select all of the examples of a core competency | Relationship Management | Leadership and Navigation | Ethical Practice | Communication",
      "definition": "Relationship Management | Leadership and Navigation | Ethical Practice | Communication"
    },
    {
      "term": "Which of the following is not a method of job analysis? | Job Observation | Critical Incident Analysis | Job performance | Training",
      "definition": "Training"
    },
    {
      "term": "What is knowledge? | Required factual information | Personality traits or legal requirements | External capability of performing a task | Internal capacity to perform a task",
      "definition": "Required factual information"
    },
    {
      "term": "Select the components you need to perform a job | Motivation | Efficiency | Mental Capacity",
      "definition": "Motivation | Efficiency | Mental Capacity"
    },
    {
      "term": "What is a pro of job observation? | Actual exposure to the job | Good for jobs done mentally | Requires some training time",
      "definition": "Actual exposure to the job"
    },
    {
      "term": "Which of the following would increase recruiter effectiveness? | Diversity and Sensitivity Skills | Timely Feedback | Working Alone | Great Communication Skills",
      "definition": "Diversity and Sensitivity Skills | Timely Feedback | Great Communication Skills"
    },
    {
      "term": "What impacts the persuasiveness of a recruitment message? | Media Richness | Personal Focus | Providing in depth information | Both A and B",
      "definition": "Both A and B"
    },
    {
      "term": "True or False: Knowledge of the law is only necessary in an employee relations role or HR generalist role | True | False",
      "definition": "False"
    },
    {
      "term": "What percentage of job seekers use their mobile device to search for a job once a week or more? | 88% | 56% | 68%",
      "definition": "68%"
    },
    {
      "term": "Based off the lecture, what are the best ways to attract passive candidates? Select all that apply. | Employment Branding | Job Postings | Social Media Presence | Cold Calling",
      "definition": "Employment Branding | Social Media Presence | Job Postings"
    },
    {
      "term": "Besides referrals, what is the next best way to find passive candidates? | Former Employees | LinkedIn | Professional Networks | Candidate Relationship management tools",
      "definition": "LinkedIn"
    },
    {
      "term": "True or False: Having a positive candidate experience can be a strategy to attract passive candidates | True | False",
      "definition": "True"
    },
    {
      "term": "Which of the following competencies were talked about in the lecture that recruiters should analyze when selecting candidates? | Job- Based | All of the above | Firm- Based | Team-Based",
      "definition": "All of the above"
    },
    {
      "term": "At which step is the background check part of the recruiting process? | First | Second | Last | A background check is not part of the screening process.",
      "definition": "Last"
    },
    {
      "term": "Which of the below options is NOT a type of interview? | In Person | Technology | Phone screen | Automatic | Structured | Panel",
      "definition": "Automatic"
    },
    {
      "term": "Personality Inventory and Cognitive Ability Test can be used in the selection process. | True | False",
      "definition": "True"
    },
    {
      "term": "Certain characteristics of a recruiter don't have an influence on the attitudes and behaviors of the applicants. | True | False",
      "definition": "False"
    },
    {
      "term": "True or False: 46% of reference and credential verification revealed a discrepancy | True | False",
      "definition": "True"
    },
    {
      "term": "Failure to obtain information that could have been easily been accessed during the hiring process could result in | Disparate treatment | The employee suing the company | Negligent hiring",
      "definition": "Negligent hiring"
    },
    {
      "term": "What is the definition of disparate treatment? | An intentional act that discriminates against an individual based on protected class | Neutral policies and practices that adversely affect protected classes (that could not be justified by business necessity). | Accidentally making minorities feel excluded",
      "definition": "An intentional act that discriminates against an individual based on protected class"
    },
    {
      "term": "Select all that are protected by the EEOC | Race | Sex | Pregnancy | Age",
      "definition": "Race | Sex | Pregnancy | Age"
    },
    {
      "term": "A test cannot be valid if it is not reliable | True | False",
      "definition": "True"
    },
    {
      "term": "\"Tell me about a time when you made a mistake\" is what type of interview question? | Situational | Behavioral | Knowledge",
      "definition": "Behavioral"
    },
    {
      "term": "True or False: Structured interviews can be valid predictors of job performance | True | False",
      "definition": "True"
    },
    {
      "term": "What is the #1 ability needed for interviewing? | To be able to listen | To be a people person | To be welcoming | To be organized",
      "definition": "To be able to listen"
    },
    {
      "term": "What is the number one step to a good hire? | Job analysis, Identify KSAO, and job description | Just job analysis | Determining the selection method | None of the above",
      "definition": "Job analysis, Identify KSAO, and job description"
    },
    {
      "term": "True or False: Validity is only situation-specific | True | False",
      "definition": "False"
    },
    {
      "term": "What are the pros of metrics? | Provide a snapshot in time | Insightful | Good for dashboards and KPIs",
      "definition": "Provide a snapshot in time | Good for dashboards and KPIs"
    },
    {
      "term": "You should discuss candidates between interviews to make sure everyone is on the same page. | True | False",
      "definition": "False"
    },
    {
      "term": "What does the offer package consist of? Check all that apply | Offer Letter | Employee Agreement | Job Description | Training Manual",
      "definition": "Offer Letter | Employee Agreement | Job Description"
    },
    {
      "term": "Employers will require applicants to pass each station before moving on if they are using this type of selection: | Multiple Hurdle Model | Compensatory Model | Standard Interview",
      "definition": "Multiple Hurdle Model"
    },
    {
      "term": "True or False: Metrics are the measurements of efficiency, performance, progress or quality. | True | False",
      "definition": "True"
    },
    {
      "term": "\"What would you do if an employee lied to you\" is an example of what kind of interview question? | Situational | Other | Knowledge | Behavioral",
      "definition": "Situational"
    },
    {
      "term": "What is employee engagement? | How happy employees are at their jobs. | How long an employee has worked at his or her job? | How hard employees work for an organization and how long they intend to stay. | How much an employee likes the manager and co-workers.",
      "definition": "How hard employees work for an organization and how long they intend to stay."
    },
    {
      "term": "Being clear about the culture of your organization is an important part of socializing a new hire, true or false? | True | False",
      "definition": "True"
    },
    {
      "term": "There is a good return on investment for having higher employee engagement in your organization, true or false? | True | False",
      "definition": "True"
    },
    {
      "term": "Which one of these is NOT a cost when replacing an employee? | Separation costs | Vacancy costs | Replacement costs | Training costs | Performance costs",
      "definition": "Performance costs"
    },
    {
      "term": "We know a good onboarding program should be about a year, more or less depending on the position. But when should a manager make sure to check in with the new hire? (Check the one that isn't correct.) | First Day | Day Five | One Month | Ninety Days | Six Months | One Year | Two Years",
      "definition": "Two Years"
    },
    {
      "term": "When beginning the process of creating your onboarding program, with whom should you start the discussion? | Human Resources | Your manager | The new hire | Your team",
      "definition": "Human Resources"
    },
    {
      "term": "When should onboarding begin? | On the new hire's first day. | At the time of the offer for the position. | During the new hire's first week. | Timing isn't that important, just get it on the new hire's schedule soon.",
      "definition": "At the time of the offer for the position."
    },
    {
      "term": "We want onboarding to be individualized. So it's best to make sure that the new employee is signed up ahead of time for all the appropriate groups to which the new hire belongs (like the women's leadership group, or the LGBT employee group, etc.). True or false? | True | False",
      "definition": "False"
    },
    {
      "term": "It can be difficult to create an individualized onboarding process. But what is the most important thing to think of as you create your onboarding program? | Make sure you get the new hire paperwork done. | Introduce the new hire to the organization's leader. | Be intentional about designing the human relationship. | Make the process super fun.",
      "definition": "Be intentional about designing the human relationship."
    },
    {
      "term": "What is the first step in getting ready for your new hire's first day? | Prepare yourself. | Talk with the new hire. | Get your team ready. | Set up a welcoming environment. | Talk with HR about paperwork.",
      "definition": "Prepare yourself."
    },
    {
      "term": "Is it important to pre-schedule time with your new hire during the first week of employment? | Yes, put it on both your calendars. | If possible, but if emergencies come up try for some time in the first month. | No, just make sure you have a meeting with the new hire in the first month.",
      "definition": "Yes, put it on both your calendars."
    },
    {
      "term": "It is important that the new hire not make mistakes as that will reflect poorly on his or her first performance review, true or false? | True | False",
      "definition": "False"
    },
    {
      "term": "You want your team to be involved with the new hire onboarding process. But if there are concerns your team has with the new hire, they should do the following: | Keep it to themselves, this is a new employee and things are bound to get better. | Talk with the other team members about the concern to see if the concern is shared. | Bring the concern to you so you can help resolve it. | Talk directly with the new hire and explain how things are done on the team.",
      "definition": "Bring the concern to you so you can help resolve it."
    },
    {
      "term": "What is the best way to be sure that you are ready for the new hire's first day? | Ask others to help. | Create and use an onboarding checklist. | Talk with human resources. | Ask the new hire what they need.",
      "definition": "Create and use an onboarding checklist."
    },
    {
      "term": "Job satisfaction and employee engagement are the same thing. | True | False",
      "definition": "False"
    },
    {
      "term": "A strong driver for both job satisfaction and employee engagement is: | Pay and benefits | The team of people you work with | Where the job is located | The employee relationship with the direct supervisor",
      "definition": "The employee relationship with the direct supervisor"
    },
    {
      "term": "Individual development plans must be designed for each individual, even when all your team members are working on the same projects and outcomes, true or false? | True | False",
      "definition": "True"
    },
    {
      "term": "A sample Individual Development Plan (IDP) was discussed in this lesson. What was NOT one of the four parts of that sample IDP? | Goals | Strategies | Action Steps | Planning | Resources/Support",
      "definition": "Planning"
    },
    {
      "term": "Which of the following are reasons why you should talk with your new hire about your organization's performance review system during the early days of onboarding? | Such a discussion will help the new hire know what is expected in the position. | Such a discussion will create a communication channel for you and the new hire. | Such a discussion helps both you and the new hire to think about what documentation you will want to collect for the review. | Such a discussion creates a sense of longevity with the organization for the new hire as they begin to think of the future early on in their career. | All of the above.",
      "definition": "All of the above."
    },
    {
      "term": "The toolset for performance management includes all of the following EXCEPT: | Setting clear expectations with the employee | Definition of managing people | Building development plans | Providing positive and corrective feedback",
      "definition": "Definition of managing people"
    },
    {
      "term": "\"Good performance management is the single largest contributor to organizational effectiveness.\" True or False. | True | False",
      "definition": "True"
    },
    {
      "term": "Which of the following statistics is NOT accurate from the survey on performance management effectiveness? | 85% of employees focus on the \"right\" things defined by organization goals. See video 1.1.3 | 43% reported performance management process increased employee performance. | 51% said planning process needed work.",
      "definition": "85% of employees focus on the \"right\" things defined by organization goals."
    },
    {
      "term": "True or False: While there are many sources of culture difference in performance management, they are many key principles that are culture \"neutral.\" | True | False",
      "definition": "True"
    },
    {
      "term": "Which of the following was NOT listed in the lecture as an example of culture types? | Group | Collectivist | Individualistic",
      "definition": "Group"
    },
    {
      "term": "Which of the following is TRUE about performance reviews? | Reviews are strategic. | Reviews focus on individual development and ratings. | Reviews are a dynamic process.",
      "definition": "Reviews focus on individual development and ratings."
    },
    {
      "term": "Which of the purposes listed for effective performance management systems would most likely be of use when terminations occur? | Legal | Strategic | Administrative | Rewards",
      "definition": "Legal"
    },
    {
      "term": "Which of the following was listed as a design element for performance management systems? | Top Management buy in. | Frontline buy in. | Non comprehensive - used for non senior management positions",
      "definition": "Top Management buy in."
    },
    {
      "term": "Workforce planning and and succession planning data is the only useful data form performance management systems. True or False? | True | False",
      "definition": "False"
    },
    {
      "term": "Which of the following was not listed as an a external group impacted by an organizations performance management system? | Families. | Customers. | Suppliers. | Stockholders.",
      "definition": "Suppliers."
    },
    {
      "term": "Which of the following is NOT part of strategic performance management? | Performance planning. | Multi-rater assessment. | The performance review. | Annual feedback sessions.",
      "definition": "The performance review."
    },
    {
      "term": "Which of the the following IS NOT a role of HR in the performance management planning process? | Ongoing feedback. | Conduct performance management training for managers. | Review job descriptions. | Developing performance standards.",
      "definition": "Ongoing feedback."
    },
    {
      "term": "As a manager you want to avoid the \"perils\" of of ineffective performance management. Which of the following is NOT a peril associated with specifically with managers? | Less motivated employees. | Lower stock price. | More turnover in the department. | Unfair / inconsistent performance ratings.",
      "definition": "Lower stock price."
    },
    {
      "term": "Performance management training may address performance improvement plans and individual development plans. The difference between the two is that improvement plans deal with a current performance deficiency, while the individual development deals with growth. True or False? | True | False",
      "definition": "True"
    },
    {
      "term": "In the Case Study in the video regarding the strategy change in financial institution, the role of HR in implementing the new strategy was discussed. Which of the following actions was the role of the senior management team and NOT HR? | Conducted organizational SWOT analysis. | Revised training to incorporate new strategy. | Revised job descriptions to incorporate new skills and job requirements associated with new strategy. | Revised recruiting to incorporate new strategy.",
      "definition": "Conducted organizational SWOT analysis."
    },
    {
      "term": "Which of the following is NOT part of a performance management mindset ? | Performance management should be viewed as bottom line issue. | Performance management is about development of employees. | Performance management should be viewed as an event.",
      "definition": "Performance management should be viewed as an event."
    },
    {
      "term": "Performance reviews can only be formal reviews and should never be informal. True or false? | True | False",
      "definition": "False"
    },
    {
      "term": "Which of the following should be a part of a general performance discussion? | Add new data to surprise the employee. | Set clear expectations for the employee and the position. | Discuss both past and future behavior. | Contain a recap of prior discussions.",
      "definition": "Set clear expectations for the employee and the position. | Discuss both past and future behavior. | Contain a recap of prior discussions."
    },
    {
      "term": "Organizations depend on performance review data for many reasons. Which of the follow is an example of an organizational use of performance review data? | individual compensation increases. | individual training plans. | individual development and growth plans. | leadership development and succession planning.",
      "definition": "leadership development and succession planning."
    },
    {
      "term": "When doing a employee performance review, which of the following is important to make sure it part of the review? | Focus mostly on past behavior so the employee realizes what a great job they have done. | Inflate the rating or be vague so the employee will not be demotivated. | Delegate to the employee the task of determining how he/she will improve performance. | Have a fair amount of focus on the future, as part of the discussion.",
      "definition": "Have a fair amount of focus on the future, as part of the discussion."
    },
    {
      "term": "Performance reviews should only be about rewarding employees. True or False | True | False",
      "definition": "False"
    },
    {
      "term": "When you need to have a difficult feedback discussion, which of the following should be TRUE of that discussion? | Be sympathetic to the employee's issues. | Enhance self-esteem. | Include alternative behavioral options for the employee to improve upon.",
      "definition": "Include alternative behavioral options for the employee to improve upon."
    },
    {
      "term": "\"Feedback is like a shot\" was talked about in the video. Why? | We get shots once a year. | Feedback, like a shot, should be given by a professional. | We love getting feedback! | Feedback helps us to get better.",
      "definition": "Feedback helps us to get better."
    },
    {
      "term": "As a manager you want to get feedback from other sources (Multi rater feedback) with your sales employees who are located in store locations each with where there are three other employees. Which of the following sources would you want to make SURE to get feedback from? | Customers and peers. | Customers and employee. | Customers, peers and the employee. | Customers.",
      "definition": "Customers, peers and the employee."
    },
    {
      "term": "People who give multi rater feedback should do all of the following EXCEPT: | Provide feedback that includes behavioral examples. | Provide feedback on the employee's personality. | Provide performance that was observed. | Provide examples of positive behavior.",
      "definition": "Provide feedback on the employee's personality."
    },
    {
      "term": "One of the easiest and most cost effective ways to build employee confidence, develop competence and improve performance is to give your employees feedback on a regular and ongoing basis. True or False? | True | False",
      "definition": "True"
    },
    {
      "term": "Which of the following were described as intentional errors when rating employees? | Being an \"easy grader.\" | Rating everyone the same. | Assigning additional \"traits\" to an employee. | Being a \"tough grader.\"",
      "definition": "Being an \"easy grader.\" | Rating everyone the same. | Being a \"tough grader.\""
    },
    {
      "term": "Which of the following are unintentional errors? | Recency / Primacy. | Varying standards. | Sampling error. | Strictness error.",
      "definition": "Recency / Primacy. | Varying standards. | Sampling error."
    },
    {
      "term": "Which of the following are effective strategies to minimize legal issues in performance management? | Provide calibration training to managers who conduct reviews. | Provide training that contains insight on rater errors and why they occur. | Inflate employee ratings to make employees look good. | Have HR and/or senior managers provide oversight of final reviews.",
      "definition": "Provide calibration training to managers who conduct reviews. | Provide training that contains insight on rater errors and why they occur. | Have HR and/or senior managers provide oversight of final reviews."
    },
    {
      "term": "Which of the following are tips for minimizing rater errors? | Managers Justify ratings. | Oversight by others in the organization (HR - Senior managers). | Hire managers who have experience. | Monitor across departments and manager for overall consistency.",
      "definition": "Managers Justify ratings. | Oversight by others in the organization (HR - Senior managers). | Monitor across departments and manager for overall consistency."
    },
    {
      "term": "Providing training to employees who have performance issues is an effective way to minimize legal risk. True or false? | True | False",
      "definition": "True"
    },
    {
      "term": "Which of the following was stated in video concerning culture and strategy? | Culture eats strategy for breakfast. | Strategy eats culture for breakfast.",
      "definition": "Culture eats strategy for breakfast."
    },
    {
      "term": "\"How we do things around here\" is a definition of which of the following? | HR Processes. | Strategy. | Culture.",
      "definition": "Culture."
    },
    {
      "term": "Which of the following would describe attributes of culture in an organization? | Mission. | Goals. | Corporate citizenship, norms and morés.",
      "definition": "Corporate citizenship, norms and morés."
    },
    {
      "term": "What is not one of the 3 R's of Civility from the lecture? | Restraint. | Reality. | Respect. | Responsibility.",
      "definition": "Reality."
    },
    {
      "term": "Which of the following was not listed under the \"R\" of Restraint? | Active listening. | Acting on values. | Emotional regulation.",
      "definition": "Acting listening."
    },
    {
      "term": "According to the statistic in the lecture, 50% of US employees have stated they were bullied or witnessed such behaviors. True or False? | True | False",
      "definition": "True"
    },
    {
      "term": "Which of the following was listed an impact on teams in a culture of incivility? | Interpersonal Conflicts. | Increased anxiety. | Decreased individual performance. | Decreased job satisfaction.",
      "definition": "Interpersonal Conflicts."
    },
    {
      "term": "One of the consequences of an uncivil culture is people are afraid to speak up for fear of consequences. True or False? | True | False",
      "definition": "True"
    },
    {
      "term": "Which of the following is not a hard cost of incivility to organizations? | Increased absenteeism. | Increased turnover. | Decreased workers compensation claims.",
      "definition": "Decreased workers compensation claims."
    },
    {
      "term": "A civil, positive culture can produce positive results that could be seen as a \"dividend\" to the organization. True of False? | True | False",
      "definition": "True"
    },
    {
      "term": "Servant Leadership focuses on which of the following? | Coercion. | Values. | Scarcity.",
      "definition": "Values."
    },
    {
      "term": "In the cultural \"audit,\" a gap analysis looks at the difference between your cultural vision and your desired vision. True or False? | True | False",
      "definition": "True"
    },
    {
      "term": "In the \"quilt of civility\" one of the items was workplace design. Which of the following were mentioned as part of workplace design? | Cubes vs offices. | Geographic Locations. | What is on the walls in the organization.What is on the walls in the organization.",
      "definition": "Cubes vs offices. | What is on the walls in the organization.What is on the walls in the organization."
    },
    {
      "term": "To create civility in a culture you must do which of the following? | Enforce it. | Let it occur naturally.",
      "definition": "Enforce it."
    },
    {
      "term": "\"Walk the talk\" means: | Our deeds follow our words. | Management by Walking Around (MWA).",
      "definition": "Our deeds follow our words."
    },
    {
      "term": "\"Do unto others as they would have done unto themselves\" was identified as: | The Golden Rule. | The Customer Rule. | The Platinum Rule.",
      "definition": "The Platinum Rule."
    },
    {
      "term": "According to the lesson, when looking at performance, we often use results _____________. | to infer behavior. | when behaviors are not easily observed. | to infer behavior and/or when behaviors are not easily observed.",
      "definition": "to infer behavior and/or when behaviors are not easily observed."
    },
    {
      "term": "When defining performance we focus on: | Results. | Behaviors.",
      "definition": "Behaviors."
    },
    {
      "term": "A bank teller knowing all of the products a bank offers is an example of ________? | Procedural Knowledge. | Declarative Knowledge. | Employee Motivation.",
      "definition": "Declarative Knowledge."
    },
    {
      "term": "You have an employee you know has done a good job in the past and has received good reviews. The job has not changed but lately their performance has not been good as before. Using the concept from class of \"diagnose before you prescribe,\" which of the following would you focus on? | Declarative Knowledge - I would send the employee to training. | Procedural Knowledge - I would have the employee review procedures. | Motivation - Coaching - I would have a discussion with the employee on why their performance has fallen off.",
      "definition": "Motivation - Coaching - I would have a discussion with the employee on why their performance has fallen off."
    },
    {
      "term": "Which of the following was NOT listed as best HR practices in this lesson? | Corporate Branding. | Work/Life Balance. | Rewarding Employees. | Inclusive Environment.",
      "definition": "Corporate Branding."
    },
    {
      "term": "Managers who are measuring an employee's punctuality, how well the employee works with others and the employee's communication skills are demonstrating which performance approach? | Behavior | Traits | Results",
      "definition": "Behavior"
    },
    {
      "term": "Information about the job, broad areas of responsibilities and day to day duties best describes which of the following? | Job Description | Accountabilities | Goals | Objectives",
      "definition": "Accountabilities"
    },
    {
      "term": "Which of the following is an example of a effective performance objective? | Increase Sales | Increase sales by 10% | Increase sales by 10% by end of quarter | Increase overall sales by 10% over last year by the end of this calendar year.",
      "definition": "Increase overall sales by 10% over last year by the end of this calendar year."
    },
    {
      "term": "One of the characteristics of performance objectives is that they should be limited to 3 to 5 maximum. Why is this an important? | More objectives would make it difficult to convey a strong sense of priority for the desired objectives. | It is too hard to come up with more than three objectives.. | Employees don't like a lot of objectives because they have to work harder. | None of the above",
      "definition": "More objectives would make it difficult to convey a strong sense of priority for the desired objectives."
    },
    {
      "term": "Which statement best describes the difference between a performance standards and performance objectives? | Performance standards effect all employees in a single position while objectives are unique to the individual. | There is no difference. | Performance standards are unique to the individual, objectives effect all employees in a single position.",
      "definition": "Performance standards effect all employees in a single position while objectives are unique to the individual."
    },
    {
      "term": "In this type of comparative system, employees are rated according on a normal curve with only percentage of performers at the top, middle and bottom. | Forced distribution. | Simple rank order. | Paired comparison.",
      "definition": "Forced distribution."
    },
    {
      "term": "Gathering examples of performance in which employees performed very effectively or not effectively is known as: | Critical Incidents method. | Simple Ranking. | Essay.",
      "definition": "Critical Incidents method."
    },
    {
      "term": "If you were to select (in order) the best performer, then the worst, the second best and then the second worst until you met in the middle you would be using which of the following methods? | Alternating rank ordering. | Simple rank order. | Forced distribution. | MBO's.",
      "definition": "Alternating rank ordering."
    },
    {
      "term": "As manager I want to make sure my employees are focused on their goals and aligned with corporate strategy. Which method would best meet my needs. | Essay. | Forced distribution. | MBO's. | None of the above.",
      "definition": "MBO's."
    },
    {
      "term": "Which of the methods has become a somewhat controversial method? | Essay. | Forced Distribution. | MBO's. | Simple rating.",
      "definition": "Forced Distribution."
    },
    {
      "term": "A job description for administrative assistants may include \"answering the telephone and transferring calls\" under: | Job duties | KSAs | Job context | Job title",
      "definition": "Job duties"
    },
    {
      "term": "The process of producing a job description is called: | Job analysis | Job descriptioning | Job describing | Job evaluation",
      "definition": "Job analysis"
    },
    {
      "term": "Which of the following statements about benchmarking is FALSE? | Ideally, benchmarks should match educational requirements of the organization's job with the educational requirements of the external benchmark's job. | The US Bureau of Labor Statistics produces estimates of pay in different occupations. | When some external jobs match best on job titles, and other external jobs match best on job descriptions, then it's better to benchmark on job titles rather than job descriptions. | Some external benchmarks are better than others, and when calculating the benchmark average, you may put extra weight on better benchmarks.",
      "definition": "When some external jobs match best on job titles, and other external jobs match best on job descriptions, then it's better to benchmark on job titles rather than job descriptions."
    },
    {
      "term": "Suppose your organization wants to match pay on the external labor market. Which one of these statements is TRUE? | The typical job entrant without experience will begin below the market median pay for that job. | The typical job entrant without experience will begin above the market median pay for that job. | The typical job entrant without experience will begin at the market median pay for that job.",
      "definition": "The typical job entrant without experience will begin below the market median pay for that job."
    },
    {
      "term": "Which of the following is NOT a best practice for compensation surveys, for the purposes of complying with anti-trust law? | Making sure that no one big survey respondent is the main driver of the benchmark data. | Making sure the data are sufficiently old. | Administering the survey yourself.",
      "definition": "Administering the survey yourself."
    },
    {
      "term": "Suppose that a new technology makes coal mining much safer. What affect will this have on labor supply and labor demand? | Labor demand will increase | Labor supply will increase | Labor supply will decrease | The labor supply and labor demand curves will both change | Neither curve will change | Labor demand will decrease",
      "definition": "Labor supply will increase"
    },
    {
      "term": "Suppose that several large companies simultaneously announce that they're going to invest heavily in public infrastructure, raising the price of steel and iron ore. What will happen to the quantity and price (wages) for iron miners? | Labor demand will shift right: iron miners' wages will rise and the quantity of miner will increase. | Labor supply will shift left: iron miners' wages will increase and the quantity of miners will decrease. | Labor demand will shift left: iron miners' wages will decline and the quantity of miners will also decline. | The labor supply and labor demand curves will both change | The labor supply curve will shift right: iron miners' wages will decrease and the quantity of miners will increase. | Neither curve will change",
      "definition": "Labor demand will shift right: iron miners' wages will rise and the quantity of miner will increase."
    },
    {
      "term": "Which of the following is TRUE about pay ranges? | The pay range will give the difference in pay between the least paid person in a grade and the second-least paid person in the pay grade. | The pay range will give the difference in pay between the least-paid person in a grade and the most-paid person in that grade. | The pay range will give the difference in pay between the lowest grade and the highest grade. | The pay range will give the difference in pay between two adjacent grades.",
      "definition": "The pay range will give the difference in pay between the least-paid person in a grade and the most-paid person in that grade."
    },
    {
      "term": "When we draw our salary structure, a movement from left to right corresponds to: | A pay reduction, as you're getting a reduction in pay within the same grade. | A promotion, as you're getting promoted from a low grade to a higher grade. | A demotion, as you're getting demoted from a high grade to a lower grade. | A raise, as you're getting an increase in pay within the same grade.",
      "definition": "A promotion, as you're getting promoted from a low grade to a higher grade."
    },
    {
      "term": "Which of the statements about pay policy lines are TRUE? | They are only used to benchmark pay for the middle grades, and are not used to determine pay at high or low grades. | They go through the tops of the pay ranges. | They go through the midpoints of the pay ranges. | They go through the bottoms of the pay ranges.",
      "definition": "They go through the midpoints of the pay ranges."
    },
    {
      "term": "The pay rates for the jobs that you benchmark are called: | The pay structure's grades. | The pay structure's ranges. | The pay structure's pay policy rates. | The pay structure's control rates.",
      "definition": "The pay structure's control rates."
    },
    {
      "term": "Which of the following statements about merit-based raise criteria are TRUE? | Merit-based raise criteria would typically give the largest raises to people low in the pay range, and with high evaluations. | Merit-based raise criteria would typically give the largest raises to people high in the pay range, and with high evaluations. | Merit-based raise criteria cannot avoid paying people above the maximum of the pay range.",
      "definition": "Merit-based raise criteria would typically give the largest raises to people low in the pay range, and with high evaluations."
    },
    {
      "term": "Which of the following pay structures pays employees a premium for additional occupational licenses and education? | Competency-based structures | Skills-based structures | Job-based structures",
      "definition": "Skills-based structures"
    },
    {
      "term": "Which of the following is a purpose of broadbanding? | Flexibility in lateral job assignments. | Flexibility in pay. | Flexibility in allowing multiple career ladders. | All of the above. | None of the above.",
      "definition": "All of the above."
    },
    {
      "term": "Employees who perform well are given raises. This is an example of a performance evaluation being tied to which element of the pay mix? | LTIs | Base pay | Non-Monetary | STIs | Benefits and Perks",
      "definition": "Base pay"
    },
    {
      "term": "A good performance evaluation can lead to a boost in any of the following EXCEPT? | MBOs | STIs | Benefits and Perks | LTIs | Base pay",
      "definition": "MBOs"
    },
    {
      "term": "Suppose a company decides to separate performance evaluations from raises. Which of the following is a common reason that a company would do so? | The company is concerned that tying pay to evaluations can impede the ability of evaluations to serve as a coaching tool. | The company is concerned that tying pay to performance evaluation makes it difficult for managers and employees to communicate openly about development goals. | Tying pay to performance evaluations encourages poor performers to stay.",
      "definition": "The company is concerned that tying pay to evaluations can impede the ability of evaluations to serve as a coaching tool."
    },
    {
      "term": "Managers conducting performance evaluations tend to overweight instances that occurred in the last week more than those that happened six months ago. This is an example of what kind of bias? | Halo | Anchoring | Recency | Primacy | Horn | Spillover",
      "definition": "Recency"
    },
    {
      "term": "In advance of a measurement period, a performance evaluation sets specific performance targets for employees, and ties pay to the achievement of those targets. This evaluation is an example of | Behaviorally-Anchored Rating Scale (BARS) | Management by Objectives (MBO) | A Realistic evaluation | Critical Incidents evaluation",
      "definition": "Management by Objectives (MBO)"
    },
    {
      "term": "Which of the following is NOT an example of a Key Performance Indicator? | Units produced | Year-end bonus | Average customer service score | Total dollar value of sales generated",
      "definition": "Year-end bonus"
    },
    {
      "term": "A factory line worker is paid a piecerate, or a rate per unit he or she produces. When the materials and components that the line worker receives are faulty, the line worker's performance suffers. This is an example of the | Measurement problem | Alignment problem | Control problem | Metering problem",
      "definition": "Control problem"
    },
    {
      "term": "A call center wants to identify how many calls a customer service representative should take in a given hour. To do so, they use historical data, finding that a customer service representatives can be expected to service an average of six calls per hour. By benchmarking productivity, they are trying to solve | The control problem | The metering problem | The alignment problem | The measurement problem",
      "definition": "The metering problem"
    },
    {
      "term": "What is the relationship between pay and performance when a job only pays a base rate, without STIs? | Accelerated | Flat | Linear (positive slope) | Linear (negative slope)",
      "definition": "Flat"
    },
    {
      "term": "Which of the following statement is TRUE? | A share is only valuable if its price goes up. | A dividend of \"$1 per share\" means you need to pay $1 to purchase a share of the stock. | Both of the above. | None of the above.",
      "definition": "None of the above."
    },
    {
      "term": "Which of the following definitions is correct? | The vesting period represents the period of time over which the options become allowed to be exercised. | The strike price is the market price of the stock on the date that the employee exercises the option to purchase the stock.",
      "definition": "The vesting period represents the period of time over which the options become allowed to be exercised."
    },
    {
      "term": "Which of the following statements about non-qualified stock options (NQSOs) is accurate? | Employers can deduct NQSOs as a business expense, employees do not pay taxes when they exercise NQSOs. | Employers cannot deduct NQSOs as a business expense, employees do pay taxes when they exercise NQSOs. | Employers cannot deduct NQSOs as a business expense, employees do not pay taxes when they exercise NQSOs. | Employers can deduct NQSOs as a business expense, employees do pay taxes when they exercise NQSOs.",
      "definition": "Employers can deduct NQSOs as a business expense, employees do pay taxes when they exercise NQSOs."
    },
    {
      "term": "Which of the following is sometimes referred to as Golden Handcuffs? | bonuses | commissions | stock options | pensions",
      "definition": "stock options"
    },
    {
      "term": "The differences between the stock price and the stock option's strike price is: | The time value | The intrinsic value | The vesting period",
      "definition": "The intrinsic value"
    },
    {
      "term": "Employees who receive high performance evaluations for their prior year's accomplishments are awarded a fixed cash award. This is an example of tying evaluations to what element of the pay mix? | Base pay | Short Term Incentives | Perks | Non-Monetary | Long Term Incentives",
      "definition": "Short Term Incentives"
    },
    {
      "term": "Which of the following are examples of a Key Performance Indicators? | Units produced | Total dollar value of sales generated | Average customer service score | Year-end bonus",
      "definition": "Units produced | Total dollar value of sales generated | Average customer service score"
    },
    {
      "term": "Use the website http://www.dol.gov/whd/minwage/america.htmOpens in a new tab to look up minimum wages in the United States on January 1st, 2016. Which of the following would be true of employers and workers covered by the Fair Labor Standards Act? | Employers in Alabama must pay workers more than the federal rate of $7.25 per hour. | Employers in Alabama must pay workers at least the federal rate of $7.25 per hour. | Employers in Alabama may pay workers $5 per hour.",
      "definition": "Employers in Alabama must pay workers at least the federal rate of $7.25 per hour."
    },
    {
      "term": "Which of the following requires employers to bargain in good faith over wages with workers' elected bargaining representative? | FLSA | NLRA | EEO | FMLA",
      "definition": "NLRA"
    },
    {
      "term": "Which person may be paid a salary? | Someone making $400 per week, whose job duties exempt them from the FLSA. | Someone making $800 per week, whose job duties exempt them from the FLSA. | Someone making $400 per week, whose job duties DO NOT exempt them from the FLSA. | Someone making $800 per week, whose job duties DO NOT exempt them from the FLSA. | None of the above.",
      "definition": "Someone making $800 per week, whose job duties exempt them from the FLSA."
    },
    {
      "term": "Suppose that you're analyzing jobs for Crescendo Coffee, a major coffee retail chain. Assuming each of these people pass the salary test, which person is least likely to be exempted from the FLSA? | A district manager for the New England area. | The Chief Human Resource Officer. | A shift supervisor who primarily serves as a barista, and sometimes supervises one other employee. | A network engineer who maintains the computer systems.",
      "definition": "A shift supervisor who primarily serves as a barista, and sometimes supervises one other employee."
    },
    {
      "term": "Which of the following statements is TRUE of an administrative assistant? | Their job is exempt from the FLSA. | They would need to be paid the minimum wage, but not overtime. Their job duties are not exempt from the FLSA. | They may be paid a salary. | They must be paid minimum wage and overtime. Their job duties are not exempt from the FLSA. | They would need to be paid overtime, but not a minimum wage. Their job duties are not exempt from the FLSA.",
      "definition": "They must be paid minimum wage and overtime. Their job duties are not exempt from the FLSA."
    },
    {
      "term": "Which of the following definitions is not correct? | An HMO is a group of healthcare providers that provide coverage on a prepaid basis | A HDHP is a High-Density Healthcare Provider | A premium is a regular fee paid by the employer or insuree to purchase coverage | A co-insurance is a percent of the cost of health care that the insuree must pay after the deductible is met.",
      "definition": "A HDHP is a High-Density Healthcare Provider"
    },
    {
      "term": "Which of the following statements about the Affordable Care Act are TRUE? | A firm with 20 FTE employees would receive a tax penalty if it does not offer health insurance. | A firm with 200 FTE employees would receive a tax credit if it offers health insurance. | A firm with 20 FTE employees would receive a tax credit if it offers health insurance.",
      "definition": "A firm with 20 FTE employees would receive a tax credit if it offers health insurance."
    },
    {
      "term": "True or False: defined contribution plans are generally tax advantaged because savings can accumulate without capital gains tax. | True | False",
      "definition": "True"
    },
    {
      "term": "True or false: defined contribution plans are generally tax advantaged because upon retirement, withdrawals are treated as capital gains rather than ordinary income. | True | False",
      "definition": "False"
    },
    {
      "term": "Which of the following investment vehicles is least likely to lose 5% of its value? | A US treasury bond | A high-yield bond fund | A stock market index fund",
      "definition": "A US treasury bond"
    },
    {
      "term": "In US federal law, which of the following is NOT a federal statutory benefit? | Twelve weeks unpaid leave for childbirth or adoption | Six weeks paid leave for childbirth or adoption | OASDI",
      "definition": "Six weeks paid leave for childbirth or adoption"
    },
    {
      "term": "Which statement about worker's compensation is TRUE? | It supplements income for workers injured on the job. | It's administered at the federal level. | It requires employers to reimburse employees' work-related expenses. | It supplements compensation for employees who work on weekends and holidays.",
      "definition": "It supplements income for workers injured on the job."
    },
    {
      "term": "Which of the following are NOT beneficiaries of supplementary income under OASDI? | The disabled | Veterans | Retirees over the age of 65 | The immediate family of deceased workers (e.g. widows and widowers)",
      "definition": "Veterans"
    },
    {
      "term": "A company that stages haunted houses is looking to hire cast members who are enthusiastic about the horror genre. One of the perks that they offer is a huge zombie-themed party for just the cast after the performances are done, which is easy since the company already has make-up, props, and the haunted house. There are some general reasons that the company may decide to pay for a party rather than provide higher cash rewards? Which of the below is NOT a reason. | It's cheaper for the company than the cast members to throw a party | The party would attract the \"right\" kind of worker | The party would also bring revenue to the company",
      "definition": "The party would also bring revenue to the company"
    },
    {
      "term": "Consider a company that has a relatively high degree of job security and a pay mix that benchmarks compensation at the 75th percentile for base pay and benefits. However, unlike competitors, it does not offer short-term incentives or long-term incentives. What message mostly is likely to accompany this pay mix? | The company values individual performance. | The company values a loyal, stable, risk-averse workforce. | The company values initiative and autonomy. | The company values employees who are risk-loving.",
      "definition": "The company values a loyal, stable, risk-averse workforce."
    },
    {
      "term": "There are a several reasons firms use employer-sponsored pension plans. One reason is that it allows employees to defer compensation until retirement, when they're taxed at a relatively low rate. Second, by participating in an employer's plan, the employer may be able to negotiate lower management fees with service providers. These two specific reasons illustrate what two general reasons that firms provide employer-sponsored pension plans, rather than cash? Mark the best answer | They're cheaper for firms to provide than for workers | They attract the right kind of worker | They're motivational symbolic benefits | They're cheaper for firms to provide than for workers and they enjoy returns to scale | They provide benefits to firms",
      "definition": "They're cheaper for firms to provide than for workers and they enjoy returns to scale"
    },
    {
      "term": "Suppose that, for some condition, an insuree has a $1,000 deductible and 50% coinsurance until a $10,000 cap. The health care provider's fees amount to $600. What is the insuree's liability? | $0 | $300 | $1,000 | $600",
      "definition": "$600"
    },
    {
      "term": "True or False: Defined contribution plans are generally tax advantaged because they allow you to defer taxable income until you're in a lower tax bracket. | True | False",
      "definition": "True"
    },
    {
      "term": "Li Li's pension fund mandates that she will receive $1800 per month for the rest of her life. This is an example of what kind of fund? | Defined Contribution (e.g. 401k) | Defined Benefit | Simplified Employee Pension",
      "definition": "Defined Benefit"
    },
    {
      "term": "Pierre's pension plan allows him to choose the amount of his contribution and how his contributions are invested. The better his chosen investments perform, the more money he'll have in his plan's account when he retires. This is an example of what kind of a pension plan? | Social Security | Defined Benefit | Defined Contribution (e.g. 401k)",
      "definition": "Defined Contribution (e.g. 401k)"
    },
    {
      "term": "Non-monetary rewards are valuable to: | nobody, because non-monetary rewards do not involve cash compensation | only employers | only employees | to both employees and employers",
      "definition": "to both employees and employers"
    },
    {
      "term": "Examples of gaining individual growth through non-monetary rewards include: | Getting feedback from your manager or coworkers | Making a good guess at how to perform better | Having a mentor at work or elsewhere",
      "definition": "Getting feedback from your manager or coworkers | Having a mentor at work or elsewhere"
    },
    {
      "term": "Employees must receive less cash compensation to also receive a non-monetary reward. | True. Non-monetary rewards cost the company money, and are generally offset by lower cash compensation | False. In most cases non-monetary rewards are offered in addition to a fair level of cash compensation",
      "definition": "False. In most cases non-monetary rewards are offered in addition to a fair level of cash compensation"
    },
    {
      "term": "An employer might decide to offer a non-monetary reward because: | It might aid in employee retention | It might show a special value and/or uniqueness of the company | Everybody else was doing it. The company didn't want to get left behind",
      "definition": "It might aid in employee retention | It might show a special value and/or uniqueness of the company"
    },
    {
      "term": "The most important non-monetary reward for employees is: | Flexibility | Bringing a pet dog to work | Being able to work part-time | Each employee has their own unique needs and preferences, so the importance of non-monetary rewards will vary by individual",
      "definition": "Each employee has their own unique needs and preferences, so the importance of non-monetary rewards will vary by individual"
    },
    {
      "term": "A heartfelt thank-you is an effective form of recognition | TRUE. It can mean a lot when you have worked on something, and it is noticed and appreciated by others. | FALSE. A thank-you doesn't cost anything, so it does not have very much value to anyone.",
      "definition": "TRUE. It can mean a lot when you have worked on something, and it is noticed and appreciated by others."
    },
    {
      "term": "Recognition programs include: | Sales awards, to acknowledge selling success | Service awards, to acknowledge continued employment | Performance awards, to acknowledge a job well done",
      "definition": "Sales awards, to acknowledge selling success | Service awards, to acknowledge continued employment | Performance awards, to acknowledge a job well done"
    },
    {
      "term": "Examples of workplace flexibility include: | Part-time work schedule | Not showing up to work whenever I feel like staying home | Taking a short leave-of-absence to handle a family emergency",
      "definition": "Part-time work schedule | Taking a short leave-of-absence to handle a family emergency"
    },
    {
      "term": "Training programs: | Can be on-the-job, or in a classroom | Rarely work when it involves oversight from someone else | Are expensive and generally do not work",
      "definition": "Can be on-the-job, or in a classroom"
    },
    {
      "term": "Training is only worthwhile if it leads to a promotion | TRUE. It must lead to a promotion | FALSE. It can be worthwhile if it helps you do your job better",
      "definition": "FALSE. It can be worthwhile if it helps you do your job better"
    },
    {
      "term": "Formal program designs are always best for non-monetary rewards. | TRUE. Formal program designs are always best | FALSE. Informal and formal program designs can both work well.",
      "definition": "FALSE. Informal and formal program designs can both work well."
    },
    {
      "term": "Benefits of an informal approach to non-monetary rewards include: | The manager can often approve the non-monetary reward | Implementation can be quick | There are generally no issues of inequity across managers",
      "definition": "The manager can often approve the non-monetary reward | Implementation can be quick"
    },
    {
      "term": "Non-monetary rewards should always be avoided when: | Everyone can't benefit | Employees work in multiple locations | Most employees work part-time | There isn't a clear reason to totally avoid non-monetary rewards. Non-monetary rewards help in so many ways",
      "definition": "There isn't a clear reason to totally avoid non-monetary rewards. Non-monetary rewards help in so many ways"
    },
    {
      "term": "Non-monetary rewards are best when: | The company tailors them to their own unique needs and values | They only include the most common non-monetary rewards found at other companies | Everyone can participate all the time",
      "definition": "The company tailors them to their own unique needs and values"
    },
    {
      "term": "Non-monetary rewards: | Are worth it. Go for it! | Can cause too many problems and should be avoided | Generally lead to employee dissatisfaction",
      "definition": "Are worth it. Go for it!"
    },
    {
      "term": "From an employee's perspective, non-monetary rewards are: | Hard to understand | A nuisance, and take up valuable time at work | Valuable to each employee based upon their preferences | Important, and might include a good company reputation",
      "definition": "Important, and might include a good company reputation | Valuable to each employee based upon their preferences"
    },
    {
      "term": "The benefits of being an Employer of Choice include: | Likely to have a great reputation | Probably make it easier to recruit new employees | Guarantees business success | Employees like working for your company",
      "definition": "Likely to have a great reputation | Probably make it easier to recruit new employees | Employees like working for your company"
    }
  ]
}
