{
  "quizSrc": [
    {
      "term": "TRUE OR FALSE: The main goal of futures thinking is to get better at accurately predicting the future. | True | False",
      "definition": "False"
    },
    {
      "term": "TRUE OR FALSE: According to a global scientific study, most people say YES, if it were possible, I would like to know what will happen in my own future - for example, the cause of my death, or whether my marriage will end in divorce. | TRUE | FALSE",
      "definition": "FALSE"
    },
    {
      "term": "According to Alvin Toffler, author of FUTURE SHOCK, \"When it comes to thinking about the future, it's more important to be WHAT than to be right?\" | It's more important to be IMAGINATIVE than to be right. | It's more important to be FAST than to be right. | It's more important to be READY than to be right.",
      "definition": "It's more important to be IMAGINATIVE than to be right."
    },
    {
      "term": "Professional futurists often say: \"There are no WHAT about the future?\" | There are no FACTS about the future. | There are no RULES about the future. | There are no WORRIES about the future. | There are no BAD IDEAS about the future.",
      "definition": "There are no FACTS about the future."
    },
    {
      "term": "You've finished your first week of futures thinking training - congratulations! What's the single most important thing YOU would teach someone else, if you were trying to explain futures thinking to someone who had never heard about it? (This is a chance for you to reflect and offer your own personal answer. There is no wrong answer! Use this question as an opportunity to reach your own \"aha\" insight.) | ",
      "definition": "There are no FACTS about the future."
    },
    {
      "term": "In how many years does the future start, according to professional futurists? | 10",
      "definition": "10"
    },
    {
      "term": "Is creativity one of the seven strengths you will develop by practicing futures thinking? | Yes | No",
      "definition": "Yes"
    },
    {
      "term": "Is foresight one of the seven strengths you will develop by practicing futures thinking? | Yes | No",
      "definition": "Yes"
    },
    {
      "term": "Is empathy one of the seven strengths you will develop by practicing futures thinking? | Yes | No",
      "definition": "Yes"
    },
    {
      "term": "Is practical skepticism one of the seven strengths you will develop by practicing futures thinking? | Yes | No",
      "definition": "Yes"
    },
    {
      "term": "Is strategy one of the seven strengths you will build by practicing futures thinking? | Yes | No",
      "definition": "Yes"
    },
    {
      "term": "Is hope one of the seven strengths you will develop by practicing futures thinking? | Yes | No",
      "definition": "Yes"
    },
    {
      "term": "Is smarter investing one of the seven strengths you will develop by practicing futures thinking? | Yes | No",
      "definition": "No"
    },
    {
      "term": "Is talent spotting one of the seven strengths you will develop by practicing futures thinking? | Yes | No",
      "definition": "No"
    },
    {
      "term": "Is accurate prediction one of the seven strengths you will develop by practicing futures thinking? | Yes | No",
      "definition": "No"
    },
    {
      "term": "Is mental flexibility one of the strengths you will develop by practicing futures thinking? | Yes | No",
      "definition": "Yes"
    },
    {
      "term": "This week, you learned about signals of change. Which of these are accurate descriptions of signals of change? Choose all that apply. | They are the \"raw ingredients\" or \"building blocks\" of futures thinking. | They are clues to how the future might be different. | They are real things, happening now, in the real world. | They are always a new technology or a scientific innovation.",
      "definition": "They are the \"raw ingredients\" or \"building blocks\" of futures thinking. | They are clues to how the future might be different. | They are real things, happening now, in the real world."
    },
    {
      "term": "This week, you read a report about the Future of Work in the year 2030. This quiz is about some of the SIGNALS OF CHANGE described in the report. The computer vision research team at the Allen Institute for Artificial Intelligence recently released a collaborative game. In the game, a human and an AI take turns drawing scenes that the other can understand and identify correctly. The goal of the game is to improve human-AI communication. What kind of CHANGE is this a SIGNAL of? | AI is becoming more collaborative with humans. | AI is becoming more likely to replace humans at work.",
      "definition": "AI is becoming more collaborative with humans."
    },
    {
      "term": "Etch is a new blockchain-based payroll system that automatically pays wages to workers in real-time. Instead of waiting for a check every two weeks or 30 days for an invoice to be paid, Etch gets you your wages the second you earn them. Or, as they say: \"You can buy lunch with the money you earned at work that morning.\" What kind of CHANGE is this a SIGNAL of? | Secure distributed ledgers like blockchain will make it easier for people to get paid right away for work in the future, increasing their economic security. | Secure distributed ledgers like blockchain will make it more complicated to pay people in the future, creating new stress for employers.",
      "definition": "Secure distributed ledgers like blockchain will make it easier for people to get paid right away for work in the future, increasing their economic security."
    },
    {
      "term": "A new kind of technology called \"ultra-haptics\" will allow people to interact with machines without touching them. One signal in this field is an ATM (cash withdrawal machine) that you can operate without touching any buttons. You simply wave your hands in the air. What kind of CHANGE is this a SIGNAL of? | Interacting with machines will be more dangerous in the future, especially at work. | Interacting with machines will be safer and cleaner in the future, especially in spaces where many different people interact with the same machines.",
      "definition": "Interacting with machines will be safer and cleaner in the future, especially in spaces where many different people interact with the same machines."
    },
    {
      "term": "Interplay Learning is an online learning platform that uses Virtual Reality and 3D simulations to train workers in new skills. Workers can access 100s of hours of lessons anywhere, anytime. What kind of SIGNAL of CHANGE is this? | In the future, workers will have fewer opportunities to learn new skills at work. | In the future, online learning and workplace learning is likely to be more immersive and simulation-based. It may incorporate Virtual Reality and Augmented Reality into every learning experience. The majority of Coursera courses could be VR and AR based by 2030!",
      "definition": "In the future, online learning and workplace learning is likely to be more immersive and simulation-based. It may incorporate Virtual Reality and Augmented Reality into every learning experience. The majority of Coursera courses could be VR and AR based by 2030!"
    },
    {
      "term": "Which of these signals of change do you personally find most interesting, or think is most likely to impact YOU in the future? (There is no right or wrong answer to this question. Use it as a chance to reflect on what you read!) | The AI/human collaborative drawing game | Etch, the instant payroll platform | Ultrahaptics \"no touch\" interfaces | Interplay Learning by VR and 3D simulation",
      "definition": "The AI/human collaborative drawing game | Etch, the instant payroll platform | Ultrahaptics \"no touch\" interfaces | Interplay Learning by VR and 3D simulation"
    },
    {
      "term": "When was the Institute for the Future founded? | 1960s | 1970s | 1980s | 1990s",
      "definition": "1960s"
    },
    {
      "term": "What was the primary reason for the creation of the Institute for the Future? | To create the conditions for peace globally. | To deal with the accelerating rate and scale of change in society, and to help society learn how to control those forces of change. | To help companies maximize profit and grow faster.",
      "definition": "To deal with the accelerating rate and scale of change in society, and to help society learn how to control those forces of change."
    },
    {
      "term": "Which is the best description of the method of futures thinking that Institute for the Future proposed to create and teach to others? | Explore multiple alternative futures, analyze the comparative risks and benefits of each, and devise strategies and action plans for increasing the probability of the most desired futures | Describe multiple possible futures, rate each future for their likelihood and probability of actually happening, and propose investments and business strategies to maximize profit and growth based on those probabilities | Identify the worst-case and best-case scenario futures, and help leaders prepare for both possibilities",
      "definition": "Explore multiple alternative futures, analyze the comparative risks and benefits of each, and devise strategies and action plans for increasing the probability of the most desired futures"
    },
    {
      "term": "The prospectus for Institute for the Future says that it will be \"imaginative by design.\" What does this mean? | It will encourage a wide range of writers, scientists, philosophers, artists, engineers and social innovators to contribute their creative vision and unique point of view about what they believe could be possible in the future. | It will not be concerned with \"evidence\" but will rely mainly on intuition.",
      "definition": "It will encourage a wide range of writers, scientists, philosophers, artists, engineers and social innovators to contribute their creative vision and unique point of view about what they believe could be possible in the future."
    },
    {
      "term": "This type of futures thinking is the first step in any new futures project. It asks the question: How might the world be different in the next 10 years? It looks for evidence of changes already happening today and helps us anticipate what's coming next. | Forecasting skills | Simulation skills | Collaborative gaming skills | Action skills",
      "definition": "Forecasting skills"
    },
    {
      "term": "This type of futures thinking helps you immerse yourself in possible futures. It challenges you to feel and experience the future before it happens. The goal is to help you decide which futures you want to make more likely, which futures you want to prevent, and what actions you can take to thrive and succeed in any given future. | Forecasting skills | Simulation skills | Collaborative gaming skills | Action skills",
      "definition": "Simulation skills"
    },
    {
      "term": "This type of futures thinking is designed to help you avoid blindspots when it comes to the future. It lets you see the future from many diverse points of view. It helps you work with others to uncover the hardest-to-anticipate consequences and ripple effects of change. | Forecasting skills | Simulation skills | Collaborative gaming skills | Action skills",
      "definition": "Collaborative gaming skills"
    },
    {
      "term": "This type of futures thinking helps you strategize about what you can do today to make the future you want more likely, and the futures you don't want less likely. | Forecasting skills | Simulation skills | Collaborative gaming skills | Action skills",
      "definition": "Action skills"
    },
    {
      "term": "Which of these types of futures thinking are you personally most excited to learn and practice? There is no right or wrong answer to this question. Use it as an opportunity to reflect on what you've learned this week! | Forecasting skills | Simulation skills | Collaborative gaming skills | Urgent optimism / Action skills",
      "definition": "Forecasting skills | Simulation skills | Collaborative gaming skills | Urgent optimism / Action skills"
    },
    {
      "term": "You've met four new people this week who use futures thinking in their work. You've also had a chance to read a report on how professional (full-time) futurists do their work. With this glimpse into a day in the life of a a diverse group of futurists, how do you think futures thinking might fit into your own work or your community involvement? If you were to explain to someone in just a few sentences, \"This is why I think futures thinking is going to be important to me personally...\", what would you say? (This is a chance for you to reflect and offer your own personal answer. There is no wrong answer! Use this question as an opportunity to reach your own \"aha\" insight.) | ",
      "definition": "Simulation skills"
    },
    {
      "term": "What's the best definition for a future forecast? | A prediction of what will most likely happen in the future, based on probability, statistics and simulations. | A prediction of what COULD happen in the future, based on evidence of how the world is already changing. This evidence is called \"signals\" of change. | A description of what you want to happen in the future.",
      "definition": "A prediction of what COULD happen in the future, based on evidence of how the world is already changing. This evidence is called \"signals\" of change."
    },
    {
      "term": "Futurist Bob Johansen has a three-word philosophy that sums up the purpose and methods of future forecasting. He uses it in his daily personal life, and not just at work, to practice the skills of arriving before the masses and giving yourself enough time to think more clearly and respond to surprising challenges. What is this three-word philosophy? | ",
      "definition": "Get There Early"
    },
    {
      "term": "Institute for the Future uses a three-step methodology that Bob Johansen explains in his mini-masterclass video and in the reading this week. The first step of the methodology, or cycle, is to anticipate what might be different in the future. What is the name of this step? | ",
      "definition": "Foresight"
    },
    {
      "term": "The second step of the Institute for the Future methodology is to make sense of the possible changes and imagine what you might do to prepare for and take advantage of those changes, or to slow them down and prevent them. What is the name of this step? | ",
      "definition": "Insight"
    },
    {
      "term": "The third step in the Institute for the Future methodology is to start trying new things, today, that let you experiment with possible strategies for the future. What is the name of this step in the cycle? | ",
      "definition": "Action"
    },
    {
      "term": "Professional futurists often talk about \"drivers of change\" when making future forecasts. What's a driver of change? | A person who gets to decide what the future will be. | A major new technology, global trend or phenomenon that is likely to have a big influence on what the future will be. | An action you can take today to change what the future will be.",
      "definition": "A major new technology, global trend or phenomenon that is likely to have a big influence on what the future will be."
    },
    {
      "term": "What's the best way to describe what Blockchain technology is? | A decentralized system of record-keeping, in which it is easier to counterfeit or fake data because no one authority is in charge of maintaining the record | A decentralized system of record-keeping, protected by a form of math called crypotgraphy so that only experts in security and advanced mathematics have access to the records | A decentralized system of record-keeping, protected by cryptography, that creates trust because everyone connected to the system has a complete copy of the record, preventing individuals from faking data or altering the record",
      "definition": "A decentralized system of record-keeping, protected by cryptography, that creates trust because everyone connected to the system has a complete copy of the record, preventing individuals from faking data or altering the record"
    },
    {
      "term": "The Blockchain forecast you read this week predicts that we will see three waves of innovation when it comes to blockchain over the next decade. Computing: The rise of a new global \"stateful\" computing platform that will be highly automated and transparent, and replace Cloud computingCurrencies: The invention of new forms of money, or crypto-tokens, and many new ways of exchanging and distributing money with fewer middle-menCommons: Important physical resources and infrastructure start to be managed by the crowd (ordinary people), instead of by the governments and corporations, when blockchain computing is connected to the Internet of ThingsWhat order are these 3 waves of innovation expected to occur in? | Computing, Currencies, Commons | Commons, Computing, Currencies | Currencies, Computing, Commons | Currencies, Commons, Computing",
      "definition": "Currencies, Computing, Commons"
    },
    {
      "term": "Blockchain is an exciting but complicated driver of change. What jumps out at you this from this week's video or reading as being personally of interest to YOU about blockchain? Is there a particular use for Blockchain, or a signal in the report, or scenario that feels personally important to YOUR work or YOUR life? Or is there one thing you'd like to learn more about the Blockchain, based on what you learned this week?There is no right or wrong answer here - whatever you share will count as a correct response! Use this question as a chance to reflect on what you've learned this week and make a personal connection to the material. | ",
      "definition": "The Blockchain forecast you read this week "
    },
    {
      "term": "This week, you watched two demonstration videos of how to turn signals and drivers into forecasts. Which of the two demonstrated forecasts do you think would impact you the most if it came true? (There is no right or wrong answer to this question. It's just an opportunity for you to reflect on what you learned this week!) | Yes, you can play with your food! Virtual reality and 3D food printers make mealtime more fun and experimental | Go team! Professional sports allow fans to buy power-ups for their favorite athletes and teams through physical activity",
      "definition": "Yes, you can play with your food! Virtual reality and 3D food printers make mealtime more fun and experimental"
    },
    {
      "term": "Thinking about the forecast you chose as most likely to impact you personally... HOW do you think it might impact you, for better or for worse? Take a moment to imagine yourself living in this future. How is your life or work different? There is no right or wrong answer to this question. Use it as an opportunity for you to reflect on what you learned this week, and to make a personal connection to the future topics we discussed. | ",
      "definition": "Yes, you can play with your food! Virtual reali"
    },
    {
      "term": "This week, you had the option to read one or more future forecasts from Wired World.Pick ONE of the forecasts you read. Which one did you read, and how do you think it might impact you, for better or for worse? How could this future change YOUR life personally? Take a moment to imagine yourself living in this future. How is your life or work different? There is no right or wrong answer to this question. Use it as an opportunity for you to reflect on what you learned this week, and to make a personal connection to the future topics we discussed. | ",
      "definition": "e option to read one or more future forecasts fro"
    },
    {
      "term": "In this week's readings, you encountered three new scenarios about the future of machines. In the scenario \"Machines as Consumers\", what is different about this future? | Globally, more money is now spent on purchases for keeping machines running than for keeping humans alive. | Instead of deciding what to buy for themselves, most people let artificially intelligent \"personal assistants\" do their shopping for them.",
      "definition": "Instead of deciding what to buy for themselves, most people let artificially intelligent \"personal assistants\" do their shopping for them."
    },
    {
      "term": "In the scenario \"Machines as Criminals\", what's different in this future? | Lawmakers have to decide who should be legally responsible when \"smart\" objects break the law: the people who own the objects, or the companies who make them? For example, if a self-driving car gets a speeding ticket, who should pay: the owner of the car, or the auto manufacturer who programmed it to speed? | It proves impossible to teach ethical decision making to robots and AI. As a result, most \"smart\" machines behave in ways that are criminal or in violation of human values, and the production of \"bad\" machines is banned.",
      "definition": "Lawmakers have to decide who should be legally responsible when \"smart\" objects break the law: the people who own the objects, or the companies who make them? For example, if a self-driving car gets a speeding ticket, who should pay: the owner of the car, or the auto manufacturer who programmed it to speed?"
    },
    {
      "term": "In the scenario \"Machines as Conscience\", what is different in this future? | A new AI called the \"Digital Consequence Awareness System\" helps people understand the ripple effects and long-term consequences of their actions, so they can behave more ethically. | A new blockchain app called \"Karma\" allows individuals to report when someone else's actions have helped them or harmed them, creating a lifelong record of who is a \"good person\" or a \"bad person\".",
      "definition": "A new AI called the \"Digital Consequence Awareness System\" helps people understand the ripple effects and long-term consequences of their actions, so they can behave more ethically."
    },
    {
      "term": "Of these 3 scenarios, which one do you personally think is the most thought-provoking and important to consider? There is no right or wrong answer to this question; use it as an opportunity to reflect on what you've read this week. (Whatever answer you pick will be marked correct!) | Machines as Consumers | Machines as Criminals | Machines as Conscience",
      "definition": "Machines as Consumers | Machines as Criminals | Machines as Conscience"
    },
    {
      "term": "This week you learned about the neurological pathways and activity areas of the brain that support thinking more creatively about the future.One of the most important neurological activities in thinking about the future is \"scene construction.\" During scene construction, the brain creates a vivid movie or 3D virtual reality in your mind's eye. It allows you to \"look around\" and immerse yourself in a simulated scene, whether it's something that you're remembering or something you're imagining could happen in the future. What is another term for this neurological activity? | Performance monitoring | Memory and simulation | Mentalizing",
      "definition": "Memory and simulation"
    },
    {
      "term": "Another important neurological activity that happens when we think about the future is that we try to simulate how other people might feel and what they might do. This activity is a way for our own brain to \"get inside someone else's mind.\" That why it's called: | Mentalizing | Performance monitoring | Memory and simulation",
      "definition": "Mentalizing"
    },
    {
      "term": "A third neurological activity that happens when we think about the future is a kind of \"scanning\" of the future for possible opportunities to make choices and take actions that serve our own personal goals. What is this called? | Performance monitoring | Mentalizing | Memory and simulation",
      "definition": "Performance monitoring"
    },
    {
      "term": "If you want to build up all of the neurological pathways that support these 3 important activities - memory and simulation, mentalizing and performance monitoring - you can practice the \"magic triangle\" of simulation. What are the 3 habits that make up this magic triangle? Pick three answers only. | Remembering the past exactly as it was | Remembering the future as if it has already happened | Predicting the past, and how it could have been different | Predicting the future, and explaining why it will be that way | Hard empathy, or imagining yourself in situations you've never directly experienced | Easy empathy, or experiencing other people's feelings in familiar situations as if it were happening to you",
      "definition": "Remembering the future as if it has already happened | Predicting the past, and how it could have been different. | Hard empathy, or imagining yourself in situations you've never directly experienced."
    },
    {
      "term": "There's a region of the brain that fires up whenever you register something as important to you, personally. It says, \"Hey! This matters to YOU! It's about YOU! Pay attention!\" What is this region called? | Medial PreFrontal Cortext | Hippocampus | Temporal Lobe | Amygdala",
      "definition": "Medial PreFrontal Cortext"
    },
    {
      "term": "What does this same part of the brain do, for most people, when they imagine themselves in a far future - say, 10 years out or more? | It acts like they're thinking about a complete stranger, someone who doesn't matter to them at all. | If they're in a good mood, it fires up and says \"Hey! Pay attention!\" If they're bored, frustrated, or angry, it doesn't react. | It fires up and says \"Hey! This is important! Pay attention!\"",
      "definition": "It acts like they're thinking about a complete stranger, someone who doesn't matter to them at all."
    },
    {
      "term": "What's the result of this part of the brain's behavior, when it comes to imagining your future self? | It's easier to predict what you will do and harder to predict what other people will do in the future. As a result, you lose empathy for others and focus only on your own needs and goals. | It's hard to have empathy for your future self. As a result, you make decisions that feel good in the short run but are maybe not-so-good in the long run. | If you spend too much time thinking about your future self, you can become disoriented. You may become confused about what is realistic or possible and set unrealistic goals for yourself.",
      "definition": "It's hard to have empathy for your future self. As a result, you make decisions that feel good in the short run but are maybe not-so-good in the long run."
    },
    {
      "term": "This week, you learned about 3 different areas of simulation innovation. One area of innovation is creating realistic video or audio of a real person saying something they've never actually said, or doing something they've never actually done. These videos and audio recordings are based on machine intelligence. An AI creates an authentic-seeming \"fake\" based on real, previous videos and audio recordings. So they are a hybrid of \"real\" and \"faked.\" What does futurist Jamais Cascio call these new kinds of half-real simulations? | A \"simtainer\" | \"Simulacra\" | Haptics",
      "definition": "\"Simulacra\""
    },
    {
      "term": "Another area of simulation innovation is the use of shipping containers to create a portable Virtual Reality environment that can easily be set up, moved, and re-installed anywhere in the world. Futurists are using these spaces to imagine how real shipping containers, an important and underutilized part of the global infrastructure, might be used in the future. What is this project/technology called? | Simtainers | Simulacra | Haptics",
      "definition": "Simtainers"
    },
    {
      "term": "The third simulation technology explored this week is technology that simulates touch. It allows you to have a physical sensation of touching a virtual object, or being touched by a virtual object. This can include anything from simulated hugs via video chat to phone vibrations that feel like raindrops falling on your hand. What is this technology field called? | Simtainers | Simulacra | Haptics",
      "definition": "Haptics"
    },
    {
      "term": "It's not hard to imagine negative consequences of simulacra technologies. Convincingly faked videos or faked audio created through AI machine learning will almost certainly lead to new forms disinformation, propaganda, and new kinds of bullying and harassment. But your reading this week identifies several possible positive uses of the technologies. Which example stands out to you as the most legitimately useful application? Or, can you think of another potential positive use of this tech? What might it be?This is an open-ended question with no right or wrong answers! Whatever you share will be marked as correct. Use it as an opportunity to reflect on, and make a more personal connection, with the material you read this week. | ",
      "definition": " hard to imagine negative consequences of simulacra technologies. Convincing"
    },
    {
      "term": "In his interview, David Birnbaum points to the potential ethical issues around haptics. If you can simulate good touch, you can also simulate unpleasant or harmful touch. What kinds of negative uses can you imagine in the future, if haptics become more commonplace? What kind of touch would you NOT want to experience, or what safeguards would you want in place to prevent others online from \"touching\" you in unwanted ways or at unwanted times? This is an open-ended question with no right or wrong answers! Whatever you share will be marked as correct. Use it as an opportunity to reflect on, and make a more personal connection, with the material you read this week. | ",
      "definition": " hard to imagine negative consequences of simulacra technologies. Convincing"
    },
    {
      "term": "Which of these three types of simulation technologies are personally most interesting to you? Which one could you see yourself being most affected by in the future, or taking the time to work with and create something yourself in the future?(There is no right or wrong answer to this question. Whatever you choose will be marked \"correct.\" Use this question as an opportunity to reflect and make a more personal connection with this week's lesson.) | Simtainers | Simulacra videos/audio recordings | Haptics",
      "definition": "Simtainers | Simulacra videos/audio recordings | Haptics"
    },
    {
      "term": "Who invented and first described \"Afrofuturism\"? | N.K. Jemisin | Octavia Butler | Mark Dery | Samuel L. Delany",
      "definition": "Mark Dery"
    },
    {
      "term": "Which of these are true statements about Afrofuturism? Check all that apply. | It focuses on the experience of black people in the future. | It usually has a positive or utopian aspect, depicting a better world than today. | It is often practiced and communicated through popular culture, like music videos, fashion magazines, movies, and science-fiction writing. | For many people, it is a kind of artistic therapy, working through the traumas of the past and present by imagining a more just future.",
      "definition": "It focuses on the experience of black people in the future. | It usually has a positive or utopian aspect, depicting a better world than today. | It is often practiced and communicated through popular culture, like music videos, fashion magazines, movies, and science-fiction writing. | For many people, it is a kind of artistic therapy, working through the traumas of the past and present by imagining a more just future."
    },
    {
      "term": "In one of this week's videos, Professor Lonny Brooks says the African diaspora community \"have always been futurists.\" Why?(The African Diasporais the term commonly used to describe the mass dispersion of people fromAfricaduring the Transatlantic Slave Trades, from the 1500s to the 1800s. ThisDiasporatook millions of people from Western and CentralAfricato diﬀerent regions throughout the Americas and the Caribbean.) | The slave trade took Africans against their will to far-away, strange lands where they needed to adapt, innovate, and invent new culture in order to survive. | As a way to deal with the trauma of slavery, many cultural and religious practices spread by the African diaspora centered around imagining their future selves somewhere better. | The work performed by enslaved people globally built the future, creating the economies and raw materials needed to invent modern society.",
      "definition": "The slave trade took Africans against their will to far-away, strange lands where they needed to adapt, innovate, and invent new culture in order to survive."
    },
    {
      "term": "Afrofuturism is a storytelling, art-making practice focused on a particular cultural imagination, rising out of a unique community: the African diaspora.What other communities who have been displaced or traumatized in the past and present do you think have an important role to play in imagining better futures? What other kinds of futurism could you imagine building on and being inspired by the important cultural work of Afrofuturism? Or how would you like to see Afrofuturism itself develop and be used in the future?There is no right or wrong answer to this question. Use it as an opportunity for you to reflect on what you learned this week, and to make a personal connection to the future topics we discussed. | ",
      "definition": "turism is a storytelling, art"
    },
    {
      "term": "What goes at the center of a future wheel? | A prediction of what you believe is the most likely future | A forecast or scenario you want to explore the consequences of | A question you have about the future",
      "definition": "A forecast or scenario you want to explore the consequences of"
    },
    {
      "term": "What question is the main question you ask, in order to fill out your future wheel? | If this future change happened, what might happen NEXT? | How likely is this change to happen? | Do I want this future change to happen? Why or why not?",
      "definition": "If this future change happened, what might happen NEXT?"
    },
    {
      "term": "What is the primary goal of filling out a future wheel? | To uncover hard-to-predict, surprising consequences of any future change or event. | To determine the most likely positive consequences and most likely negative consequences of any future change or event. | To brainstorm responses and strategies for dealing with any future change or event.",
      "definition": "To uncover hard-to-predict, surprising consequences of any future change or event."
    },
    {
      "term": "This week's quiz is a kind of \"true or false\" quiz. Which of these are real signals of change that already exist today? Which are made up, and do not in fact exist? (All of the \"real\" signals appear in this week's videos and readings!)Here's your first signal:A neurosensing headband monitors how \"focused\" or \"bored\" you are. If you are deeply focused on a task, it automatically cancels notifications to your phone and hides new emails so you can stay focused on your job. | This is real, it already exists. | This is not real.",
      "definition": "This is real, it already exists."
    },
    {
      "term": "A smart wallet that knows how much money you've spent this month so far and what your total monthly budget is. It becomes harder and harder to pry open the closer you get to your maximum budget. | This is real, it already exists. | This is not real.",
      "definition": "This is real, it already exists."
    },
    {
      "term": "A smart shirt for rugby fans that uses haptic feedback to help them \"feel\" the action on the sports field. For example, the fan would feel a strong rumbling in their chest when a player is tackled in the real match. | This is real, it already exists. | This is not real.",
      "definition": "This is real, it already exists."
    },
    {
      "term": "A videogame that uses mind-reading technology to allow two players to cooperate. Player one can see the screen and \"thinks\" of what they want to do in the game. Player two controls the joystick but cannot see the screen. The muscles in the second player's finger are connected to player one's brain, and automatically fire and do whatever the first player thinks of doing, essentially creating a remote, mind-controlled hand. | This is real, it already exists. | This is not real.",
      "definition": "This is real, it already exists."
    },
    {
      "term": "A radio that can detect your feelings like anxiety and stress when you walk by it. It does this by bouncing wi-fi signals off of your body, to detect heart rate and breathing rate. | This is real, it already exists. | This is not real.",
      "definition": "This is real, it already exists."
    },
    {
      "term": "A small, non-invasive wearable earpiece that stimulates the vagus nerve to change your mood. You get to pick how you want to feel. You can set it to increase your energy and alertness or to decrease anxiety, and feel calm and peaceful. | This is real, it already exists. | This is not real.",
      "definition": "This is real, it already exists."
    },
    {
      "term": "A global social network that allows users to share their feelings with others by sharing heartrate, breathing rate, hormone levels and more. A peripheral headset can stimulate the same feelings so you can literally \"feel\" what someone else is feeling. | This is real, it already exists. | This is not real.",
      "definition": "This is not real."
    },
    {
      "term": "What's an image of the future? (according to professional futurists' terminology) | An illustration (photo or drawing) of what the future might look like | A representation in popular media (tv, film, books, comics, political speeches) of what the future might be like | A mental picture (like a movie or virtual reality in your mind) of what the future might be like",
      "definition": "A representation in popular media (tv, film, books, comics, political speeches) of what the future might be like"
    },
    {
      "term": "What can we learn from images of the future? (multiple correct answers) | What some common hopes for the future are | What some common anxieties for the future are | On the whole, whether a society is feeling more optimistic or more pessimistic about a particular future topic | Whether a particular future depicted by the image is more or less likely to happen",
      "definition": "What some common hopes for the future are | What some common anxieties for the future are | On the whole, whether a society is feeling more optimistic or more pessimistic about a particular future topic"
    },
    {
      "term": "Who wrote the book \"The Image of the Future\" and first suggested the value of analyzing images of the future? | Bob Johansen | Marina Gorbis | Rebecca Solnit | Fred Polak",
      "definition": "Fred Polak"
    },
    {
      "term": "In his book \"Images of the Future\", the author writes: \"It was but a small step for man from realizing that he had a future to wanting to know what that future would bring.\" The author identifies some of the earliest known images of the future, ones that go much further back in human culture than the science fiction films and tv series and the modern dystopians novels often named as examples. Which of these are considered early \"images of the future?\" (multiple correct answers) | The City of God by St. Augustine | Plato's Politeia, also known as The Republic | Thomas More's Utopia",
      "definition": "The City of God by St. Augustine | Plato's Politeia, also known as The Republic | Thomas More's Utopia"
    },
    {
      "term": "Think back to the many different images of the future you have personally consumed via television, movies, comics, novels, religious texts, political speeches, advertisements and more over your life. Which ones would you say have made the biggest impression on YOU personally? Which anxieties about the future, or which hopes for the future, did these images help cultivate and nurture in you? Take some time to list any images of the future that leap to mind, and then make some notes or bullet points about which hopes and worries resonated with you most. This exercise can help you understand what pre-existing feelings YOU bring to your futures work, and how YOU might want to help ease society's anxieties or spark society's hope for the future.This final question is a personal reflection. There are no right or wrong answers; whatever you share will automatically be graded as correct. Use this question to reflect on what you learned this week and to make a more personal connection with the material. | ",
      "definition": "e many different images of the future you have personally consumed via television, movies, comics, novels, religious texts, political speeches, advertisements "
    },
    {
      "term": "What's an artifact from the future? | An artist's rendering of an everyday object, physical or digital, that might exist in the future. | A short story that includes many vivid details about what the future might be like. | A scientific piece of evidence that strongly suggests how the future is most likely to turn out.",
      "definition": "An artist's rendering of an everyday object, physical or digital, that might exist in the future."
    },
    {
      "term": "What's the relationship between an artifact from the future and a future forecast? | A forecast predicts what the future will most probably be like. An artifact is a piece of evidence that supports the prediction. | A forecast describes, generally, the world we might live in someday and how it could be different from today. An artifact is a new kind of object that might exist in that future. | A forecast is a description of a possible future and how it's different from today. An artifact is a specific, concrete, measurable outcome that can tell us: \"Has this forecast come true yet, or not?\"",
      "definition": "A forecast describes, generally, the world we might live in someday and how it could be different from today. An artifact is a new kind of object that might exist in that future."
    },
    {
      "term": "What are some of the benefits of creating artifacts from the future? | It makes the future more \"real\" and \"tangible\" to our imagination. | It can spark thought and conversations about the future, especially for people who don't ordinarily think about the far future. | It can blur the line between \"today\" and \"tomorrow\" in a way that provokes strong emotional reactions.",
      "definition": "It makes the future more \"real\" and \"tangible\" to our imagination. | It can spark thought and conversations about the future, especially for people who don't ordinarily think about the far future. | It can blur the line between \"today\" and \"tomorrow\" in a way that provokes strong emotional reactions."
    },
    {
      "term": "This week you read a Climate Action Report from the Institute for the Future. It includes signals, drivers of change, and scenarios related to how humanity might work together to prevent and adapt to climate change in the future.The report also identifies 8 \"zones of opportunity\" for climate action. If YOU want to take action over the next decade, these 8 zones offer potentially the biggest impact. This quiz is about those 8 opportunity zones. If you need to refresh your memory: Page 5 of the reading describes the zones and Page 6 includes signals of change and scenarios from the 8 zones.This quiz is a personal reflection. There are no right or wrong answers. Your answers will automatically be marked \"correct\", whatever you say or choose. Use this quiz as an opportunity to reflect on what you've read and to make a more personal connection with the material. When you think of the 8 zones of opportunity for climate action, which ONE do you feel YOU would most likely take action in, sometime during the next decade? Pick the one you see the strongest fit with your values, interests, skills, resources and abilities. (And if you personally do not believe you will take any climate action in the next decade, feel free to choose that response.) | Activated Youth. | Women as Climate Leaders | Organizing without Organizations | Climate as Growth Space | Algorithmic Action | Media for Good | Immersive News | Watchful Eyes | I do not believe that I personally will take any action to prevent or help others adapt to climate change in the future.",
      "definition": "I do not believe that I personally will take any action to prevent or help others adapt to climate change in the future."
    },
    {
      "term": "What's one way YOU personally can see yourself taking climate action, in the zone of opportunity you chose, in the next 10 years? If you were to spend, for example, 100 hours helping prevent or adapt to climate change in the future - what would you be doing? (A few sentences of reflection are fine! And if you cannot imagine yourself doing anything to prevent or help others adapt to climate change in the future, please say so and what, if anything, might change that decision.)Again - this quiz is a personal reflection. There are no right or wrong answers. Your answers will automatically be marked \"correct\", whatever you say or choose. Use this quiz as an opportunity to reflect on what you've read and to make a more personal connection with the material.",
      "definition": "ne way YOU personally can see yourself"
    },
    {
      "term": "This week, you learned about a number of projects designed to help local communities think about the future, together. These projects tackled tough issues like conflict resolution in war-torn regions and climate adaptation in areas with widespread food insecurity.One of the key principles in theseparticipatory futures projects is that people who are directly affected by problems today should be empowered to create future solutions to them.This week's quiz is a personal reflection. There are no right or wrong answers. Whatever you submit will be graded \"correct\", so use this quiz as an opportunity to make a more personal connection with the material.If YOU were able to create a futures thinking event or workshop to support a specific community, which community would you bring together, and what problem(s) or challenge(s) would you ask this community to think about using futures methods? For example: I (your instructor, Jane McGonigal) would like to bring together the residents of the California town I live in to \"future\" the topic of wildfires, which are a growing danger to our community, and which many people are not willing to address yet through changes today. I would want to help \"wake up\" my community to this risk and brainstorm creatively what different futures would look like depending on actions we take over the next ten years together.What about you? | ",
      "definition": ", you learned about a number of projects designed to help local communitie"
    }
  ]
}
