{
  "quizSrc": [
    {
      "term": "1. According to a survey by the National Campaign to Prevent Teen and Unplanned Pregnancy, one in five teenagers have engaged in sexting. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "1. Computer hardware manufacturers are sometimes faced with dealing with raw material suppliers who funnel money to groups engaged in armed conflict, including some who commit crimes and human rights abuses. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "1. Copyright law protects authored works such as art, books, and film. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "1. Dorothea Perry and Robert Gross were put on probation andsubsequently fired for job-performance issues by their employer,Collegis, shortly after reporting that they found child pornography onthe computer of a professor at New York Law School.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "1. Pretexting involves the use of false pretenses to gain access to the personal records of individuals. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "1. Societe Generale, France's second largest banking establishment, hadlong had a reputation for having poor internal controls. It is nowonder that a relatively inexperienced trader was able to takeadvantage of the bank's system of weak internal controls to exceed histrading limit and cause the bank to lose more than €4.9 billion.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "1. The use of information technology in business requires balancing the needs of those who use the information that is collected against the rights and desires of the people whose information is being used. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "1. The Western Cape province initiated the Khanya Project to address the shortage of teachers in the region, to bridge the digital divide by providing access to computer technology to all schoolchildren and educators, and to prepare the Western Cape for the new \"knowledge economy.\" a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "1. There have been many delays in the development of the new Boeing 787 Dreamliner including problems with the software that controls and monitors the aircraft's braking system. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "1. Twitter text-based posts must be 140 characters or less. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "2. Although the necessity of security is obvious, it must often bebalanced against other business needs and issues. As a result, mostorganizations spend 5 percent or less of their overall IT budget oninformation security.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "2. Formulas, inventions, and processes are not considered forms of intellectual property. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "2. In some states, sexting can result in felony charges and first-time offenders can be registered as sex offenders. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "2. One of the key factors affecting the growth of e-commerce is the lack of Internet users' confidence in online privacy. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "2. Professionals require advanced training and experience, they mustexercise discretion and judgment in the course of their work; and theirwork can be easily standardized.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "2. Software manufacturers face economic, ethical, and organizational challenges associated with improving the quality of their software. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "2. Temporary workers, contractors, consulting firms, H-1B workers, and outsourced offshore workers are examples of nontraditional workers. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "2. The program manager of Khanya feels that the greatest contribution of the Khanya project was that it proved that ICT can be implemented successfully on a large scale in Africa. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "2. The stock price of Hewlett-Packard dropped dramatically as a result of a scandal involving the leaking of information about HP's long term strategy to the news media. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "2. Twitter users can restrict delivery of their messages, control whose tweets they receive, when they receive them, and on what devices. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "3. A software feature is any error that, if not removed, could cause a software system to fail to meet its users' needs. a. True b. False",
      "definition": "b. False        a. True          "
    },
    {
      "term": "3. According to the 2008 CSI Computer Crime and Security Survey, virusrelated incidents were the most common security incident.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "3. Although Twitter is a very rapidly growing service, its founders have been able to manage the rapid growth with few start-up problems or on-going service issues. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "3. Many professional roles carry special rights and responsibilities.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "3. Morality refers to social conventions about right and wrong that are so widely shared that they become the basis for an established consensus. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "3. Protecting computer software has proven to be difficult because it is has not been well categorized under the law. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "3. The number of declared undergraduate computer science majors at doctoral-granting computer science departments has declined steadily for the past decade — 1999 to 2009. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "3. The right to personal privacy is explicitly spelled out in the Constitution. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "3. The Second Amendment to the U.S. Constitution was adopted to guarantee the right to freedom of expression. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "3. The standard of living is about the same among groups within a single country although it varies greatly from country to country. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "4. A copyright is the exclusive right to distribute, display, perform, or reproduce an original work in copies or to prepare derivative works based on the work. The author may not grant this exclusive right to others. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "4. A zero-day attack is an attack on an information system that takesadvantage of a particular system vulnerability before the securitycommunity or system developer knows about the vulnerability or has beenable to repair it. Such attacks are quite common and occur nearlyeveryday.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "4. During the 2009 Iranian elections, Twitter emerged as a highly reliable and accurate news source. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "4. From a legal perspective, IT workers are not recognized asprofessionals because they are not licensed by the state or federalgovernment.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "4. IT firms and organizations that use IT products and services are concerned about a shortfall in the number of U.S. workers to fill positions in networking and data communications analysis. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "4. Most countries have continually been able to produce more goods and services over time—not through a proportional increase in input but by making production more efficient. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "4. Over the years, a number of federal, state, and local laws have been found unconstitutional because they violated one of the tenets of the First Amendment. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "4. The impact of a software defect is catastrophic and leads to death or serious injury. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "4. The right to privacy is closely associated with the Second Amendment to the Constitution. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "4. There is near universal opposition to the practice of illegally making copies of software or enabling others to access software to which they are not entitled. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "5. An individual who exhibits few vices and many virtues is said to be a person of high integrity. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "5. Contingent work is a job situation in which an individual does not have an explicit or implicit contract for long-term employment. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "5. Copyright law guarantees developers the rights to their works for a certain amount of time. Over the years, the term of copyright has been extended several times from its original limit of 17 1/2 years. a. True b. False",
      "definition": "b. False        a. True   "
    },
    {
      "term": "5. During the 2009 Iranian elections, there were rumors that the Iranian government attempted to block Twitter traffic and used Twitter to communicate its own message. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "5. Roger Clark, director of the ACLU, first coined the term information privacy which is the combination of communications privacy and data privacy. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "5. Software defect is the degree to which a software product meets the needs of its users. a. True b. False",
      "definition": "b. False        a. True      a. True     "
    },
    {
      "term": "5. The decade of 1990-2000 demonstrated the greatest rate of increase in worker productivity in the history of the United States. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "5. The Supreme Court has ruled that the First Amendment does not protect the right of individuals to speak anonymously. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "5. There has been a lowering of expectations for the clients ofprofessional service organizations. They are less aware of what theyneed from service providers and less willing to look outside their ownorganization to get the best possible services.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "5. Unlike a computer worm, which requires users to spread infectedfiles to other users, a virus is a harmful program that resides in theactive memory of the computer and duplicates itself. A virus canpropagate without human intervention.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "6. Although end users often get the blame when it comes to usingillegal copies of commercial software, software piracy in a corporatesetting is sometimes directly traceable to IT staff members.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "6. Art, architecture, graphics, and sculptures cannot be copyrighted. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "6. Contingent workers must be treated like official employees of the company and are eligible for vacation, sick days, and retirement benefits. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "6. Ethics defines one's personal beliefs about right and wrong. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "6. It is harder to quantify the benefits of today's IT investments on worker productivity than during the early days of IT in the 1960s. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "6. Obscene speech is not protected by the First Amendment. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "6. Social networking Web sites are used strictly to communicate with your friends, family members, and colleagues. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "6. The cost to repair the worldwide damage done by a computer worm hasexceeded $1 billion on more than one occasion.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "6. The Gramm-Leach-Bliley Act repealed the prohibition of any one institution from offering investment, commercial banking, and insurance services. It also included three key rules that affect personal privacy: financial privacy rule, safeguards rule, and pretexting rule. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "6. The various products created during the software development process such as a statement of requirements, flowcharts, and user documentation are called developments. a. True b. False",
      "definition": "b. False          a. True b. False    "
    },
    {
      "term": "7. A distributed denial-of- service attack keeps the target so busyresponding to a stream of automated requests that legitimate userscannot access the target.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "7. According to one study, even experienced software developers unknowingly inject an average of one design or implementation defect for every 15 - 20 lines of code. a. True b. False",
      "definition": "b. False   7. According to one study, even experienced software developers unknowingly inject an average of one design or implementation defect for every 15 - 20 lines of code.                    "
    },
    {
      "term": "7. Currently, there is a fairly narrow range of interests represented in social networking Web sites. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "7. HIPPA requires healthcare organizations to employ standardized electronic transactions, codes, and identifiers to enable them to fully digitize medical records thus making it possible to exchange medical records over the Internet. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "7. In a coemployment relationship, two employers have actual or potential legal rights and duties with respect to the same employee. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "7. Mason v. California is the 1973 Supreme Court case that established a test to determine if material is obscene. a. True b. False",
      "definition": "b. False              a. True        a. True "
    },
    {
      "term": "7. Software, video games, multimedia works, and Web pages can all be copyrighted. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "7. The Business Software Alliance is a trade group that represents theworld's largest software and hardware manufacturers and whose goal isto stop unauthorized software produced by its members. Each year itreceives over 25,000 piracy reports.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "7. The United States has one of the lowest software piracy rates in the world, along with Luxembourg and New Zealand. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "7. There is a simple and direct relationship between investment in IT and U.S. productivity. a. True b. False",
      "definition": "b. False          "
    },
    {
      "term": "8. Making either an oral or a written statement of alleged fact that is false and harms another is called slander. a. True b. False",
      "definition": "b. False      a. True  a. True     "
    },
    {
      "term": "8. Rootkit is a set of programs that enables its users to gainadministrator level access to a computer without the end user's consentor knowledge. Fortunately, rootkits are fairly easy to discover andremove from infected computers.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "8. The Children's Online Privacy Protection Act requires a Web site that caters to children to offer comprehensive privacy policies and to receive parental consent before collecting any personal information from children under 18 years of age. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "8. The cost of \"getting legal\" by acquiring the correct number ofsoftware licenses is many times more expensive than the cost ofcriminal or civil penalties to a corporation or the people involved insoftware piracy.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "8. The fair use doctrine allows portions of patented materials to be used with permission under certain circumstances. a. True b. False",
      "definition": "b. False          "
    },
    {
      "term": "8. The Microsoft Vista operating system took over seven years to develop and consists of more than 100 million lines of code. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "8. The risks associated with inappropriate behavior have decreased, both in their likelihood and in their potential negative impact. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "8. There are a few hundred social networking Web sites worldwide. a. True b. False",
      "definition": "b. False        a. True    "
    },
    {
      "term": "8. There is seldom much lag time between the application of innovative IT solutions and the capture of significant productivity gains. a. True b. False",
      "definition": "b. False    a. True              a. True b. False   "
    },
    {
      "term": "8. When an organization decides to use contingent workers for a project, it is making a trade-off between completing a single project quickly and cheaply versus developing people within its own organization. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "9. A stakeholder is someone who stands to gain or lose, depending on how a situation is resolved. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "9. According to the 2009 Pew Internet &amp; American Life Project, about 55% of U.S. Internet users age 18 and older have a profile on an online social networking Web site. a. True b. False",
      "definition": "b. False      "
    },
    {
      "term": "9. If a particular project requires only temporary help, and the workers will not be needed for future projects, the use of contingent workers is a poor approach. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "9. Investment in IT is by far the single most important driver of worker productivity. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "9. The Communications Decency Act was aimed at protecting children from revealing personal information about themselves or their parents. a. True b. False",
      "definition": "b. False               a. True    "
    },
    {
      "term": "9. The cost of creating an e-mail campaign for a product or a servicecan easily exceed the cost of a direct-mail campaign. Such an e-mailcampaign also typically takes longer to develop.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "9. The design of new software code and computer hardware cannot betreated as a trade secret.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "9. The extreme pressure that software companies feel to reduce the time to market for their products has little impact on the quality of the software. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "9. Title III of the Omnibus Crime Control and Safe Streets Act is also know as the Wiretap Act and authorizes wiretapping and electronic eavesdropping without the requirement of first obtaining a warrant from a judge. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "9. Two software manufacturers could conceivably develop separate programs that perform the same functions in a nearly identical manner without infringing the other's copyright. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "10. Companies that are viewed as harmful to their community may find that negative publicity reduces sales, impedes relationships with some business partners, and attracts unwanted government attention. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "10. In Reno v. ACLU, the Supreme Court ruled that the same free-speech protections apply to communication over the Internet as exists for print communication. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "10. It is difficult to quantify how much the use of IT has contributed to worker productivity. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "10. It is fairly simple to prevent contingent workers from passing on corporate processes and strategies to subsequent employers. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "10. Phishing frequently leads consumers to counterfeit Web sitesdesigned to trick them into initiating a denial-of- service attack.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "10. Social networking Web sites are used almost exclusively for nonbusiness purposes with almost no business applications. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "10. The accurate, thorough, and timely processing of business transactions is a key requirement for business information systems. A software defect in such a system can be devastating, resulting in lost customers and reduced revenue. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "10. The Foreign Intelligence Surveillance Act allows the surveillance and collection of information about foreign governments or agents of foreign governments or organizations, only if a warrant is obtained from the FISA court within 72 hours after surveillance begins. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "10. The PRO-IP Act of 2008 increased trademark and copyright enforcement, and substantially increased penalties for infringement. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "10. Whistle-blowing is an effort by an organization's marketing peopleto call attention to a new product or new feature in an existingproduct.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "11. A hacktivist is a person who wishes to destroy the infrastructurecomponents of financial institutions, utilities, and emergency responseunits.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "11. A pen register is a device that records the originating number of incoming calls for a particular phone number. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "11. Depending on how closely workers are supervised and how the job is structured, contingent workers may be viewed as permanent employees by the Internal Revenue Service, the Labor Department, or a state's workers' compensation and employment agencies. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "11. Multinational and global organizations must not present a consistent face to their shareholders, customers, and suppliers but instead must operate with a different value system in each country they do business in. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "11. Social network advertising has at least two advantages over more traditional advertising media such as radio, TV, and newspapers. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "11. Telework, or telecommuting, focuses on enabling workers to work from home. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "11. The Child Online Protection Act was an attempt to protect children from online pornography while preserving the rights of adults. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "11. The decision support system is used to improve the decision making in a variety of industries. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "11. The relationship between IT workers and clients is usuallydocumented in a contract that specifies who does what, when the workbegins, how long it will take, and how much the client will pay. However, decision making is solely the responsibility of the IT worker.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "11. The World Trade Organization developed the Agreement on Trade-Related Aspects of Intellectual Property Rights to establish the maximum penalties to be meted out for patent and copyright infringement. a. True b. False",
      "definition": "b. False          "
    },
    {
      "term": "12. A defect in process control software can lead to decreased product quality, increased waste and costs, or even unsafe operating conditions for employees. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "12. After a temporary injunction as well as numerous hearings and appeals, the Supreme Court ruled that the Child Online Protection Act was constitutional. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "12. Crackers break into other people's networks and systems to causeharm—defacing Web pages, crashing computers, and spreading harmfulprograms or hateful messages.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "12. Employees may suppress their tendency to act in a manner that seems ethical to them and instead act in a manner that will protect them against anticipated punishment. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "12. If workers sign an agreement indicating that they are contractors and not employees, this is the deciding factor as to whether or not they are an employee and not the degree of control the company exercises over the employees. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "12. Some work roles and some individuals are not well suited for telework opportunities. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "12. The Electronic Communications Privacy Act of 1986 required the communications industry to build tools into its products that federal investigators could use—after obtaining a court order—to eavesdrop on conversations and intercept electronic communications. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "12. The WIPO Copyright Treaty of 1996 eliminated many of the original copyright protections for electronic media. a. True b. False",
      "definition": "b. False           a. True        "
    },
    {
      "term": "12. Theft is the crime of obtaining goods, services, or propertythrough deception or trickery.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "12. There are a number of ethical issues associated with using social network advertising to send messages to an individual's network of friends. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "13. A potential disadvantage of telework is that some teleworkers may suffer from isolation and may not really feel \"part of the team.\" a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "13. Coca-Cola has been able to create a highly popular Facebook fan page to promote its image and brands. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "13. Fraud is the misstatement or incomplete statement of a materialfact.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "13. Fraud often involves some form of collusion, or cooperation,between an employee and an outsider.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "13. The Digital Millennium Copyright Act made it an offense to circumvent a technical protection of copyrighted material. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "13. The liability of manufacturers, sellers, lessors, and others for injuries caused by defective products is commonly referred to as negligence. a. True b. False",
      "definition": "b. False             a. True b. False      "
    },
    {
      "term": "13. The United States Supreme Court has established that an employer cannot be held responsible for the acts of its employees if the employees act in a manner contrary to corporate policy and their employer's directions. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "13. U.S. employers need not pay an H-1B worker roughly the same rate as U.S. citizens performing the same work. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "13. Under the PATRIOT Act, the FBI can issue a National Security Letter to compel banks, Internet service providers, and credit reporting companies to turn over information about their customers without a court order but only if the FBI believed the individual to be a foreign spy. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "13. Web dynamic filtering uses keywords or phrases to block access to Web sites. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "14. A potential disadvantage of telework is that can create potential security issues. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "14. A sunset provision extends a law beyond a specific date unless further legislative action is taken to repeal the law. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "14. A trademark permits its owner to exclude the public from making, using, or selling a protected invention, and allows for legal action against violators. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "14. After a worker's H-1B visa expires, the foreign worker must remain outside the United States for six years before another H-1B will be approved. a. True b. False",
      "definition": "b. False         a. True  "
    },
    {
      "term": "14. Bribery involves providing money, property, or favors to someone inbusiness or government to obtain a business advantage.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "14. Contributory negligence means that the defendant is held responsible for injuring another person, regardless of negligence or intent. a. True b. False",
      "definition": "b. False            a. True b. False      "
    },
    {
      "term": "14. Employees who are unwillingly exposed to pornography or other objectionable material while using their work computer would have a strong case for sexual harassment. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "14. Industrial espionage and competitive intelligence are the samething.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "14. The Department of Justice has established sentencing guidelines that suggest stiffer penalties for convicted executives if their companies have ethics programs. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "14. The goal of viral marketing is to spread rumors and innuendo about a rival's product that will hurt its image. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "15. A rapid increase in the appointment of corporate ethics officers typically follows the revelation of a major business scandal. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "15. In the ICRA rating system, Web authors fill out an online questionnaire to describe the content of their site. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "15. More than 1 out of 5 hiring managers use social networking Web sites as a source of information about candidates. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "15. Nearly 40% of H-1B temporary workers are employed as computer programmers. a. True b. False",
      "definition": "a. True"
    },
    { "term": "15. Software cannot be patented. a. True b. False", "definition": "b. False" },
    {
      "term": "15. Strict liability is the failure to do what a reasonable person would do, or doing something that a reasonable person would not do. a. True b. False",
      "definition": "b. False             "
    },
    {
      "term": "15. The European Union Data Protection Directive requires member countries to ensure that data transferred is protected. It has no impact on non-European Union countries. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "15. The key distinguishing factor between a gift and a bribe is that nogift should be hidden.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "15. The use of smart cards which contain a memory chip that is updatedwith encrypted data every time the card is used, is much more popularin the United States than Europe.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "15. There really is no such thing as a digital divide. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "16. A few of the larger software companies have cross-licensing agreements in which each party agrees not to sue the other over trademark infringements. a. True b. False",
      "definition": "b. False    a. True   "
    },
    {
      "term": "16. A warranty assures buyers or lessees that a product meets certain standards of quality. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "16. An organization's mission statement highlights its key ethical issues and identifies the overarching values and principles that are important to the organization and its decision making a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "16. Each year the U.S. Congress sets a federal cap on the number of H-1B visas to be granted. Since 2004 the cap has been set at 75,000. a. True b. False",
      "definition": "b. False        "
    },
    {
      "term": "16. Of those hiring managers who use social networking Web sites to screen candidates, over one-third have found information that made them drop a candidate from consideration. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "16. Studies have shown that around 10 percent of all job applicantsseriously misrepresent their backgrounds on their resumes.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "16. The Children's Internet Protection Act required federally financed schools and libraries to use some form of technological protection to block computer access to obscene material, pornography, and anything else considered harmful to minors. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "16. The U.S. approach to data privacy involves strict government regulation while the European approach relies on self-regulation. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "16. The USA Patriot Act defines cyberterrorism as hacking attempts thatcause $5,000 in aggregate damage in one year, damage to medicalequipment, or injury to any person. Because the $5,000 threshold iseasy to exceed, many young people who have been involved in what theyconsider to be \"minor computer pranks\" have found that they meet thecriteria to be tried as cyberterrorists.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "16. While over 812 out of every 1,000 people in the United States own a computer, that figure drops to less than 20 out of 1,000 in the Middle East and Africa. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "17. A patent demon is a firm that acquires patents with no intention of manufacturing anything, instead licensing the patents to others. a. True b. False",
      "definition": "b. False    a. True           "
    },
    {
      "term": "17. Apple was the highest rated U.S.-based, publicly held IT company by Business Ethics magazine based on its performance between 2000 and 2007. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "17. Employees cannot legally reject a job applicant based on the contents of the individual's social networking profile. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "17. H-1B workers are highly educated and need little assistance to work effectively in U.S. organizations. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "17. If the product fails to meet the terms of its warranty, the buyer or lessee can sue for contributory negligence. a. True b. False",
      "definition": "b. False   b. False   a. True        a. True   a. True    "
    },
    {
      "term": "17. Individuals committed to trustworthy computing take a pledge to notsend viruses and worms and to refrain from spamming others.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "17. IT workers cannot be held responsible for creating an environmentthat supports the ethical behavior of IT users.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "17. The Children's Internet Protection Act was eventually found to be unconstitutional. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "17. The digital divide exists not only between more and less developed countries but also within countries—among age groups, economic classes, and people who live in cities versus those in rural areas. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "17. The Freedom of Information Act prohibits the government from concealing the existence of any personal data record-keeping systems. a. True b. False",
      "definition": "b. False     a. True b. False             b. False   "
    },
    {
      "term": "18. A Freedom of Information Act request prevents disclosure of records if it would invade someone's privacy. A balancing test must be applied to evaluate whether the privacy interests at stake are outweighed by competing public interests. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "18. A trademark is business information that represents something of economic value, has required effort or cost to develop, has some degree of uniqueness or novelty, is generally unknown to the public, and is kept confidential. a. True b. False",
      "definition": "b. False     a. True          "
    },
    {
      "term": "18. Anonymous expression is a relatively new phenomena that came shortly after the arrival of the Internet allowed people to express their opinions without revealing their identity. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "18. Breach of warranty occurs when a seller or lessee either misrepresents the quality of a product or conceals a defect in it. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "18. IT workers have a duty to understand a user's needs andcapabilities and to deliver products and services that best meet thoseneeds without regard for the costs and time involved.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "18. Some social shopping Web sites earn money by sharing with retailers data about their members' likes and dislikes. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "18. The Computer Fraud and Abuse Act addresses identity theft.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "18. The digital divide does not exist in the United States. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "18. The goal of the Sarbanes-Oxley Act was to renew investor's trust in corporate executives and their firm's financial reports following numerous financial scandals in the early 2000's. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "18. There is no evidence that the hiring of H-1B workers has affected the salaries of U.S. IT workers. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "19. A software development methodology is a standard, proven work process that enables systems analysts, programmers, project managers, and others to make controlled and orderly progress in developing high-quality software. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "19. Cyberbullying is most common among males and among 18- to 20-year olds. a. True b. False",
      "definition": "b. False      a. True     a. True    a. True          a. True         a. True       "
    },
    {
      "term": "19. Incidents of identity theft exceeded 4% of the overall U.S. adult population in 2008 resulting in losses of some $48 billion. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "19. Lawrence Kohlberg found that many factors stimulate a person's moral development, but one of the most crucial is monetary reward for good behavior. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "19. Most codes of ethics created by professional organizations have twomain parts: one part outlines what the professional organizationaspires to become, and the other part lists rules and principles bywhich members of the organization are expected to abide.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "19. One of the early Supreme Court rulings that addressed anonymity as an aspect of the Bill of Rights was NAACP v. Alabama in which the court ruled that the NAACP did not have to turn its membership list over to the state of Alabama. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "19. One of the goals of the Education Rate (E-Rate) program is to help schools and churches to obtain access to state-of-the-art services and technologies at discounted rates. a. True b. False",
      "definition": "b. False           a. True      b. False  a. True      "
    },
    {
      "term": "19. Outsourcing is a short-term business arrangement in which a company contracts for services with an overseas organization that has expertise in providing a specific function. a. True b. False",
      "definition": "b. False            "
    },
    {
      "term": "19. The Economic Espionage Act imposes penalties of up to $10 million and 15 years in prison for the theft of trade secrets. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "19. The security of any system or network is a combination oftechnology, policy, and people and requires a surprisingly narrow rangeof activities to be effective.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "20. A completed risk assessment identifies the most dangerous threatsto a company and helps focus security efforts on the areas of highestpayoff.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "20. Adherence to a code of ethics reminds professionals of theresponsibilities and duties that they may be tempted to compromise tomeet the pressures of day-to- day business.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "20. Because organizations can risk losing trade secrets when key employees leave, they often try to prohibit employees from revealing secrets by adding nondisclosure clauses to employment contracts. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "20. Cyberstalking is the adult version of cyberbullying. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "20. India is widely acknowledged as the best source of programming skills outside Europe and North America. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "20. Quality assurance refers to methods within the development cycle designed to guarantee reliable operation of the product. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "20. The cost of a data breach can be quite expensive, by some estimates nearly $500 for each record lost. Nearly half the cost is due to lost business opportunity associated with customers who've been lost due to the incident. a. True b. False",
      "definition": "b. False     "
    },
    {
      "term": "20. The E-Rate program is one example of a government program that has been well run and free of abuse, fraud, and scandal. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "20. The IP address can be used to identify the sender of an ordinary e-mail or online posting. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "20. Well over half of all organizations include ethical conduct as part of an employee's performance appraisal. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "21. A security policy details exactly what needs to be done and how itmust be accomplished.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "21. An individual's manager has very little impact on his/her ethical behavior. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "21. Copyright infringement is the act of stealing someone's ideas or words and passing them off as one's own. a. True b. False",
      "definition": "b. False     a. True   a. True     "
    },
    {
      "term": "21. Facebook spent two years purging potential problem members from its site, including over 100,000 registered sex offenders. a. True b. False",
      "definition": "b. False       a. True   "
    },
    {
      "term": "21. It is estimated that more than 1 billion personal computer will be connected to the Internet by 2010 leaving some 5.5 billion people unconnected. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "21. Once a John Doe lawsuit is filed and the court grants permission, the plaintiff can serve subpoenas on any third party—such as an Internet service provider or a Web site hosting firm—that may have information about the true identity of the defendant. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "21. Participation in an IT professional organization does little tohelp IT workers stay on top of the many new developments in theirfield.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "21. The cost advantage of offshore outsourcing to India is continuing to increase. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "21. There is no federal law requiring that organizations reveal a data breach, however, more than half the states have implemented such legislation. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "21. White-box testing involves viewing the software unit as a device that has expected input and output behaviors but whose internal workings are unknown. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "22. Anonymity on the Internet is guaranteed. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "22. Companies can use the Statement on Auditing Standards No. 70, Service Organizations to assess if company data is protected in an outsourcing arrangement. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "22. Mobile phones have many distinct advantages that lead industry observers to think that it will be the cell phone that ultimately bridges the digital divide rather than the personal computer. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "22. Most of us have developed a decision-making process we use almost automatically, without thinking about the steps we go through. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "22. Plagiarism software checks for matching text in different documents as a means of identifying potential plagiarism. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "22. Spyware frequently employs sophisticated methods to avoid detection by popular software packages that are specifically designed to combat it. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "22. The Association of Information Technology Professionals (AITP) wasfounded in 1947 and has 24,000 student members and 68,000 professionalmembers in more than 100 countries.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "22. There are two forms of dynamic testing—black-box testing and white-box testing. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "22. Under no conditions can a Web site remove user submitted content as this would be a violation of their right to freedom of speech. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "22. Whenever possible, automated system rules should mirror anorganization's written policies.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "23. A visitor to a virtual world represents him- or herself through an avatar. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "23. A whistle-blower must be an employee of the company that is misbehaving. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "23. Licensing applies to both people and products, and indicates that aprofessional possesses a particular set of skills, knowledge, orabilities.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "23. Reverse engineering can only be applied to computer hardware, not computer software. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "23. The development and use of new medical technology, such as new diagnostic procedures and treatments has increased spending and \"accounts for one-half to two-thirds of the increase in healthcare spending in excess of general inflation.\" a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "23. The development of a good problem statement is the most critical step in the decision-making process. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "23. The New York State Court in Pre-Paid v. Sturtz et al. set a legal precedent that refined the criteria that the courts apply when deciding whether or not to approve subpoenas requesting the identity of anonymous Web posters. a. True b. False",
      "definition": "b. False    a. True        a. True "
    },
    {
      "term": "23. The use of cookies and tracking software is controversial because companies can collect information about consumers without their explicit permission. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "23. User acceptance testing is a process improvement approach that defines the essential elements of effective processes. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "23. While it is important that employees should be well aware of anorganization's security policies, this information should not be sharedwith part-time workers and contractors.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "24. Although the healthcare industry depends on highly sophisticated technology for diagnostics and treatment, it has been slow to implement IT solutions to improve productivity and efficiency. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "24. Certifications that are tied to a vendor's product are relevant forjob roles with very specific requirements or certain aspects of broaderroles. Sometimes, however, vendor certifications are too focused ontechnical details of the vendor's technology and do not address moregeneral concepts.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "24. Cookies allow marketers to collect click-stream data—information gathered by monitoring a consumer's online activity. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "24. In some virtual worlds, an avatar can earn virtual world money by performing some task in the virtual world and convert their virtual world money into real world cash. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "24. In the United States, speech that is annoying, critical, demeaning, or offensive is not protected under the First Amendment. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "24. Installation of a corporate firewall is the most common securityprecaution taken by business. Once a good firewall is in place, theorganization is safe from future attacks.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "24. Open source code is any program whose source code is made available for use or modification, as users or other developers see fit. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "24. Problem stakeholders who stand to lose or gain from a situation should be kept out of the decision making process as they will simply introduce their personal biases. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "24. The Capability Maturity Model Integration-Development process improvement approach defines six levels of software development maturity. a. True b. False",
      "definition": "b. False       "
    },
    {
      "term": "24. Violators of the False Claims Act are liable for four times the dollar amount for which the government was defrauded. a. True b. False",
      "definition": "b. False              "
    },
    {
      "term": "25. A qui tam plaintiff can receive between 15 and 30 percent of the total recovery from the defendant, depending on how helpful the person was to the success of the case. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "25. An electronic health record is a summary of health information generated by each physician encounter in any healthcare setting. a. True b. False",
      "definition": "b. False          a. True       a. True      "
    },
    {
      "term": "25. Antivirus software works to prevent an attack by blocking viruses,malformed packets, and other threats from getting into the protectednetwork.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "25. As the software maturity level increases, the organization improves its ability to deliver good software on time and on budget. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "25. Many Internet service providers reserve the right to remove content that, in their judgment, does not meet their standards documented in some form of user agreement or guidelines. However, the pulling of such content violates the subscriber's First Amendment rights. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "25. Online marketers use personalization software to optimize the number, frequency, and mixture of their ad placements, and to evaluate how visitors react to new ads. a. True b. False",
      "definition": "b. False                 a. True          a. True     b. False    a. True                     b. False                  "
    },
    {
      "term": "25. Only a small amount of open source code is available for use. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "25. Some virtual world activities can cause real life anguish for the human owners of the avatars involved but may or may not rise to the level of real life crimes. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "25. The requirements for certification generally require that theindividual has the prerequisite education and experience, sits for andpasses an exam, and commits to and abides by a code of ethicsestablished by the organization providing the certification.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "25. The utilitarian approach to ethical decision making treats everyone the same and shows no favoritism or discrimination. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "26. Although they may implement a speech code, public schools and universities are legally considered agents of the government and therefore must follow the First Amendment's prohibition against speech restrictions based on content or viewpoint. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "26. Competitive intelligence involves the gathering and analysis of the trade secrets of your competitors. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "26. Organizations must define employee roles so that a single employeecan input as well as approve purchase orders. Such action is needed toprovide adequate redundancy in the event of a pandemic or other form ofdisaster.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "26. Some virtual activities are clear violations of real world laws. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "26. The comprehensive use of Electronic Health Records has spread to well over 50% of all U.S. hospitals and physicians. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "26. The lack of agreement on the core body of knowledge for various ITroles is a primary reason for the lack of international or nationallicensing programs for IT professions.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "26. The safe operation of many safety-critical systems relies on the flawless performance of software. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "26. The virtue ethics approach to decision making states that you should choose the action or policy that has the best overall consequences for all people who are directly or indirectly affected. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "26. There is virtually no way to limit the deposit of cookies on your hard drive. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "26. To be classified as a truly green PC, the PC must meet other criteria than simply use less electricity to run than the standard computer. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "27. A breach of duty of care addresses only the failure to act as a reasonable person would act. It does not address the failure to act when there is a duty to do so.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "27. A number of organizations are exploring the use of virtual online worlds to improve teaching, learning, and creative expression. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "27. Although quick to invest in IT, the healthcare industry has been a laggard in adopting mobile and wireless technology. a. True b. False",
      "definition": "b. False    a. True   a. True         a. True    "
    },
    {
      "term": "27. Demographic filtering augments click-stream data and user-supplied data with demographic information associated with user zip codes to make product suggestions. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "27. Electronic manufacturing employees and suppliers at all steps along the supply chain and manufacturing process are at risk of unhealthy exposure to potentially harmful materials. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "27. Fewer and fewer organizations are allowing their employees to create their own personal blogs relating to their employment. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "27. If the desired results are not achieved upon implementation of the solution, one should return to the \"identify alternatives\" step of the decision making process and rework the decision. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "27. Industrial espionage and competitive intelligence are essentially the same. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "27. It is not unusual for a security audit to reveal that too manypeople have access to critical data and that many people havecapabilities beyond those needed to perform their jobs.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "27. Many shortcuts can be taken when safety-critical software is being developed. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "28. An intrusion prevention system is software and/or hardware thatmonitors system and network resources and activities, and notifiesnetwork security personnel when it identifies possible intrusions fromoutside the organization or misuse from within the organization.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "28. Companies that can't protect or don't respect customer information often lose business and some become defendants in class action lawsuits stemming from privacy violations. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "28. Competitive intelligence analysts must be authorized to take unethical or illegal actions in the normal course of their job. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "28. No organizations have yet figured out how to conduct classes and meetings from within a virtual learning world. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "28. No policy can stop wrongdoers from taking inappropriate actions, but it can set forth the general rights and responsibilities of all IT users, establish boundaries of acceptable and unacceptable behavior and enable management to punish violators.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "28. Pornography purveyors are free to produce and publish whatever they want; however, if what they distribute is judged obscene, they are subject to prosecution under the Children's Internet Protection Act. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "28. Redundancy, the provision of multiple interchangeable components to perform a single function, is a key element of the standard decision support system. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "28. Store-and-forward telemedicine does not require the presence of the patient and care provider at the same time. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "28. The Electronic Industry Citizenship Coalition established a system that enables purchasers to evaluate, compare, and select electronic products based on a total of 51 environmental criteria. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "28. To the detriment of all concerned, the importance of ethics and human values have been over emphasized in the midst of many IT breakthroughs in recent years. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "29. A virtual world may support e-commerce and allow users to sell their own real products within the real world. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "29. An organization can never be prepared for the worst—a successfulattack that defeats all or some of a system's defenses and damages dataand information systems.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "29. Procter &amp; Gamble admitted publicly that it unethically gained information about Unilever, its competitor in the multibillion-dollar hair-care business. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "29. Public sector employees have far greater privacy rights than those in private industry because the Fourth Amendment does not limit how a private employer treats its employees. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "29. Reliability is the probability of a component or system performing without failure over its product life. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "29. The CAN-SPAM Act clearly defines the conditions under which the sending of spam is legal. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "29. The European Union passed the Restriction of Hazardous Substances Directive which restricts the use of many hazardous materials in computer manufacturing. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "29. The general public does not understand the critical importance of ethics as they apply to IT, as too much emphasis has been placed on technical issues. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "29. The use of telemedicine is a natural extension of medical practices followed for decades and really does not require addressing new legal and ethical issues. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "29. There is little organizations can do to stop employees whoparticipate in chat rooms, view pornographic sites, and play computergames while at work.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "30. Advocates of advanced surveillance technology argue that people have no legitimate expectation of privacy in a public place. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "30. Cybersquatters are individuals who registered domain names for famous trademarks or company names to which they had no connection. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "30. Discussing security attacks through public trials and theassociated publicity has not only enormous potential costs in publicrelations but real monetary costs as well.a. Trueb. False",
      "definition": "a. True"
    },
    {
      "term": "30. Failure mode and effects analysis is an important technique used to develop ISO 9000-compliant systems by both evaluating reliability and determining the effects of system and equipment failures. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "30. In the business world, important IT decisions are too often left to the technical experts; general business managers must assume greater responsibility for these decisions. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "30. Many researchers feel that the true extent of cyberstalking has been greatly exaggerated. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "30. Organizations must implement systems and procedures to provideaccess to all organizational data by all employees no matter where theyare located.a. Trueb. False",
      "definition": "b. False"
    },
    {
      "term": "30. The EICC has established a code of conduct that established guidelines across five areas of responsibility: labor, health and safety, environment, management system, and ethics. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "30. The Federal Trade Commission is charged with enforcing the CAN-SPAM act but has done little to enforce the act. a. True b. False",
      "definition": "a. True"
    },
    {
      "term": "30. The use of medical web sites have become quite sophisticated and can be used as a reliable substitute for professional medical advice and diagnosis. a. True b. False",
      "definition": "b. False"
    },
    {
      "term": "A process or set of rules to be followed in calculations or other problem-solving operations, especially by a computer describes an A: Troubleshooting problem B: Set of inputs C: Algorithm D: Computer program",
      "definition": "Algorithm"
    },
    {
      "term": "To make this algorithm functional, which step would you add to step 4?Scan to find the smallest numberSet to 0 in the index in the output arrayRemove that number from the input array __________________________________________ A: Repeat steps 1-3, but subtract the total from the numbers summated B: Print output in the correct order C: Divide the array by the index, print the array output D: Repeat steps 1-3, but add 1 to the index number for each loop",
      "definition": "Repeat steps 1-3, but add 1 to the index number for each loop"
    },
    {
      "term": "Take input, get output, use output on next input is an example of a learning algorithm A: True B: False",
      "definition": "True"
    },
    {
      "term": "Learning algorithms require large datasets, which means storing identifying information about users A: True B: False",
      "definition": "True"
    },
    {
      "term": "A _________ _________ in machine learning is the idea that the algorithm itself influences the next set of inputs that go into the model. the main takeaway is that algorithms sometimes have more influence than a user's initial input. A: Feedback loop B: Large dataset C: Learning algorithm D: False dichotomy",
      "definition": "Feedback loop"
    },
    {
      "term": "Are anonymous datasets truly anonymous? A: Yes, thanks to privacy regulations B: Yes, thanks to machine learning randomness algorithms C: No, due to lacking regulations D: No, due to combining data and re-identification",
      "definition": "No, due to combining data and re-identification"
    },
    {
      "term": "Which of the following best describes what an algorithm is? A: A type of computer that calculates problem-solving methods B: A type of process a human uses to write down what steps need to happen to get a problem solved C: A recipe that a computer uses to solve problems D: A list of ingredients a computer uses to generate problems to solve",
      "definition": "A recipe that a computer uses to solve problems"
    },
    {
      "term": "An algorithm that takes an input, tries 10 different sorting techniques, and uses the best fit on the next 100 inputs is best described as a A: Learning algorithm B: Explicit algorithm C: Data algorithm D: Implicit algorithm",
      "definition": "Learning algorithm"
    },
    {
      "term": "Which of these steps follows the most logical order for a low-to-high sorting algorithm? A: Scan to find the smallest number Set to 0 in the index in the output array Remove that number from the input array Repeat steps 1-3, but add 1 to the index number for each loop B: Scan to find the smallest number Set the length of the array in the index in the output array Remove that number from the input Repeat steps 1-3, but add 1 to the index number for each loop C: Scan to find the smallest number Set to 0 in the index in the output array Remove that number from the input array D: Scan to find the largest number Set to 0 in the index in the output array Remove that number from the input array Repeat steps 1-3, but add 1 to the index number for each loop",
      "definition": "Scan to find the smallest number Set to 0 in the index in the output array Remove that number from the input array Repeat steps 1-3, but add 1 to the index number for each loop"
    },
    {
      "term": "What's the difference between a basic and learning algorithm? A: A basic algorithm takes an input and gets an output, while a learning algorithm takes multiple inputs and gets multiple outputs B: An basic algorithm takes an input and gets an output, while a learning algorithm uses the output on the next input C: A basic algorithm takes an input, gets an output, while a learning algorithm takes multiple inputs and gets multiple outputs D: A basic algorithm takes an input, while a learning algorithm takes an input and gets an output",
      "definition": "An basic algorithm takes an input and gets an output, while a learning algorithm uses the output on the next input"
    },
    {
      "term": "Pseudocode can best be defined as A: A python library for machine learning B: A middle ground between code and plain writing that can be fed into a computer C: A type of javascript that is both human and machine-readable D: An explainable description of code that is meant for humans, not computers",
      "definition": "An explainable description of code that is meant for humans, not computers"
    },
    {
      "term": "What side effect of learning algorithms creates an ethical dilemma for its users? A: Learning algorithms require government regulation, which is bad for software developers B: Learning algorithms are costly to run, which drives up prices for consumer services C: Learning algorithms require large datasets, which means storing identifying information about users D: Learning algorithms require large amounts of computing power, which is bad for the environment",
      "definition": "Learning algorithms require large datasets, which means storing identifying information about users"
    },
    {
      "term": "How do anonymized datasets fall short of their goal of being anonymous? A: Anonymized datasets can be combined with other datasets, which can re-identify individuals B: Anonymized datasets can be re-identifyed by anyone holding the hash key C: Anonymized datasets can be traced back to the individuals by looking at their browsing history in the app D: Anonymized datasets aren't actually anonymous because many of the data fields can identify a user",
      "definition": "Anonymized datasets can be combined with other datasets, which can re-identify individuals"
    },
    {
      "term": "What is a likely outcome for a weather app using a learning algorithm to figure out where to put their future weather stations? A: Accessing weather forecasts from local broadcasts B: Storing data in an aws instance with all weather stations in the country C: Collecting location data every time the app is opened, potentially learning where a user lives, works, etc. D: Collecting weather data every time the app is opened, knowing the temperature where the app is being used",
      "definition": "Collecting location data every time the app is opened, potentially learning where a user lives, works, etc."
    },
    {
      "term": "Which of the following is a good example of a feedback loop in machine learning? A: A social media site tracks engagement, uses an algorithm to surface posts you're likely to engage with, which then goes back into the algorithm B: A social media site surfaces controversial posts, which make users more angry and lead to more angry posts on the network C: A shopping app tracks your purchases, and recommends new things to buy D: A shopping app surfaces new items to buy, which is based on dataset from customers fitting a similar profile. when you buy, you go into that dataset",
      "definition": "A social media site tracks engagement, uses an algorithm to surface posts you're likely to engage with, which then goes back into the algorithm"
    },
    {
      "term": "A fact of learning algorithms is that A: Even if you haven't shared an direct datapoint about yourself, with enough related datapoints the algorithm can make an educated guess with alarming accuracy B: Just because they are capable of improving outputs, they don't need more inputs C: They only learn when given small amounts of data, and without the proper training sample, the results can be wildly inaccurate D: They cannot make predictions with current technology",
      "definition": "Even if you haven't shared an direct datapoint about yourself, with enough related datapoints the algorithm can make an educated guess with alarming accuracy"
    },
    {
      "term": "A basic learning model can figure out which of the 10 sorting mechanisms works best for this type of input. a complex model ______________________ A: Automatically scans all inputs B: Can figure out up to 150 mechanisms C: Can figure out up to 50 mechanisms D: Automatically derives its mechanism",
      "definition": "Automatically derives its mechanism"
    },
    {
      "term": "A model's error rate is the ratio of incorrect predictions to total predictions A: True B: False",
      "definition": "True"
    },
    {
      "term": "The goal of the _______________ is to get the model's error rate as low as possible. to do this, we repeat a cycle of feeding training data, compare predictions to actual outcomes, and adjust the model as needed. A: Develop phase B: Algorithmic phase C: Training phase D: Deployment phase",
      "definition": "Training phase"
    },
    {
      "term": "As models become more complex, researchers are unable to reason why the decisions are being made. this is called the _________________ A: Rationality phase B: Black box problem C: Training phase D: False input problem",
      "definition": "Black box problem"
    },
    {
      "term": "____________ can often be caused by predicting what someone may or may not do based on data A: Irrationality B: Dataset collection C: Real harm D: Retraining scenarios",
      "definition": "Real harm"
    },
    {
      "term": "Hedge funds largely rely on predictive models to judge the movement of stocks, bonds, and securities A: True B: False",
      "definition": "True"
    },
    {
      "term": "What's the difference between a basic and complex learning algorithm? A: A basic algorithm cannot use computer vision, while a complex algorithm can B: A basic algorithm cannot process more than 5 steps in a function, while a complex algorithm can process up to 15 C: A basic algorithm has a set amount of choices to optimize for, while a complex algorithm is given the freedom to find its own model D: A basic algorithm can handle simple inputs like numbers, while a complex algorithm can handle complex inputs like pictures",
      "definition": "A basic algorithm has a set amount of choices to optimize for, while a complex algorithm is given the freedom to find its own model"
    },
    {
      "term": "When building a predictive model, what is the goal of the develop phase? A: To get the model to accept new inputs, train, and repeat training until it finds a better curve B: To specify the type of algorithm the model should use and make sure the data is cleaned/formatted C: To plug in 40% of your dataset, testing the model's accuracy D: To get the model's error function below an acceptable percentage",
      "definition": "To specify the type of algorithm the model should use and make sure the data is cleaned/formatted"
    },
    {
      "term": "When building a predictive model, what is the goal of the training phase? A: To adjust training methods from backpropagation to supervised learning to see how that affects outputs B: To use the model in real-world scenarios, monitoring performance C: To adjust the model based on a subset of data, optimizing for a lower error rate D: To specify the type of algorithm the model should use and make sure the data is cleaned/formatted",
      "definition": "To adjust the model based on a subset of data, optimizing for a lower error rate"
    },
    {
      "term": "When building a predictive model, what is the goal of the deployment phase? A: To specify the type of algorithm the model should use and make sure the data is cleaned/formatted B: To plug in 40% of your dataset, testing the model's accuracy C: To use the model in real-life predictions, monitoring the error rate and accuracy D: To get the model to accept new inputs, train, and repeat training until it finds a better curve",
      "definition": "To use the model in real-life predictions, monitoring the error rate and accuracy"
    },
    {
      "term": "What are the attributes of an error function when training a predictive model A: The percentage of data that is formatted properly B: The ratio of training data to actual data the model has consumed C: The ratio of algorithm to curve in a predictive model D: The percentage of predictions that don't match actual outcomes",
      "definition": "The percentage of predictions that don't match actual outcomes"
    },
    {
      "term": "In a complex learning function, we will understand the ____, but not the ____ A: Causal link, correlation B: Algorithm, cause and effect C: Inputs/outputs, algorithm D: Input data, output data",
      "definition": "Inputs/outputs, algorithm"
    },
    {
      "term": "What is the black box problem? A: The problem created when researchers don't create accurate attributes for a model B: When a model cannot accurately judge shape or color of objects due to missing data C: The issue of not having enough data to accurately train a model D: When a model is deployed, but researchers are unable to figure out why it's making decisions",
      "definition": "When a model is deployed, but researchers are unable to figure out why it's making decisions"
    },
    {
      "term": "Which of the following is a negative consequence of a predictive model used in real life? A: A model used by a lab wrongly predicts a person will not be able to pay their credit card B: A model used by a lab indicates a person is in danger C: A model used by a bank accurately predicts a person will not be able to pay off a loan D: A model used by a bank wrongly predicts a person will not be able to pay off a loan",
      "definition": "A model used by a bank wrongly predicts a person will not be able to pay off a loan"
    },
    {
      "term": "How are predictive models used in hedge funds? A: They aid researchers by forecasting financial collapse B: They provide predictions to shareholders to estimate returns C: They predict future movement of stocks and find points to exploit the market moving in either direction D: They predict whether people will be able to pay off loans, and then provide loans",
      "definition": "They predict future movement of stocks and find points to exploit the market moving in either direction"
    },
    {
      "term": "What is one possible reason a model may predict a higher crime rate based on datasets used? A: If a dataset isn't properly formatted, crime may be linked to the error function, outputting false data B: If crime is down in an area, a model may predict a parabolic curve which estimates crime is due to rise again C: The model's training curve was not provided enough data D: If drug arrests are historically high in that area, the model may correlate crime with areas of high drug use based on the datasets",
      "definition": "If drug arrests are historically high in that area, the model may correlate crime with areas of high drug use based on the datasets"
    },
    {
      "term": "To measure accuracy, take the number of ________ results and divide over the number of all results A: False positive and false negative B: True positive and true negative C: False positive and true negative D: True positive and false negative",
      "definition": "True positive and true negative"
    },
    {
      "term": "A false negative result is one in which the model predicts a result was negative, and in reality it was ___________. it is an _________ prediction A: Positive, correct B: Negative, correct C: Positive, incorrect D: Negative, incorrect",
      "definition": "Positive, incorrect"
    },
    {
      "term": "City and state are correlated data, but a model will measure no variation and the results will not be affected A: True B: False",
      "definition": "False"
    },
    {
      "term": "A ________ training set relies on running a final accuracy test before deploying a model. an __________ training set relies on multiple tests to ensure that a model is free of bias A: Sample, optimized B: Test, classic C: Optimized, classic D: Classic, optimized",
      "definition": "Classic, optimized"
    },
    {
      "term": "An unknown unknown is an example of a cultural reflection of data A: True B: False",
      "definition": "False"
    },
    {
      "term": "An ethical predictive model needs to be accurate, _____________, and fair A: Moral B: Predictable C: Truthful D: Explainable",
      "definition": "Explainable"
    },
    {
      "term": "To measure a predictive model's accuracy, you A: Multiply the number of total predictions by the percentage of correct predictions B: Divide the number of predictions by the total dataset C: Measure the ratio of the model's error curve D: Divide the number of correct predictions by the total number of predictions",
      "definition": "Divide the number of correct predictions by the total number of predictions"
    },
    {
      "term": "A predictive model's false negative result can be defined as A: The predicted result was positive, and the actual result was positive B: The predicted result was positive, and the actual result was negative C: The predicted result was negative, and the actual result was positive D: The predicted result was negative, and the actual result was negative",
      "definition": "The predicted result was negative, and the actual result was positive"
    },
    {
      "term": "A predictive model's true positive result can be defined as A: The predicted result was positive, and the actual result was positive B: The predicted result was negative, and the actual result was negative C: The predicted result was negative, and the actual result was positive D: The predicted result was positive, and the actual result was negative",
      "definition": "The predicted result was positive, and the actual result was positive"
    },
    {
      "term": "Model inputs of address with \"city + state\" as separate inputs from a dataset would violate which accuracy guideline? A: Domain expertise B: Objective summarization C: First principles D: No correlating data",
      "definition": "No correlating data"
    },
    {
      "term": "Once a dataset has been cleaned, which accuracy guideline ensures your model is looking at the problem correctly? A: Objective summarization B: Domain expertise C: First principles D: Dataset verification",
      "definition": "Domain expertise"
    },
    {
      "term": "A good example of cultural reflection in training data is A: A model fails to recognize cultural differences due to incorrect attributes B: A predictive model incorporates training data from a variety of sources C: A model selects for one demographic less often because of their historical representation D: An image recognition model selects one face over another based on sample data",
      "definition": "A model selects for one demographic less often because of their historical representation"
    },
    {
      "term": "A good example of empirical reflection in training data is A: An image recognition model cannot tell a difference between a photo of a dog and a photo of a photo of a dog B: An image recognition model selects one face over another based on sample data C: A true positive result that defies the training data set D: A model fails to recognize cultural differences due to incorrect attributes",
      "definition": "An image recognition model cannot tell a difference between a photo of a dog and a photo of a photo of a dog"
    },
    {
      "term": "A training set based on feeding 60% of data, validating on 20% of data, and then designing multiple tests for the remaining 20% of data is referred to as an A: False positive set B: Optimized training set C: Predictive training set D: Classic training set",
      "definition": "Optimized training set"
    },
    {
      "term": "Our goals for building an ethical predictive model include making sure the results are A: Precise, methodical, ethical B: Accurate, precise, fair C: Precise, explainable, predictable D: Accurate, fair and explainable",
      "definition": "Accurate, fair and explainable"
    },
    {
      "term": "Unknown unknowns refer to A: Facing unknown empirical data with an incomplete dataset B: An uncertainty of how the data is gathered C: Being unsure about the morals of the research team D: Lack of explainability and what a model is actually looking at to make it's prediction",
      "definition": "Lack of explainability and what a model is actually looking at to make it's prediction"
    },
    {
      "term": "Narrow ai (ani) is defined as a specific type of artificial intelligence in which a technology outperforms humans in some defined task. A: True B: False",
      "definition": "True"
    },
    {
      "term": "An ethical, evolved predictive model would need to mimic a researcher's ability to _________________ A: Scrub data B: Self-learn C: Parse through datasets D: Eliminate bias",
      "definition": "Eliminate bias"
    },
    {
      "term": "The second evolution of decision-making ai would enable A: Predictive models to drive cars B: Predictive models to start companies C: Predictive models to decide war strategy D: Predictive models to approve loans",
      "definition": "Predictive models to decide war strategy"
    },
    {
      "term": "Researchers believe that a general-purpose ai must be available to as many as possible, making it similar to a ________ A: Government program B: Utility C: Tax plan D: System of money",
      "definition": "Utility"
    },
    {
      "term": "A perverse instantiation is an unintended negative outcome of programming a goal that is too specific given to general intelligence A: True B: False",
      "definition": "False"
    },
    {
      "term": "For-profit colleges tend to use predictive models A: To accelerate their research departments B: To see which candidates are most likely to receive government loans. C: To see which applicants are most likely to graduate D: To evaluate the standards of their professors",
      "definition": "To see which candidates are most likely to receive government loans."
    },
    {
      "term": "For a model to clean, parse, and self-train it's own dataset while remaining impartial, the model needs A: A test for recency bias B: 10x the amount of data C: A list of bias and domain tests to run and adjust for D: More powerful computing algorithms to auto-scrub data",
      "definition": "A list of bias and domain tests to run and adjust for"
    },
    {
      "term": "For a model to make decisions that involve human life, the model needs A: A list of bias tests to run against possible wrong outcomes B: Enough computing power to make correct predictions 100% of the time C: A moral code of reasoning and priorities D: Programmed reflexive decision making ability",
      "definition": "A moral code of reasoning and priorities"
    },
    {
      "term": "A type of artificial intelligence that outperforms humans in some defined task is known as A: Special ai B: General ai C: Aei D: Narrow ai",
      "definition": "Narrow ai"
    },
    {
      "term": "A type of artificial intelligence that outperforms humans in all tasks is known as A: Encompassing ai B: Outwit ai C: General ai D: Specific ai",
      "definition": "General ai"
    },
    {
      "term": "In 2019, ____% of equity-futures and cash-equity trades were executed by algorithms A: 20-30% B: 80-90% C: 11-17% D: 1-5%",
      "definition": "80-90%"
    },
    {
      "term": "The optimistic view of general ai could be accurately summarized as ai as a ____ A: Peace-keeping tool B: Human right C: Weapon D: Utility",
      "definition": "Utility"
    },
    {
      "term": "The pessimist view of general ai references a scenario in which advancement is _____ A: Creating ai for all governments B: Impossible C: Winner take all D: A potential extinction event",
      "definition": "Winner take all"
    },
    {
      "term": "An ethical general purpose ai must _____ while not harming the safety of humanity A: Keep those in power responsible B: Be 100% accurate C: Benefit as many people as possible D: Not enact hate",
      "definition": "Benefit as many people as possible"
    },
    {
      "term": "\"companies have an obligation to their shareholders\" is part of a view that sees artificial intelligence as A: An overall good for humanity, no matter the consequences B: A harmful tool that will bring about the end of capitalism C: Just another tool that accelerates research, like online advertising D: A gimmick for enterprises, unless general intelligence is achieved",
      "definition": "Just another tool that accelerates research, like online advertising"
    },
    {
      "term": "An unintended negative outcome of programming a broad goal into general intelligence is known as A: Perverse instantiation B: Artificial sanctification C: An ethical dilemma D: An enduring output",
      "definition": "Perverse instantiation"
    },
    {
      "term": "True or false: the definition of fairness is \"just treatment without bias and contempt\" A: True B: False",
      "definition": "False"
    },
    {
      "term": "Statistical parity as a fairness goal makes the most sense when A: Distributing randomly, ex. tickets B: Distributing by merit, ex. loans C: Distributing by gender, ex. tickets D: Distributing by error rate, ex. loans",
      "definition": "Distributing randomly, ex. tickets"
    },
    {
      "term": "Error rate parity means an equal chance of A: Outcomes for each group B: Prediction rate for each group C: Mistakes made for each group D: Approval for each group",
      "definition": "Mistakes made for each group"
    },
    {
      "term": "If you know one group is misrepresented in merit by training data, one way to ensure fairness is to A: Delete that group's data from the dataset B: Protect a different group C: Create a separate threshold for that group D: Reboot the training data",
      "definition": "Create a separate threshold for that group"
    },
    {
      "term": "True or false: fairness in machine learning cannot protect all individuals within protected groups from harm A: True B: False",
      "definition": "True"
    },
    {
      "term": "Our goal in machine learning fairness is to minimize _______ as long as _______ is obtained A: Accuracy issues, unfairness B: Unfairness, equality C: Error rates, parity D: Equality, error rates",
      "definition": "Error rates, parity"
    },
    {
      "term": "Fairness is best defined as just treatment without __________ A: Prejudice and favoritism B: Discrimination and prejudice C: Bias and contempt D: Favoritism or discrimination",
      "definition": "Favoritism or discrimination"
    },
    {
      "term": "Which type of fairness would make sense when dividing tickets evenly between groups? A: Equality of prediction rate B: Statistical parity C: Equality of false positives D: Error rate parity",
      "definition": "Statistical parity"
    },
    {
      "term": "Which type of fairness fails to address merit while maintaining accuracy? A: Error rate parity B: Statistical parity C: Equality of prediction rate D: Equality of false positives",
      "definition": "Statistical parity"
    },
    {
      "term": "A model that prioritizes equality on the outputs uses A: Equality of prediction rate B: Equality of assignment rate C: Error rate parity D: Statistical parity",
      "definition": "Error rate parity"
    },
    {
      "term": "Fairness in machine learning can protect groups from bias, but can still harm A: Individuals within those groups B: Future models C: Researchers D: Training datasets",
      "definition": "Individuals within those groups"
    },
    {
      "term": "A goal of a fair model's accuracy standards is to A: Minimize the quality metrics as long as the quantity metrics aren't affected B: Minimize the error rate as long as the training data isn't affected C: Minimize the error rate as long as parity is obtained D: Minimize the fairness score as long as the error rate isn't affected",
      "definition": "Minimize the error rate as long as parity is obtained"
    },
    {
      "term": "A model that makes more mistakes by moving its decision threshold down 40% of its worthiness metric will be potentially A: Fairer but less accurate B: Less fair but more accurate C: More accurate and fairer D: Less accurate and less fair",
      "definition": "Fairer but less accurate"
    },
    {
      "term": "If one group comprises the majority of the training data, they will skew the dataset and give the model A: More fairness for that group B: Less fairness for that group C: More confidence about that group D: Less confidence about that group",
      "definition": "More confidence about that group"
    },
    {
      "term": "If we know one group's worthiness score has been artificially inflated, one solution for fairness is to A: Remove that group from the dataset B: Add the inflation to the other data C: Balance the error rate by prioritizing the other group D: Creating separate decision thresholds for each group",
      "definition": "Creating separate decision thresholds for each group"
    },
    {
      "term": "An unfair model will by nature A: Try to balance groups automatically B: Optimize for making the most errors C: Optimize for making the fewest mistakes D: Optimize for making the fewest decisions",
      "definition": "Optimize for making the fewest mistakes"
    },
    {
      "term": "True or false: it is practical to protect all possible subgroups in predictive modeling A: True B: False",
      "definition": "False"
    },
    {
      "term": "In machine learning, a pareto curve helps us A: Highlight the inequality in our model B: Pick an optimal threshold for accuracy and error rate C: Pick an optimal tradeoff between fairness and accuracy D: Select which model will give the best results",
      "definition": "Pick an optimal tradeoff between fairness and accuracy"
    },
    {
      "term": "True or false: a blind attribute model protects group fairness by not including group membership in predictions A: True B: False",
      "definition": "False"
    },
    {
      "term": "An adversarial algorithm is _______________ to identify weaknesses in black box models A: Given no data B: Purposefully biased C: Purposefully fair D: Trained with large datasets",
      "definition": "Purposefully biased"
    },
    {
      "term": "True or false: our analysis revealed that word2vec is not a black box model A: True B: False",
      "definition": "True"
    },
    {
      "term": "Which step in the fairness process would be most appropriate to introduce an auditing model? A: Sub-processing B: Pre-processing C: Post-processing D: In-processing",
      "definition": "In-processing"
    },
    {
      "term": "A state where resources cannot be reallocated to make one individual better off without making at least one individual worse off is known as a A: Pareto efficiency B: Prisoner's dilemma C: Boron letter D: Aggregate curve",
      "definition": "Pareto efficiency"
    },
    {
      "term": "In machine learning, what do we plot on the x,y axis to determine a pareto curve? A: Error rate, rejection rate B: Rejection rate, false-positive rate C: Rejection rate, subgroup fairness rate D: Error rate, true positive rate",
      "definition": "Error rate, rejection rate"
    },
    {
      "term": "Why is it impractical to protect all possible subgroups in predictive models? A: Individuals do not need protection from predictive models B: Fairness scores won't be high enough to be reasonable C: Accuracy will be lowered beyond a reasonable rate D: There won't be enough data to reflect each subgroup",
      "definition": "Accuracy will be lowered beyond a reasonable rate"
    },
    {
      "term": "A model that equalizes the number of mistakes it makes for each subgroup to reduce harm is deciding on A: Equality of false negatives B: Equality of training data C: Equality of prediction bias D: Equality of true outcomes",
      "definition": "Equality of false negatives"
    },
    {
      "term": "A _________ model can still be unfair even though it won't explicitly know which groups are being inputted into the system A: Single attribute B: Biased training C: Blind attribute D: False-negative optimized",
      "definition": "Blind attribute"
    },
    {
      "term": "What tools do researchers have to evaluate the fairness of existing black box models? A: Evaluate inputs, evaluate data B: Change training data, evaluate outputs C: Change inputs, evaluate outputs D: Change inputs, evaluate training data",
      "definition": "Change inputs, evaluate outputs"
    },
    {
      "term": "A \"purposefully biased\" algorithm used to identify unfair attributes is known as A: A predictive model B: An aggregate algorithm C: A discriminatory algorithm D: An adversarial algorithm",
      "definition": "An adversarial algorithm"
    },
    {
      "term": "In presenting an audit report, a researcher would A: Prevent the model from launching B: De-bias the results C: Score the weight of input attributes on output D: Re-train the model",
      "definition": "Score the weight of input attributes on output"
    },
    {
      "term": "In fixing the word2vec model, we have an advantage over a traditional black box model in that A: We can decide which inputs to use B: We have access to the training data C: We can see the decision-making model D: We can generate a fairness score",
      "definition": "We have access to the training data"
    },
    {
      "term": "An auditing model is an example of a ______ bias mitigation method A: Sub-processing B: Pre-processing C: Post-processing D: In-processing",
      "definition": "In-processing"
    },
    {
      "term": "True or false: the no free lunch theorem states that we cannot have fair models without giving up something else A: True B: False",
      "definition": "False"
    },
    {
      "term": "Which of the following is a good example of sample bias? A: Your model is trained to recognize pets, but you only give it photos of dogs B: Your model is trained to avoid bias, but it contains no samples of that bias C: Your model is broken because it cannot sample the right attribute D: Your model is designed to give loans to those who need it, but it is trained with unfair data",
      "definition": "Your model is trained to recognize pets, but you only give it photos of dogs"
    },
    {
      "term": "When cleaning/parsing data removes a potentially important attribute, that is referred to as A: Confirmation bias B: Automation bias C: Exclusion bias D: Observer bias",
      "definition": "Exclusion bias"
    },
    {
      "term": "Labeling outputs made by predictive models can avoid which feedback issue? A: Predictive loop bias B: Fairness score bias C: Re-training bias D: Sample bias",
      "definition": "Re-training bias"
    },
    {
      "term": "True or false: recommendation engines are not as susceptible to feedback bias due to their constraints on data inputs A: True B: False",
      "definition": "False"
    },
    {
      "term": "A \"best response\" in game theory is when A: A user chooses the least fair option B: A user leaves a group setting to pursue individual goals C: A user has no choice but to follow the group dynamic to benefit D: A user comes up with the best response from the group",
      "definition": "A user has no choice but to follow the group dynamic to benefit"
    },
    {
      "term": "The __________ theorem states that all models have the same error rate when averaged over all possible data generating distributions. A: Pareto efficiency B: Zero handouts C: No free lunch D: Biased aggregate",
      "definition": "No free lunch"
    },
    {
      "term": "As a cognitive bias, humans see lack of context/meaning around a piece of information and tend to A: Fill in gaps with existing knowledge B: Seek authority figures C: Disagree with their previous beliefs D: Use biased sources of research",
      "definition": "Fill in gaps with existing knowledge"
    },
    {
      "term": "When your collected data doesn't accurately reflect the full environment, you're experiencing A: Exclusion bias B: Prejudice bias C: Sample bias D: Observer bias",
      "definition": "Sample bias"
    },
    {
      "term": "The tendency to only seek attributes in existing collected data is known as A: Exclusion bias B: Observer bias C: Prejudice bias D: Availability bias",
      "definition": "Availability bias"
    },
    {
      "term": "An example of automation bias is A: Using new data over existing data B: Using parsed twitter data over parsed facebook data C: Using scraped twitter data over survey data D: Using biased survey data instead of parsed survey data",
      "definition": "Using scraped twitter data over survey data"
    },
    {
      "term": "A ________ is when a model is validated by it's own influence on predictions A: Dataset scrub B: False prediction set C: Self-fulfilling prediction D: Training set error",
      "definition": "Self-fulfilling prediction"
    },
    {
      "term": "One way to avoid feedback loops in machine learning is to A: Scrub datasets after each decision B: Investigate exclusion bias C: Destroy previous training data D: Label outputs to prevent re-training bias",
      "definition": "Label outputs to prevent re-training bias"
    },
    {
      "term": "Dating algorithms become biased mostly through offering users _________ A: Different ways to match with users B: Unlimited matches per day C: Collaborative filtering D: Access to separate data models",
      "definition": "Collaborative filtering"
    },
    {
      "term": "Predictive loops in marketplace models like dating apps are especially susceptible to bias due to A: Marketplace forces B: Fairness quotients C: Short feedback cycles D: Engagement levels",
      "definition": "Short feedback cycles"
    },
    {
      "term": "Game theory states that outcomes that are best for _____ can be obscured by outcomes best for ______ A: The group, the individual B: The dataset, the model C: The model, the individual D: The group, the dataset",
      "definition": "The group, the individual"
    },
    {
      "term": "A dataset column that cannot directly identify, like zip code, is called a A: Quasi-identifiable column B: Sensitive column C: Non-sensitive column D: Personally identifiable column",
      "definition": "Quasi-identifiable column"
    },
    {
      "term": "True or false: k-anonymity protects users from all privacy violations A: True B: False",
      "definition": "False"
    },
    {
      "term": "Which of the following is an example of partially obfuscated data? A: 60-70 years old B: Had a stroke C: 65 years old D: 94103",
      "definition": "60-70 years old"
    },
    {
      "term": "True or false: a non-sensitive column can endanger user privacy A: True B: False",
      "definition": "True"
    },
    {
      "term": "Why is it important to limit precise outputs in a predictive model? A: It removes the datasets in danger of violating privacy B: It can help users make better decisions C: It can help limit adversarial attacks D: It limits the ability of researchers",
      "definition": "It can help limit adversarial attacks"
    },
    {
      "term": "Where is a perturbed input used? A: When building a model B: To increase public dataset awareness C: To identify an error in a machine learning model D: To observe differing outputs",
      "definition": "To observe differing outputs"
    },
    {
      "term": "A dataset attribute that is not identifiable but constitutes data about the individual that needs to be protected is known as a A: Quasi-identifier B: Explicitly private column C: Non-sensitive column D: Sensitive column",
      "definition": "Sensitive column"
    },
    {
      "term": "K-anonymity in a dataset is achieved when each individual cannot be A: Harmed from datasets with k individuals belonging to the sensitive class B: Hidden from a quasi-identifier column as long as k individuals belong C: Reidentified in k datasets D: Distinguished from at least k individuals who are also in the dataset",
      "definition": "Distinguished from at least k individuals who are also in the dataset"
    },
    {
      "term": "A major downside to k-anonymity is that re-identification is possible with A: Multiple datasets B: Sensitive columns C: Database leaks D: Expanding k values",
      "definition": "Multiple datasets"
    },
    {
      "term": "A hospital dataset protects whether an individual has had either a stroke, heart attack, or staph infection. the individual may still be harmed via dataset A: Group inclusion B: Security issues C: K-anonymity D: Privacy columns",
      "definition": "Group inclusion"
    },
    {
      "term": "A non-sensitive column may become sensitive or even identifiable when viewed through the lens of A: Community privacy violations B: Societal privacy violations C: Algorithmic privacy violations D: Human privacy violations",
      "definition": "Algorithmic privacy violations"
    },
    {
      "term": "An example of a public dataset at risk of an algorithmic privacy violation is the A: Google search view dataset B: Fidelity bank lending dataset C: Stanford hospital dataset D: Google maps satellite view dataset",
      "definition": "Google maps satellite view dataset"
    },
    {
      "term": "The netflix prize privacy scandal is an example of reidentification through A: Multiple datasets B: Database leaks C: K-anonymity D: Sensitive columns",
      "definition": "Multiple datasets"
    },
    {
      "term": "The nature of a predictive model may reveal ___________ A: The researchers behind it B: The data it is trained on C: The algorithm's bias D: The ethics of the individual inputs",
      "definition": "The data it is trained on"
    },
    {
      "term": "An adversarial model relies on using __________ to observe different outputs A: Algorithm detection B: Perturbed inputs C: Sensitive columns D: Pressure inputs",
      "definition": "Perturbed inputs"
    },
    {
      "term": "One way to counter a potential adversarial algorithm is by A: Changing the datasets B: Limiting precise outputs C: Banning model updates D: Improving model transparency",
      "definition": "Limiting precise outputs"
    },
    {
      "term": "Which of the following is not a recommended security practice in machine learning? A: Create a chain of command B: Ensure that all team members/stakeholders have a basic understanding of security C: Perform threat modeling D: Enact a sound data governance structure",
      "definition": "Create a chain of command"
    },
    {
      "term": "True or false: data minimization is the concept of shrinking datasets to only what is required to fulfill a general purpose A: True B: False",
      "definition": "True"
    },
    {
      "term": "A model working at 95% with 100k rows of data and 97% with 500k rows is an example of A: Dataset limitations B: Accuracy issues C: Diminishing returns D: Sensitive columns",
      "definition": "Diminishing returns"
    },
    {
      "term": "True or false: global differential privacy is added after data is collected A: True B: False",
      "definition": "True"
    },
    {
      "term": "Randomized response in local differential privacy gives its users which of the following? A: Plausible deniability B: Global privacy C: K-anonymity D: Fairness guarantees",
      "definition": "Plausible deniability"
    },
    {
      "term": "In reverse-engineering a double coin flip differential model, what would be the amount of falsified \"yes/no\" responses in our dataset? A: 75% B: 50% C: 25% D: 100%",
      "definition": "25%"
    },
    {
      "term": "Which of the following is a recommended security practice for machine learning datasets? A: Ensure your team is full of different perspectives B: Perform threat modeling with beneficial algorithms C: Create a chain of command D: Enact a sound data governance structure",
      "definition": "Enact a sound data governance structure"
    },
    {
      "term": "The data minimization principle requires that you limit data collection to only what is __________ A: Necessary for differential privacy B: Needed to have k-anonymity C: Required to fulfill a specific purpose D: Optional for a chain of command",
      "definition": "Required to fulfill a specific purpose"
    },
    {
      "term": "Delete unused data __________ is a method of data minimization A: Early and often B: Before modeling C: After fairness preparations D: Before threat modeling",
      "definition": "Early and often"
    },
    {
      "term": "Gdpr states that \"personal data shall be adequate, relevant and __________ in relation to the purpose or purposes for which they are processed.\" A: Not excessive B: Highly specified C: Broadly applicable D: Thoroughly vetted",
      "definition": "Not excessive"
    },
    {
      "term": "What can be learned from a predictive model should not change if the _________ is either included or excluded in the training set A: Dataset filter B: Individual's data C: Model fairness score D: Biased dataset",
      "definition": "Individual's data"
    },
    {
      "term": "Differential privacy works by adding what to a dataset? A: Filters B: Fairness scoring C: K-anonymity D: Noise",
      "definition": "Noise"
    },
    {
      "term": "If a coin is flipped, which of the following would ensure \"yes/no\" data is private while still remaining useful? A: Heads for true answer, tails for random answer B: Heads for yes, tails for no C: Heads for fake answer, tails for true answer D: Heads for random answer, tails for yes",
      "definition": "Heads for true answer, tails for random answer"
    },
    {
      "term": "At which level of differential privacy is the outcome secured from even the people collecting answers? A: K-anonymous B: Premium C: Local D: Global",
      "definition": "Local"
    },
    {
      "term": "Plausible deniability refers to the ability of the individual to ______ A: Remove themselves from a machine learning dataset B: Claim their score was randomized response C: Express their participation in a study D: Doubt the results of a study",
      "definition": "Claim their score was randomized response"
    },
    {
      "term": "In reverse-engineering a double coin flip differential model, what would be the amount of truthful \"yes/no\" responses in our dataset? A: 50% B: 25% C: 100% D: 75%",
      "definition": "75%"
    },
    {
      "term": "True or false: a glass box model is traditionally preferred by businesses A: True B: False",
      "definition": "False"
    },
    {
      "term": "An ethical model will be more fair and explainable, at the expense of ________ A: Recruiting B: Accuracy C: Dataset collection D: Privacy",
      "definition": "Accuracy"
    },
    {
      "term": "Explainable models can provide _________, which look very similar to auditing models A: Model renderings B: Dataset fairness graphs C: Attribute weight charts D: Privacy protection",
      "definition": "Attribute weight charts"
    },
    {
      "term": "Which of the following is a strategy to improve group outcomes using game theory? A: Fairness-enforcing methods B: Explainable recommendation systems C: Privacy-enforcing algorithms D: Ethical predictive sets",
      "definition": "Explainable recommendation systems"
    },
    {
      "term": "True or false: glass box models allow agents to re-run them A: True B: False",
      "definition": "True"
    },
    {
      "term": "A differentially private search algorithm would add some ______ at the expense of _______ A: Noise, privacy B: Accuracy, noise C: Noise, accuracy D: Data points, privacy",
      "definition": "Noise, accuracy"
    },
    {
      "term": "Ethical models are _________ A: Precise, explainable, and fair B: Precise, explainable, and private C: Accurate, methodical, and fair D: Accurate, explainable, and fair",
      "definition": "Accurate, explainable, and fair"
    },
    {
      "term": "A _____ model is preferred by businesses because they see less competition as a benefit A: Black box B: Fair C: Ethical D: Precise",
      "definition": "Black box"
    },
    {
      "term": "One benefit of an explainable model is A: Privacy is preserved B: Recruiting leverage C: The model is more accurate D: Less competition",
      "definition": "Recruiting leverage"
    },
    {
      "term": "The strava dataset example illustrates that while differential privacy can protect individuals, it can still harm _______ A: Certain individuals B: Those outside the dataset C: Groups D: Researchers",
      "definition": "Groups"
    },
    {
      "term": "The explainable ai movement states that cooperation between agents, in this case, algorithms and humans, depends on which of the following? A: Trust B: Privacy C: Human rights D: Competition",
      "definition": "Trust"
    },
    {
      "term": "A benefit of glass-box models is that if an attribute is skewing the fairness of a decision, a human agent may choose to A: Alert the team B: Trust it C: Ignore it D: Re-run the algorithm without it",
      "definition": "Re-run the algorithm without it"
    },
    {
      "term": "_____ algorithms are a challenge to explainable ai, as their complexity makes it difficult to weigh attribute importance A: Explainable B: Ethical C: Deep learning D: Malicious",
      "definition": "Deep learning"
    },
    {
      "term": "When used in recommendation engines, explainable algorithms can help answer the question of ____ A: How? B: Who? C: Why? D: What?",
      "definition": "Why?"
    },
    {
      "term": "Group outcomes being improved through explainable recommendation systems is an example of using _______ to modify outcomes A: Competition B: Game theory C: Privacy D: Government",
      "definition": "Game theory"
    },
    {
      "term": "A major limitation of using explainable, adjustable algorithms is that users tend to make _____ decisions A: Malicious B: Selfish C: Socially conscious D: Private",
      "definition": "Selfish"
    }
  ]
}
