{
  "quizSrc": [
    {
      "term": "Name the two current treaties of the EU(Check all that apply)A. TEUB. TEULC. GATTD. TFUE. TFEU",
      "definition": "A. TEU E. TFEU"
    },
    {
      "term": "What was one of the main features of the Treaty of Maastricht? A. The Charter of Fundamental Rights was adopted. B. The name European Economic Community was changed to the European Union. C. The Court of Justice of the EU was established. D. It established a European Constitution.",
      "definition": "B. The name European Economic Community was changed to the European Union."
    },
    {
      "term": "By which treaty did the Charter of Fundamental rights become binding?A. Treaty of MaastrichtB. Treaty of RomeC. Treaty of AmsterdamD. Lisbon TreatyE. Treaty of Nice",
      "definition": "D. Lisbon Treaty"
    },
    {
      "term": "Which institution elects the President of the European Commission?A. The European Parliament.B. The CouncilC. The Court of Auditors.D. The European Commission.E. The European Council.",
      "definition": "A. The European Parliament."
    },
    {
      "term": "Which of the following statements are true?(Check all that apply) A. The Council is made up of ministers, such as the ministers of agriculture, the foreign ministers, etc. B. The European Council and the Council are different names for the same institution. C. The European Council consists of Heads of States or Governments. D. The European Council sets out overall guidelines for EU policies, while the Council has legislative functions.",
      "definition": "A. The Council is made up of ministers, such as the ministers of agriculture, the foreign ministers, etc. C. The European Council consists of Heads of States or Governments. D. The European Council sets out overall guidelines for EU policies, while the Council has legislative functions."
    },
    {
      "term": "What are some of the function term-3s and roles of the European Commission? (Check all that apply) A. It proposes new Legislation. B. It acts as the \"Guardian of the Treaties\". C. It sets out general guidelines for EU policies. D. It oversees the practice of the other institutions of the EU, such as the Council.",
      "definition": "A. It proposes new Legislation. B. It acts as the \"Guardian of the Treaties\"."
    },
    {
      "term": "What is the role of the Advocate General?A. To provide advice to the Court in the form of an opinion.B. It acts as a defense attorney for individuals who have brought cases before the court.C. It has the casting vote when the court rules.",
      "definition": "A. To provide advice to the Court in the form of an opinion."
    },
    {
      "term": "What happens if a country withdrawing from the European Union has not been able to agree on the terms of withdrawal within the two year period provided by the TEU? A. The Country will automatically be included in the existing EEA collaboration. B. If the period is not mutually prolonged the country is excluded from all EU collaboration. C. The Country remains member and a new exit application procedure could be restarted",
      "definition": "B. If the period is not mutually prolonged the country is excluded from all EU collaboration."
    },
    {
      "term": "Which principles are covered by the TFEU environmental policy? A. \"The precautionary principle\" B. \"The principles of preventive action\"C. \"The principle that environmental damage should be rectified at source\" D. \"The polluter pays principle\"",
      "definition": "A. \"The precautionary principle\" B. \"The principles of preventive action\" C. \"The principle that environmental damage should be rectified at source\" D. \"The polluter pays principle\""
    },
    {
      "term": "The environmental chapter requires that environmental requirements must be integrated into all Union policies and activities, with a view to promoting sustainable development. What other stipulations in the Treaty have explicitly been given such broad impact?A. Competition policyB. Human health protectionC. Employment policyD. Consumer protection",
      "definition": "B. Human health protection D. Consumer protection"
    },
    {
      "term": "What is the name of the main legal database of the EU?A. European Legal ReviewB. European TimesC. The DatabaseD. Eur-Lex",
      "definition": "D. Eur-Lex"
    },
    {
      "term": "In which database will you find cases from the Court of Justice of the EU?A. Luria.B. Suria.C. Duria.D. Curia.",
      "definition": "D. Curia."
    },
    {
      "term": "What is true about EU publications?A. They are only rarely translated into all official languages of the EU.B. They are only available to people residing in EU member states.C. They are mostly available online for free.D. They must usually be requested from the institution where they have beendrafted.",
      "definition": "C. They are mostly available online for free."
    },
    {
      "term": "If you browse through the current Treaties you will find numbers in brackets below most article numbers. What are these numbers in brackets? A. The number that will be adopted in the future EU Constitution. B. A reference to case law of the ECJ. C. The old number of that particular article in the previous Nice Treaty.",
      "definition": "C. The old number of that particular article in the previous Nice Treaty."
    },
    {
      "term": "What are some examples of EU Secondary Legislation?(Check all that apply)A. Decisions.B. The Charter of Fundamental Rights.C. The Treaties.D. Regulations.E. Directives.",
      "definition": "A. Decisions. D. Regulations. E. Directives."
    },
    {
      "term": "What is true about the following legislation act?Council Regulation (EC) No 1/2003(Check all that apply)A. EC means that the act has not yet been adopted.B. The act is a Regulation.C. It was adopted in 2003.D. The Commission is behind the act.E. The Council is behind the act.F. The act is a Directive.",
      "definition": "B. The act is a Regulation. C. It was adopted in 2003. E. The Council is behind the act."
    },
    {
      "term": "What is true about the following case?C-43/01(Check all that apply)A. It's a case from the TribunalB. It's a case from the Court of JusticeC. The case is from 1943D. The case is from 2001",
      "definition": "B. It's a case from the Court of Justice D. The case is from 2001"
    },
    {
      "term": "Why is the opinion of the Advocate General important when reading case law from the Court of Justice of the EU?(Check all that apply) A. It many times contains more information than the actual judgment. B. It usually contains a detailed analysis of the case. C. The Advocate General has the casting vote when the court rules. D. The Advocate General represents the opinion of the Commission, which has a strong voice in how the Court decides its cases.",
      "definition": "A. It many times contains more information than the actual judgment. B. It usually contains a detailed analysis of the case."
    },
    {
      "term": "Where are proposals for new legislation from the Commission published?A. On the EU website.B. In the COM documents series.C. In the Official Journal.",
      "definition": "B. In the COM documents series."
    },
    {
      "term": "Which of the following statements about primary and secondary law are true?A. Primary law is principally made up of the Treaties. B. Primary law forms the basis not only of the EU institutions, but also of the powers that can be exercised by those institutions and the procedure under which they must operate. C. Secondary law is the same as national law. D. Secondary law is comprised of law that the EU system produces by itself.",
      "definition": "A. Primary law is principally made up of the Treaties. B. Primary law forms the basis not only of the EU institutions, but also of the powers that can be exercised by those institutions and the procedure under which they must operate. D. Secondary law is comprised of law that the EU system produces by itself."
    },
    {
      "term": "An important tool in the EU legal toolbox to maintain legal certainty and uniform application of EU Law is the possibility for national courts to ask the European Court of Justice for a preliminary ruling. This is usually done when a question of interpretation of EU law arises before a national court of last instance and that court considers that an ECJ decision on this question is necessary to produce a judgment in the case before it. In fact, in such cases the judge of the court is obliged to send a reference to the ECJ.But what about the lower courts, can they also send reference to the ECJ?A. Yes, all national courts to send references for preliminary rulings to the Court of Justice of the EU.B. No, this possibility is only available to the court of last instance",
      "definition": "A. Yes, all national courts to send references for preliminary rulings to the Court of Justice of the EU."
    },
    {
      "term": "Which one of the principles below is a principle that stems from the national legal orders and is not unique to the EU legal order?A. Principle of primacyB. Principle of EU conform interpretationC. Principle of direct effectD. Principle of legal certainty",
      "definition": "D. Principle of legal certainty"
    },
    {
      "term": "Which of the below statements are true about regulations?(Check all that apply)A. Regulations have to be transposed by the national legislator into the national legal order.B. Regulations should never be transposed by the national legislator into the national legal order.C. The parts of a regulation that gives raise to right of individuals must be transposed by the national legislator into the national legal order.D. If a regulation develops a general principle of EU law (e.g. the principle of legal certainty), the regulation is considered to form part of primary EU law.E. Regulations always form part of secondary EU law",
      "definition": "B. Regulations should never be transposed by the national legislator into the national legal order. E. Regulations always form part of secondary EU law."
    },
    {
      "term": "What is the basic condition that must be fulfilled for the EU Charter to become applicable?A. The circumstances must have taken place in EuropeB. The applicability of national lawC. The applicability of EU lawD. That there is a violation of a subjective right",
      "definition": "C. The applicability of EU law"
    },
    {
      "term": "Where would you find the basic text in the Treaties on proportionality in the exercise of Union competence?A. Art 5 TEUB. Charter of Fundamental RightsC. Art 19 TEUD. Art 6 TEU",
      "definition": "A. Art 5 TEU"
    },
    {
      "term": "Complete the following sentence: Direct discrimination occurs when a person is treated less favourably ________ their status. A. despiteB. because ofC. notwithstandingD. undeterred by",
      "definition": "B. because of"
    },
    {
      "term": "Complete the following sentence:In areas where the EU has shared competence, as soon as the EU legislates to regulate a particular area, member states are ___________________ also legislate on the same area.A. encouraged toB. allowed toC. no longer allowed to",
      "definition": "C. no longer allowed to"
    },
    {
      "term": "Under which provision can private persons/companies bring an action for annulment against an EU measure?A. Article 261 TFEUB. Article 263 TFEUC. Article 265 TFEUD. Article 267 TFEU",
      "definition": "B. Article 263 TFEU"
    },
    {
      "term": "What are valid grounds for review under the action for annulment?A. Lack of competenceB. Infringement of an essential procedural requirementC. Infringement of the treatiesD. Infringement of a rule of lawE. All the above",
      "definition": "E. All the above"
    },
    {
      "term": "In which leading case did the court established the criteria for individual concern?A. PlaumannB. FrancovichC. MicrobanD. Bergaderm",
      "definition": "A. Plaumann"
    },
    {
      "term": "What is the equivalent of the action to recover damages at European level?A. European liabilityB. Contractual iabilityC. Non-contractual liabilityD. Non-State liability",
      "definition": "C. Non-contractual liability"
    },
    {
      "term": "Which of the following mechanisms was NOT created by the courts to ensure enforcement of EU law at national level:A. Direct EffectB. Indirect EffectC. Private LiabilityD. State Liability",
      "definition": "C. Private Liability"
    },
    {
      "term": "Member States' procedural autonomy is subject to which of the following principles:A. EffectivenessB. ProportionalityC. EquivalenceD. Subsidiarity",
      "definition": "A. Effectiveness C. Equivalence"
    },
    {
      "term": "Which ground cannot justify a restriction on the free movement of capital?A. AgricultureB. Economic concernsC. Town and city planningD. Public housing policy",
      "definition": "B. Economic concerns"
    },
    {
      "term": "What principle is enshrined in Article 45(2) TFEU and re-iterated in Regulation 492/2011 in relation to workers?A. Mutual recognition.B. Proportionality.C. Non-discrimination.D. Supremacy",
      "definition": "C. Non-discrimination."
    },
    {
      "term": "The public service exception in Article 45 (4) TFEU entails that... (Check all that apply)A. Nationality quota are prohibited in the public sector because it is part of the exercise of the Member State's sovereignty and therefore reserved for its own nationals solely.B. Direct discrimination based on nationality towards employees in the public sector may be allowed.C. Indirect discrimination based on nationality towards employees in the public sector may be allowed.D. Nationality quota are compulsory in the public service because it should be reflective of society.",
      "definition": "B. Direct discrimination based on nationality towards employees in the public sector may be allowed. C. Indirect discrimination based on nationality towards employees in the public sector may be allowed."
    },
    {
      "term": "On what grounds may Member States restrict rights of free movement of persons?(Check all that apply)A. Public policyB. Environmental groundsC. Economic groundsD. Educational groundsE. Public securityF. Public health",
      "definition": "A. Public policy E. Public security F. Public health"
    },
    {
      "term": "Does the principle of mutual recognition mean that a product lawfully sold in one national market shall always be lawfully sold at all other national markets within the EU internal market?A. YesB. No",
      "definition": "B. No"
    },
    {
      "term": "Under which conditions does a certain selling arrangement fall outside the scope of Article 34 TFEU according to the Keck judgement? (Check all that apply)A. The measure is proportionate to the aim in viewB. The measure does not entail any discrimination in law or in factC. The measure is generally applicable (concerns all affected traders)",
      "definition": "B. The measure does not entail any discrimination in law or in fact C. The measure is generally applicable (concerns all affected traders)"
    },
    {
      "term": "In addition to freedom of establishment, what principle is enshrined in Article 49 TFEU in relation to the self-employed?A. ProportionalityB. Mutual recognition.C. SupremacyD. Non-discrimination",
      "definition": "D. Non-discrimination"
    },
    {
      "term": "On which grounds can derogations be made to the freedom of establishment and the freedom to provide services?(Check all that apply)A. Public policyB. Consumer protectionC. Public securityD. Environmental protectionE. Public healthF. The rule of reason",
      "definition": "A. Public policy C. Public security E. Public health"
    },
    {
      "term": "What status is established by Article 20 TFEU?A. Worker status.B. Citizenship of the Member States.C. Minority status.D. European Union citizenship.",
      "definition": "D. European Union citizenship."
    },
    {
      "term": "In which field in the External Dimension does the EU have exclusive competence?A. Common Defence PolicyB. Common Security PolicyC. Common Environmental PolicyD. Common Commercial Policy",
      "definition": "D. Common Commercial Policy"
    },
    {
      "term": "Article 218 TFEU establishes the procedure by which agreements between the European Union and third countries or international organisations shall be negotiated and concluded.In this procedure, which is the most important EU institution?A. The European CouncilB. The European ParliamentC. The European CommissionD. The Council",
      "definition": "D. The Council"
    },
    {
      "term": "Does WTO law have direct effect in EU law?A. YesB. No",
      "definition": "B. No"
    },
    {
      "term": "Which of the following fields is the Common Security and Defense Policy (CSDP) an integral part of?A. TheCommittee for Civilian Aspects of Crisis Management (CIVCOM)B. The Common Foreign and Security Policy (CFSP)C. The Common Commercial Policy (CCP)D. The ECT",
      "definition": "B. The Common Foreign and Security Policy (CFSP)"
    },
    {
      "term": "How is new EU legislation made part of the EEA Agreement?A. By the European CommissionB. By the EEA Joint CommitteeC. By the European ParliamentD. By the EFTA Surveillance Authority",
      "definition": "B. By the EEA Joint Committee"
    },
    {
      "term": "Is there any obligation for EU Member States to support each other in the event of terrorist attack?A. YesB. No",
      "definition": "A. Yes"
    },
    {
      "term": "Please decide if the following statement is true:The European External Action Service and the High Representative (EEAS) is an EU institution and stands responsible for the external policy making.A. TrueB. False",
      "definition": "B. False"
    },
    {
      "term": "What kind of EU policies does the EEA agreement also cover?(Check all that apply)A. Rules of competitionB. A common defense policyC. Environmental goals",
      "definition": "A. Rules of competition C. Environmental goals"
    },
    {
      "term": "What is one of the main roles of the European Parliament in the field of external relations?A. It must give its consent before the EU concludes most types of international agreements.B. It has no major role in the external dimension.C. It must give its consent before any EU member state concludes an international agreement that might effect other member states' foreign policy.",
      "definition": "A. It must give its consent before the EU concludes most types of international agreements."
    },
    {
      "term": "In what way is the Court of Justice of the EU important in the field of external relations?A. It decides on the delimitation of external competence between the EU and its member states.B. It has little importance in the field of external relations.C. It must always rule on the constitutionality of all international agreements concluded by the EU.",
      "definition": "A. It decides on the delimitation of external competence between the EU and its member states."
    },
    {
      "term": "In forging a long-term business strategy, what appears to lead to a better result?A. A successful agreement where one's principle wins on all itemsB. A rapid establishment of subsidiaries in all EU Member StatesC. A step-by-step approach where the grounds are tested and balanced relations achieved",
      "definition": "C. A step-by-step approach where the grounds are tested and balanced relations achieved"
    },
    {
      "term": "What type(s) of middleman agreement is more affected by EU competition law?A. The agency agreementB. The licensee agreementC. The distributorship relation",
      "definition": "B. The licensee agreement C. The distributorship relation"
    },
    {
      "term": "When an Agency relation with unlimited term expires, the agent has a mandatory right to:A. Compensation for investments he has madeB. Prolong the agreement on an annual basisC. A limited indemnity covering his loss of future Commission on transactions he has organized",
      "definition": "A. Compensation for investments he has made C. A limited indemnity covering his loss of future Commission on transactions he has organized"
    },
    {
      "term": "Which of the following provision(s) is/are hard core prohibited in distributorship agreements:A. An undertaking not to challenge the patent protection held by the producerB. A prohibition to sell the products to customers who intend to export the product outside the distributor's territoryC. A recommended sales price of 9.99 EUR",
      "definition": "B. A prohibition to sell the products to customers who intend to export the product outside the distributor's territory"
    },
    {
      "term": "What is the name of the document that is commonly used in international sea carriage of goods?A. Sea waybillB. Transport documentC. Bill of ladingD. Consignment note",
      "definition": "C. Bill of lading"
    },
    {
      "term": "What is the major legal regime that applies to international sea carriage of goods?A. The Rotterdam RulesB. The Hague-RulesC. The Hague-Visby RulesD. The Hamburg Rules",
      "definition": "C. The Hague-Visby Rules"
    },
    {
      "term": "What is the distinction between an agent and a distributor?A. The agent only pays a limited royalty to the principal whereas the distributor shares the proceeds;B. The agent receives a commission on sales reported whereas the distributor determines his own marginC. Distributors are under EU law more protected than agents",
      "definition": "B. The agent receives a commission on sales reported whereas the distributor determines his own margin"
    },
    {
      "term": "Both licensing and distributorship relations leave it basically free for the parties to decide on the terms of their collaboration. However, EU competition rules impact the freedom to contract. Please indicate which undertakings that are prohibited:A. Create territorial protectionB. Contain end pricing mechanismsC. Control output",
      "definition": "A. Create territorial protection B. Contain end pricing mechanisms C. Control output"
    },
    {
      "term": "May a licensor do the folowing in a licensing arrangement? If not, which of the following is unlawful?A. She divides the royalty by relating it partly to the licensed trademarks, patent and know-how respectively thereby trying to secure evergreen royalty payment.B. She requests compensation for the fact that the licensee also is granted rights to any invention made by the licensor and requests that the licensee shall free of charge grant back inventions made by him/her.C. She charges as royalty which almost deprives the licensee of any margin.",
      "definition": "B. She requests compensation for the fact that the licensee also is granted rights to any invention made by the licensor and requests that the licensee shall free of charge grant back inventions made by him/her."
    },
    {
      "term": "What is the maximum compensation the shipper can receive based on weight limitation if the goods were carried by sea?A. 8,33 SDR per kiloB. 19 SDR per kiloC. 17 SDR per kiloD. 2 SDR per kilo",
      "definition": "D. 2 SDR per kilo"
    },
    {
      "term": "What are the current treaties - TEU and TFEU - also called?A. Treaty of NiceB. Treaty of LisbonC. Treaty of AmsterdamD. SkipSubmit",
      "definition": "B. Treaty of Lisbon"
    },
    {
      "term": "The Treaty of Rome established the European Economic Community (EEC).Which year was the treaty adopted?(Type the correct year)",
      "definition": "   "
    },
    {
      "term": "Try to remember the basic structure of the Judicial Branch of the EU. Which of the following statements are true? (Check all that apply):A. The Court of Justice of the European Union is the collective name of all the courts that make up the Judicial Branch of the EU.B. The General Court is but one of several courts of the EU Judicial Branch.C. The Specialized Courts do not belong to the Court of Justice of the European Union.",
      "definition": "A. The Court of Justice of the European Union is the collective name of all the courts that make up the Judicial Branch of the EU. B. The General Court is but one of several courts of the EU Judicial Branch."
    },
    {
      "term": "What is the role of the Advocate General?A. To assist the Court with an opinion on how the Court should rule.B. To draft the verdict after the Court has ruled.C. To represent the Member States when they have been accused of violating the Treaties.",
      "definition": "A. To assist the Court with an opinion on how the Court should rule."
    },
    {
      "term": "What is the role of the Advocate General?A. It has the casting vote when the court rules.B. It acts as a defense attorney for individuals who have brought cases before the court.C. To provide advice to the Court in the form of an opinion.",
      "definition": "C. To provide advice to the Court in the form of an opinion."
    },
    {
      "term": "What can you find in the L-series of the Official Journal?A. Notices, guidelines, opinions and preparatory acts.B. Mostly secondary legislation, such as regulations, directives, decisions and recommendations.C. Case Law from the European Court of JusticeD. SkipSubmit",
      "definition": "B. Mostly secondary legislation, such as regulations, directives, decisions and recommendations."
    },
    {
      "term": "What would you not find in the Curia database?A. Cases from the Court of Justice, the General Court, and the Civil Service Tribunal.B. Press releases about new cases.C. Opinions from the Advocate General.D. Notes on Academic WritingE. Cases from the European Court of Human Rights.F. SkipSubmit",
      "definition": "E. Cases from the European Court of Human Rights."
    },
    {
      "term": "Which two of the following alternatives are not types of competence that the EU has?A. Shared competenceB. Divided competenceC. Exclusive competenceD. Supporting competenceE. Conferred competence",
      "definition": "B. Divided competence E. Conferred competence"
    },
    {
      "term": "Have a look at Article 114 TFEU. Would you categorize this Article as broad or narrow in terms of how far the EU can stretch its competence to legislate?A. BroadB. Narrow",
      "definition": "A. Broad"
    },
    {
      "term": "Which of the following statements is true about regulations? (Check all that apply)A. They are binding in their entirety.B. They are directly applicable in the Member states and mustn't be transposed into national law.C. They are binding as to the result to be achieved only.",
      "definition": "A. They are binding in their entirety. B. They are directly applicable in the Member states and mustn't be transposed into national law."
    },
    {
      "term": "Let's recap the concept of direct effect. Which are the three conditions that need to be met in order for a Directive to have direct effect? (Check all that apply)A. The provision should not be dependent on implementing measures.B. The provision must have direct applicability.C. The provision has to be clear and preciseD. The provision has to contain an unconditional right or obligation.",
      "definition": "A. The provision should not be dependent on implementing measures. C. The provision has to be clear and precise D. The provision has to contain an unconditional right or obligation."
    },
    {
      "term": "Have a look at Article 13 in the Treaty on European Union (TEU) and mark the institutions mentioned in the article. (Check all that apply)A. The European CommissionB. The European CouncilC. The European ParliamentD. The European Central BankE. The Court of Justice of the European UnionF. The Court of AuditorsG. The CouncilH. The European Ombudsman",
      "definition": "A. The European Commission B. The European Council C. The European Parliament D. The European Central Bank E. The Court of Justice of the European Union F. The Court of Auditors G. The Council"
    },
    {
      "term": "Take a look at the following European Case Law Identifier (ECLI) number.EU:C:2007:809What does the C stand for?A. It represents the court that rendered the decision. In this case the Court of Justice.B. It means that the case belongs to the C-series in the EU legal database.C. It's been translated into the Czech language.D. SkipSubmit",
      "definition": "A. It represents the court that rendered the decision. In this case the Court of Justice."
    },
    {
      "term": "Open the Curia database and look up the case C - 438/05. Who are the parties in the case?A. Commission of the European Communities v Kingdom of Sweden.B. International Transport Workers' Federation and Finnish Seamen's Union v Viking Line ABP and OÜ Viking Line Eesti.C. Otmar Greser v Bundesagentur für Arbeit.",
      "definition": "B. International Transport Workers' Federation and Finnish Seamen's Union v Viking Line ABP and OÜ Viking Line Eesti."
    },
    {
      "term": "Do you remember what the main role of the European Commission is?A. It represents the EU in all foreign negotiations.B. It acts as the \"Guardian of the Treaties\" and proposes new legislation.C. It acts as a mediator between Member states.",
      "definition": "B. It acts as the \"Guardian of the Treaties\" and proposes new legislation."
    },
    {
      "term": "What is true about the following legislative act? (Check all that apply)COM (2015) 13 finalA. It has been issued by the Council.B. It has been issued by the Commission.C. It was published in 2013D. It was published in 2015.E. It's the final version.",
      "definition": "B. It has been issued by the Commission. D. It was published in 2015. E. It's the final version."
    },
    {
      "term": "Can you name the four levels of fundamental rights protection in the EU that Magnus discusses earlier in this lecture?A. Fundamental rights as general principlesB. The Charter of Fundamental RightsC. The application of fundamental rights by national courts in the Member States.D. The future accession of the EU to the European Convention of Human RightsE. United Nations tribunals.",
      "definition": "A. Fundamental rights as general principles B. The Charter of Fundamental Rights C. The application of fundamental rights by national courts in the Member States. D. The future accession of the EU to the European Convention of Human Rights"
    },
    {
      "term": "The Charter is applicablea) when EU Law is applied andb) when the Member States apply EU Law",
      "definition": " "
    },
    {
      "term": "How do Koen Lenaerts and Piet van Nuffel explain the principle of proportionality?A. The principle of proportionality serves to assess the legality of an exercise of power where an admittedly legitimate aim is pursued, but at the same time other objectives deserving of protection are damaged.B. Proportionality decides the limits of EU competence versus the competence of the Member States.C. Proportionality assessments are superfluous",
      "definition": "A. The principle of proportionality serves to assess the legality of an exercise of power where an admittedly legitimate aim is pursued, but at the same time other objectives deserving of protection are damaged."
    },
    {
      "term": "Do you remember how many steps there are in the proportionality assessment? Also, do you remember what the steps are?A. Four steps.B. Five steps.C. Three steps.D. Two steps.",
      "definition": "C. Three steps."
    },
    {
      "term": "Can treating two people the same be discriminatory?A. YesB. No",
      "definition": "A. Yes"
    },
    {
      "term": "What should a national court do if finds that an EU law measure (e.g. a Commission decision) is incompatible with the general principle of legal certainty?A. Apply the EU measure, regardless of the violation.B. Ask a preliminary question to the ECJ, pursuant to Art 267 TFEU.C. Declare the EU measure null and void",
      "definition": "B. Ask a preliminary question to the ECJ, pursuant to Art 267 TFEU."
    },
    {
      "term": "Which one of the four freedoms of the internal market is also part of the earlier stages of economic integration?A. Free movement of servicesB. Free movement of personsC. Free movement of goodsD. Free movement of capital",
      "definition": "C. Free movement of goods"
    },
    {
      "term": "What is negative integration?A. Harmonisation of national laws in the form of EU legislationB. The withdrawal of a Member State from the EUC. A deregulatory approach to strike down national measures which are breach of treaty provisions",
      "definition": "C. A deregulatory approach to strike down national measures which are breach of treaty provisions"
    },
    {
      "term": "Which provisions of the Treaty on the Functioning of the European Union (TFEU)regulate the free movement of goods in the EU?A. Articles 56 to 62B. Articles 63 to 66C. Articles 26 and 28-37",
      "definition": "C. Articles 26 and 28-37"
    },
    {
      "term": "Do you have to pay custom duties when transporting goods between the two EU member States such as Germany and France?A. EU law prohibits such custom duties.B. The EU collects those duties for goods that are transported between Member States but not the Member States.C. This depends on the revenant customs rules of the two Member States.",
      "definition": "A. EU law prohibits such custom duties."
    },
    {
      "term": "Are EU member States allowed to impose a different tax level on foreign and domestic products?A. As long as this is not prohibited by Article 28 and 30 TFEU.B. Only if those are not contrary to Article 110 and 111 TFEU.C. Yes, as this is not prohibited by Article 28 and 30 TFEU.",
      "definition": "B. Only if those are not contrary to Article 110 and 111 TFEU."
    },
    {
      "term": "What are measures having equivalent effect to quantitative restrictions?A. Those measures that effect a certain percentage of the relevant imports.B. Only those measures that are specifically discriminating against foreign products.C. Rules that are capable of hindering, directly or indirectly, actually or potentially, intra-Community trade.",
      "definition": "C. Rules that are capable of hindering, directly or indirectly, actually or potentially, intra-Community trade."
    },
    {
      "term": "Can a EU Member State restrict the free-movement of goods because it wants to protect its national producers?A. Yes, but only if the measure is justified by mandatory requirements or the reasons of Art 36 TFEU.B. No, it can never do so.C. Yes, as long as this is inline with the relevant industrial policy of that Member State.",
      "definition": "A. Yes, but only if the measure is justified by mandatory requirements or the reasons of Art 36 TFEU."
    },
    {
      "term": "Which provisions of the Treaty on the Functioning of the European Union (TFEU) regulate the free movement of services in the EU?A. Articles 63 to 66.B. Articles 56 to 62.C. Articles 26 and 28-37.",
      "definition": "B. Articles 56 to 62."
    },
    {
      "term": "You are a service provider who is located in France, but you have opened a new branch office in Lund in Sweden. Can you rely on the freedom to provide services or the freedom of establishment?A. ServiceB. Establishment",
      "definition": "B. Establishment"
    },
    {
      "term": "How does the Court of Justice define a restriction on the freedom to provide services?A. Service providers from other Member States cannot be treated differently than national providers.B. Measure that specifically are aimed at restricting the freedom to provide services.C. Any measure that is liable of making the provision of cross-border services less attractive.D. All of the above.",
      "definition": "D. All of the above."
    },
    {
      "term": "Which provisions of the Treaty on the Functioning of the European Union (TFEU) regulate the free movement of capital in the EU?A. Articles 26 and 28-37.B. Articles 56 to 62.C. Articles 63 to 66.",
      "definition": "C. Articles 63 to 66."
    },
    {
      "term": "Free movement of capital is a fundament basis for the internal market. Has it always been at the forefront of the fundamental freedoms?A. No, free movement of capital has only been at the forefront in the recent history.B. Yes, because without free movement of capital, all the other freedoms are pointless.C. No, free movement of capital is only a secondary freedom.",
      "definition": "A. No, free movement of capital has only been at the forefront in the recent history."
    },
    {
      "term": "In Italy, a rule requires a foreigner buyer to make an application to State for an approval before a foreigner can buy property. In Spain, a similar rule exist that apply both to Spanish and foreign buyers in the same way. Are these rules a restriction on the free movement of capital?A. The Italian case is.B. The Spanish case is.C. Both are.",
      "definition": "C. Both are."
    },
    {
      "term": "Provided that a legitimate reason exists, who is allowed to impose restrictions on the free movement of capital?A. The EU.B. The Member States.C. Both.",
      "definition": "C. Both."
    },
    {
      "term": "Look up Article 47 TEU. What can be said to be true about the EU in light of this article?A. The EU can only act in the external dimension if there is consensus among all the Member States.B. The EU is an international organization with legal personality, which exists distinct from its Member States.C. The EU can have no independent foreign policy distinct from the Member States.",
      "definition": "B. The EU is an international organization with legal personality, which exists distinct from its Member States."
    },
    {
      "term": "Have a look at the articles that Magnus mentions (Articles 206 and 207 TFEU) and contemplate the following question:In light of the mentioned articles, what is a key feature of the Common Commercial Policy?A. High tariffs.B. Uniformity",
      "definition": "B. Uniformity"
    },
    {
      "term": "Before we continue, do you remember which of the following alternatives that states the three main factors guiding the EU development policy?A. Complementarity, Coherence and CoordinationB. Coherence, Coordination and ConfederacyC. Complementarity, Coherence and Consideration",
      "definition": "C. Complementarity, Coherence and Consideration"
    },
    {
      "term": "Have a look at Article 2(4) TFEU. What does this provision establish?A. That only the Member States shall have competence to define and implement a common foreign and security policy.B. That the EU shall NOT have competence to define and implement a common foreign and security policy.C. That the EU shall have competence to define and implement a common foreign and security policy.",
      "definition": "C. That the EU shall have competence to define and implement a common foreign and security policy."
    },
    {
      "term": "Do you remember what the abbreviation CFSP stands for?A. Common Foreign and Security PolicyB. Commercial Foreign Sanction PolicyC. Common Field of Social Policy",
      "definition": "A. Common Foreign and Security Policy"
    },
    {
      "term": "Does the EU have express competence in energy policy matters?A. NoB. Yes",
      "definition": "A. No"
    },
    {
      "term": "Which are the main areas in the external dimension of freedom, security and justice?A. Immigration, judicial cooperation in civil and criminal matters, approximation of criminal law, police cooperation, and fundamental rights protection.B. Agriculture cooperation, environmental protection and health issues.C. Cultural exchange, linguistic harmonization, and education.",
      "definition": "A. Immigration, judicial cooperation in civil and criminal matters, approximation of criminal law, police cooperation, and fundamental rights protection."
    },
    {
      "term": "How is EU legislation incorporated into EEA Agreement?A. Decisions to incorporate EU legislation in the EEA Agreement must be approved both by the parliaments of the EFTA states as well as by the European Parliament.B. Decisions to incorporate EU legislation in the EEA Agreement are taken by the EEA Joint Committee, where the EFTA States and the EU have one vote each and decisions are taken by unanimous vote",
      "definition": "B. Decisions to incorporate EU legislation in the EEA Agreement are taken by the EEA Joint Committee, where the EFTA States and the EU have one vote each and decisions are taken by unanimous vote"
    },
    {
      "term": "Take a look at Article 6 EEA. Which principle is enshrined in this article?A. Proportionality.B. Direct effect.C. Homogeneity",
      "definition": "C. Homogeneity"
    },
    {
      "term": "The length and complexity of international trade negotiations between the EU and a third country may depend on:A. The use of an Investment Court System for dispute settlementB. The type of competence(s) affected by the agreementsC. The EU willing and able to align its standards to those applicable in the third countryD. The third country willing and able to align its standards to those applicable in the EU",
      "definition": "B. The type of competence(s) affected by the agreements D. The third country willing and able to align its standards to those applicable in the EU"
    },
    {
      "term": "As a small company in the EU, how would you be able to benefit from an international trade agreement, such as CETA?A. recognition of certificates in the foreign countryB. Lower environmental requirements to comply withC. Access to the foreign marketD. Elimination of tariffs/customs duties on products exported",
      "definition": "A. recognition of certificates in the foreign country C. Access to the foreign market D. Elimination of tariffs/customs duties on products exported"
    },
    {
      "term": "In European Union law there is at present but one company form: The European Company. Nonetheless there are as many possible types of European Companies as there are member states. How can this be?A. It can´t be, the statement is incorrectB. Because every member state adds its cultural flavor to any European Company set up in that member stateC. Because to a fairly large extent national law is applicable to European Companies",
      "definition": "C. Because to a fairly large extent national law is applicable to European Companies"
    },
    {
      "term": "What is meant by \"regulatory competition\" with regard to company law within the European Union? A. That companies from different member states compete with each other by adapting their by-laws to the preferences of investors in other member statesB. That different interest groups compete with each other in order to influence the development of European Union company lawC. That member states compete with each other by adapting their national company law in order to attract primary establishments of companies",
      "definition": "C. That member states compete with each other by adapting their national company law in order to attract primary establishments of companies"
    },
    {
      "term": "Rules regarding the representational authority on behalf of the company fall into two groups. Which of the two following options are correct?A. One group of rules tells us when a representative has acted wronglyB. One group of rules identifies the conditions, under which a person or set of persons is empowered to affect changes in the company's external legal relationsC. One group of rules tells us when a representant is allowed to perform legal acts on behalf of the companyD. One group of rules draws the limit between valid and invalid legal acts which a representant has performed on behalf of the company",
      "definition": "B. One group of rules identifies the conditions, under which a person or set of persons is empowered to affect changes in the company's external legal relations D. One group of rules draws the limit between valid and invalid legal acts which a representant has performed on behalf of the company"
    },
    {
      "term": "Why does comparative company law often focus on rule-functions rather than the content of rules?A. Because rules as such are viewed as uninterestingB. Because rules as such cannot be compared with each otherC. Because functions are viewed as more universal than rulesD. Because a multiplicity of rules is consistent with a much more limited set of functions",
      "definition": "C. Because functions are viewed as more universal than rules D. Because a multiplicity of rules is consistent with a much more limited set of functions"
    },
    {
      "term": "The core of company law can be said to consist of three types of rules. Which are these three?A. Rules concerning the responsibilities for the company's debtsB. Rules concerning the decision-making authority on behalf of the companyC. Rules concerning the bodies of the company and their internal relationsD. Rules concerning the membership in the companyE. Rules concerning the representational authority on behalf of the companyF. Rules concerning the company´s relation to its stakeholders",
      "definition": "A. Rules concerning the responsibilities for the company's debts B. Rules concerning the decision-making authority on behalf of the company E. Rules concerning the representational authority on behalf of the company"
    },
    {
      "term": "Is there such a thing as a European Company?A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "Rules regarding the decision-making authority on behalf of the company fall into two groups. Which?A. One group of rules tell us when a company decision existsB. One group of rules tells us which rights members have with respect to the content of company decisionsC. One group of rules draws the limit between lawful and unlawful company decisionsD. One group of rules tells us which rights other stakeholders than members have with respect to the content of company decisions",
      "definition": "A. One group of rules tell us when a company decision exists C. One group of rules draws the limit between lawful and unlawful company decisions"
    },
    {
      "term": "What does the \"comply or explain\" code entail?A. It allows companies to depart from particular recommendations of the applicable code, provided they explain the reasons for doing so.B. Laissez-faire for all legal requirements.C. Adapt to the rules.",
      "definition": "A. It allows companies to depart from particular recommendations of the applicable code, provided they explain the reasons for doing so."
    },
    {
      "term": "Which of the following alternatives gives the best definition of \"company law\"? A. Legal rules that regulate companiesB. Legal rules that affect companiesC. Legal rules designed to solve typical conflicts within companiesD. Legal rules only applicable to companies",
      "definition": "D. Legal rules only applicable to companies"
    },
    {
      "term": "How are companies and contracts related?A. Contracts presuppose companies as an institutionB. Companies presuppose contracts as an institutionC. Both contracts and companies are institutions in the service of private autonomyD. Companies are a species of contractsE. Contracts are a species of companies",
      "definition": "B. Companies presuppose contracts as an institution C. Both contracts and companies are institutions in the service of private autonomy"
    },
    {
      "term": "EU labour law is regulated by primary and secondary law. Secondary law in this area is mostly made up of:A. RegulationsB. DirectivesC. Decisions",
      "definition": "B. Directives"
    },
    {
      "term": "The EU Charter of Fundamental Rights became legally binding in 2009. How is it relevant for European Labour Law?A. It contains explicit protection for certain labour rights, such as collective bargaining, collective action, and right to information within the undertakingB. It contains articles protecting freedom of expression, freedsom of assembly, and equality between men and women, which are relevant in labour law situationsC. It regulates the relationship between labour rights and the freedom of movementD. The Charter doesn't apply to labour law situations",
      "definition": "A. It contains explicit protection for certain labour rights, such as collective bargaining, collective action, and right to information within the undertaking B. It contains articles protecting freedom of expression, freedsom of assembly, and equality between men and women, which are relevant in labour law situations"
    },
    {
      "term": "Which of the following alternatives are part of the important so-called 'restructuring' Directives that were adopted in the 1970s? A. The Collective Redundancies Directive (98/59/EC)B. Temporary Agency Work Directive (2008/104/EC)C. Posting of Workers Directive (96/71/EC)D. The Employer Insolvency Directive (2008/94/EC)E. The Transfers of Undertakings Directive (2001/23/EC)",
      "definition": "A. The Collective Redundancies Directive (98/59/EC) D. The Employer Insolvency Directive (2008/94/EC) E. The Transfers of Undertakings Directive (2001/23/EC)"
    },
    {
      "term": "The (2001/23/EC) Transfers of Undertakings Directive regulates some aspects of employment protection. A transfer of an undertaking does not in itself constitute grounds for dismissal, but does not stand in the way of dismissals due to economic, technical or organisational reasons.A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "The important Laval judgment (Case C-341/05) from the Court of Justice of the European Union deals with posting of workers, the right to industrial action and ... A. ... the freedom to provide servicesB. ... the freedom of establishmentC. ... the free movement of capital",
      "definition": "A. ... the freedom to provide services"
    },
    {
      "term": "The aim of the (96/71/EC) Posted Workers Directive is to enable the free movement of persons and services and to provide protection for workers in the case of the posting of workers and the transnational provision of services.A. FalseB. True",
      "definition": "B. True"
    },
    {
      "term": "Which of the following EU labour law directives regulate different forms of flexible work? Please select all that apply.A. Temporary Agency Work Directive (2008/104/EC)B. Part-Time Work Directive (97/81/EC)C. Fixed-Term Work Directive (99/70/EC)D. Employer Insolvency Directive (2008/94/EC)E. Posted Workers Directive (96/71/EC)",
      "definition": "A. Temporary Agency Work Directive (2008/104/EC) B. Part-Time Work Directive (97/81/EC) C. Fixed-Term Work Directive (99/70/EC)"
    },
    {
      "term": "The (97/81/EC) Part-Time Work Directive, the (99/70/EC) Fixed-Term Work Directive and the (2008/104) Temporary Agency Work Directive provide protection for employees through a specific principle, which? Several answers could be correct.A. The principle of mutual recognitionB. The principle of of legal certaintyC. The principle of non-discriminationD. The principle of equal treatment",
      "definition": "C. The principle of non-discrimination D. The principle of equal treatment"
    },
    {
      "term": "The EU mainstreaming approach as regards gender equality and non-discrimination means that the EU in all its activities and policies must aim to eliminate inequalities, to promote equality between men and women and to combat discrimination.A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "What does the following definition refer to: 'a situation where an apparently neutral provision, criterion or practice would put persons of one sex at a particular disadvantage compared with persons of the other sex, unless that provision, criterion or practice is objectively justified by a legitimate aim, and the means of achieving that aim are appropriate and necessary' A. Direct discrimination on grounds of ageB. Indirect discrimination on grounds of sexC. Indirect discrimination on grounds of ageD. Direct discrimination on grounds of sex",
      "definition": "B. Indirect discrimination on grounds of sex"
    },
    {
      "term": "Is it a breach of EU law for member states to tax at a higher rate dividends distributed to non-residents taxpayers?A. There is a risk such measure would infringe article 63 TFEU, the free movement of capital, which forbids restrictions on capital.B. It is not a breach since the principle of subsidiarity allows a member state to levy a tax for non-residents and not at the same time levy it on residents.C. The member state can levy a tax at a higher dividends distributed on non-residents as long as the tax is equal for all non-residents.",
      "definition": "A. There is a risk such measure would infringe article 63 TFEU, the free movement of capital, which forbids restrictions on capital."
    },
    {
      "term": "Which tax is levied on the most mobile tax basis?A. Individual Income TaxB. Corporate Income TaxC. VAT",
      "definition": "B. Corporate Income Tax"
    },
    {
      "term": "Why are VAT and indirect taxes harmonized?A. Since it is a tax levied by the EUB. Since Member States' membership fee is partly based on the custom duties and VATC. Since Member State need to cooperate rather than to compete on tax base allocation",
      "definition": "B. Since Member States' membership fee is partly based on the custom duties and VAT"
    },
    {
      "term": "Which of the following sources of law deal with taxes on the internal market?A. Article 28 TFEUB. Article 31 TFEUC. Article 4 TEUD. Article 6 TFEU",
      "definition": "A. Article 28 TFEU B. Article 31 TFEU C. Article 4 TEU"
    },
    {
      "term": "At which level of government are taxes decided upon?A. European UnionB. National GovernmentsC. Local Governments",
      "definition": "A. European Union B. National Governments"
    },
    {
      "term": "Do you think it is possible for a member state to tax at a higher rate dividens distributed to non-resident tax payers?A. YesB. NoC. It depends",
      "definition": "C. It depends"
    },
    {
      "term": "The TFEU obliges Member States to equalize their domestic taxes with that of other States.A. TrueB. False",
      "definition": "B. False"
    },
    {
      "term": "Corporate income tax is a tax on capital (in the economic sense of it) and is levied on a highly mobile tax basis, especially due to the free movement of capital in the EU.A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "Why is environmental law relevant to the study and application of European business law?A. It overlaps with internal market lawB. There is no relevanceC. It is international law that overrides EU law",
      "definition": "A. It overlaps with internal market law"
    },
    {
      "term": "'Environmental protection always overrides free movement provisions in the EU legal context'. Consider this statement and answer whether you think it is: A. TrueB. FalseC. Dependant on the legal nature of the environmental protection measure",
      "definition": "C. Dependant on the legal nature of the environmental protection measure"
    },
    {
      "term": "Pursuant to the Brussels I Regulation, a person domiciled within an EU Member State (MS) can be sued in matters relating to tort in the MS where he/she is domiciled.A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "Pursuant to the Brussels I Regulation, a person domiciled within an EU Member State (MS) can be sued in matters relating to tort in the MS where the harmful event occurred.A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "Pursuant to the Brussels I Regulation, where can a person domiciled within an EU Member State (MS) be sued in matters relating to tort?A. Either in the Member State where the harmful event occurred or the Member State where he/she is domiciled, at the choice of the plaintiffB. A person must be sued in the Member State where he/she is domiciledC. A person must be sued in the Member State where the harmful event occurred",
      "definition": "A. Either in the Member State where the harmful event occurred or the Member State where he/she is domiciled, at the choice of the plaintiff"
    },
    {
      "term": "A judgment given in an EU Member State must be recognized by the other Member States even when they find it manifestly contrary to their public policy.A. FalseB. True",
      "definition": "A. False"
    },
    {
      "term": "Following EU Member States have been granted special standing regarding the EU private international law rules:A. SwedenB. DenmarkC. Italy",
      "definition": "B. Denmark"
    },
    {
      "term": "The main rule of Rome II Regulation refers to the law of the country where:A. The damage occursB. The harmful act was committedC. None of the above",
      "definition": "A. The damage occurs"
    },
    {
      "term": "Even if an EU conflict rule refers to the law of a non-member state, the conflict rule must be followed.A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "A Spanish company and a French company have entered into a contract regarding research and development cooperation. The contract stipulates that it is governed by German law. This choice is of law valid.A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "Can some of the provisions of the Treaty on the Functioning of the European Union have a direct impact on the Private International Law of the Member States?A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "Does EU law, as it is today, cover the whole Private International Law of the Member States?A. TrueB. False",
      "definition": "B. False"
    },
    {
      "term": "The value of trademarks is decreasing in today's society. A. FalseB. True",
      "definition": "A. False"
    },
    {
      "term": "EUIPO plays an important role as regards to the development of European trademark law. Which of the following is a correct description as to what EUIPO has as its principle task?A. EUIPO is a not-for profit non-governments organisation that encourages the development of Community wide Intellectual Property Rights.B. EUIPO acts as first instance as regards trademark infringements on the European level.C. EUIPO is an EU-institution that developed autonomous policies as regards European Trademark Law.D. EUIPO is the EU Institution that governs the system of community rights and registers community Trademarks (and Community Designs).",
      "definition": "D. EUIPO is the EU Institution that governs the system of community rights and registers community Trademarks (and Community Designs)."
    },
    {
      "term": "Are there any limitations regarding the lifespan of a trademark?A. Yes, 50 years.B. No.C. Yes, 20 years.",
      "definition": "B. No."
    },
    {
      "term": "It is necessary to consider both preliminary judgements from the ECJ on one hand and administrative decisions from EUIPO, the General Court and the ECJ on the other to fully understand EU trademark law.A. FalseB. True",
      "definition": "B. True"
    },
    {
      "term": "A first question as to regards trademark protection is to define what a trademark is, or to put it differently, what kind of signs that may be afforded protection. In the new trademark directive (EU) 2015/2436 there are a number of prerequisites that a sign must meet to be allowed protection. Which of the following is not a prerequisite for trademark protection?A. The signs must be capable of being represented on the register in a manner which enables the competent authorities and the public to determine the clear and precise subject matter of the protection afforded to its proprietor.B. The signs must be used in the course of trade.C. The signs must be capable of distinguishing the goods or services of one undertaking from those of other undertakings",
      "definition": "B. The signs must be used in the course of trade."
    },
    {
      "term": "All signs cannot constitute trademarks and there are consequently several grounds for refusal of a trademark registration. In article 3(1) c it is stated that a sign may not constitute a trademark if the sign consists exclusively of indications which may serve, in trade, to designate e.g. the kind, quality, quantity, of the goods. Which of the following is a correct description as to how article 3(1)c is to be applied and understood? A. As soon as there is something indicating a descriptive element a sign cannot constitute a trademark Article 3(1)c only applies in relation to word marks. B. The lack of distinctiveness that is indicated in article 3(1)c may be cured by use and acquired distinctiveness. C. The wording of article 3(1)c speaks of signs that exclusively consist of descriptive elements. This means that there is no ground for refusal as soon as the sign also consists of some additional element.",
      "definition": "B. The lack of distinctiveness that is indicated in article 3(1)c may be cured by use and acquired distinctiveness."
    },
    {
      "term": "Which of the following is a prerequisite for an infringement according to article 5 trademark directive? (Check all that apply) A. The use in question is not descriptive. B. The use in question has to be performed within 5 years from the day of registration. C. The use gives result to a likelihood of confusion. D. The use regards use of any sign which is identical with a protected trademark in relation to goods or services which are identical with those for which the trade mark is registered.",
      "definition": "C. The use gives result to a likelihood of confusion. D. The use regards use of any sign which is identical with a protected trademark in relation to goods or services which are identical with those for which the trade mark is registered."
    },
    {
      "term": "The \"double identity\" rule provides the proprietor with a right to prevent any sign which is identical with the trademark in relation to any goods or services. A. TrueB. False",
      "definition": "B. False"
    },
    {
      "term": "What does degeneration mean? A. That a trademark shall be revoked if, in consequence of acts or inactivity of the proprietor, it has become the common name in the trade for a product or service in respect of which it is registered. B. That a trademark shall be revoked if the person who registered the trademark in the first place dies and no one else within the company takes over the registration. C. That a trademark shall be revoked if it is not being used",
      "definition": "A. That a trademark shall be revoked if, in consequence of acts or inactivity of the proprietor, it has become the common name in the trade for a product or service in respect of which it is registered."
    },
    {
      "term": "Which (one or several) of the following IPR-related exercises requires vigilance by a dominant company?A. Territorial allocation for its distributors.B. Resale price maintenance (RPM - establishing licensee's sales price) in licensing relations.C. Refusal to license essential facility.",
      "definition": "A. Territorial allocation for its distributors. B. Resale price maintenance (RPM - establishing licensee's sales price) in licensing relations. C. Refusal to license essential facility."
    },
    {
      "term": "Is it possible to divide the royalty payment obligation to relate partly to the patent, a TM and the know-how and thereby secure payments even if the patent should be invalidated?A. YesB. No",
      "definition": "B. No"
    },
    {
      "term": "An invention has to be absolutely new in order to receive patent protection. How do you prevent that your own patent application becomes an obstacle to patent applications in other countries? Several alternatives may apply). A. You select the countries where you want protection and file your applications at the same date in all these countries. B. If you file your subsequent patent applications within a twelve months period, you will be entitled to priority from the first national application. C. By filling a PCT application you actually obtaining a single filing date in all designated countries and thereby avoid that one application disturbs the other.",
      "definition": "B. If you file your subsequent patent applications within a twelve months period, you will be entitled to priority from the first national application. C. By filling a PCT application you actually obtaining a single filing date in all designated countries and thereby avoid that one application disturbs the other."
    },
    {
      "term": "Is the following statement correct? When determining novelty the invention must be described in a single prior document, whereas when considering inventive step reference can be made to several documents which hints at the invention.A. IncorrectB. Correct",
      "definition": "B. Correct"
    },
    {
      "term": "At what stage is it optimal to apply for patent protection? A. Once the final product has been established but before a competitor has been able to destroy the novelty. B. Once the product is introduced on the market. C. Never. Don't apply. It is costly, shortlived and easy to circumvent. Rather keep it dead secret.",
      "definition": "A. Once the final product has been established but before a competitor has been able to destroy the novelty."
    },
    {
      "term": "In order to address harmful practices related to industrial property rights, the Commission will apply:A. A European patent misuse principle.B. European competition law principles.",
      "definition": "B. European competition law principles."
    },
    {
      "term": "The EU Patent Regulation has been agreed and is awaiting final ratification. Is it true that the newly established Unified Patent Court will decide on infringement procedures?A. NoB. Yes",
      "definition": "B. Yes"
    },
    {
      "term": "May a licensor who has granted a license to its invention as well as any future development require that the licensee assigns his development to the licensor?A. NoB. Yes",
      "definition": "A. No"
    },
    {
      "term": "Could novelty be destroyed by a non-scientific article? A. YesB. No",
      "definition": "A. Yes"
    },
    {
      "term": "Can the German patentee prevent importation of his patented protected product sold by his licensee in Spain from being imported into Germany?A. YesB. No",
      "definition": "B. No"
    },
    {
      "term": "How is the relationship between national and EU competition law?A. EU law usually takes precedence.B. National law usually takes precedence.",
      "definition": "A. EU law usually takes precedence."
    },
    {
      "term": "Is it necessary to establish both the relevant product and geographic marketto enable a full assessment of the likely effect or not within a particular market?A. NoB. Yes",
      "definition": "B. Yes"
    },
    {
      "term": "Which are the three main rules that collectively make up the substantive rules in EU competition law?A. The national competition lawsB. Article 102 TFEUC. The EU merger regulationD. Regulation 1/2003E. Article 101 TFEU",
      "definition": "B. Article 102 TFEU C. The EU merger regulation E. Article 101 TFEU"
    },
    {
      "term": "Which of the following can typically be found at the start of a competition law investigation in the EU?A. A decision by an EU court.B. A decision by the European Commission.C. A decision by a national competition authority.D. A decision by a national court.",
      "definition": "B. A decision by the European Commission."
    },
    {
      "term": "What are some of the benefits of competition?A. Increased competition benefits the consumer by offering more, different and cheaper products.B. Someone is able to establish a monopoly which is beneficial in terms of the financial outcomes for the company.",
      "definition": "A. Increased competition benefits the consumer by offering more, different and cheaper products."
    },
    {
      "term": "What are the elements that must be fulfilled to establish a breach of Article 101?A. The agreement, concerted practice or decision by an association must have the object or effect of distorting competition in the internal market.B. The agreement, concerted practice or decision by an association must be made in secret to harm customers.C. An undertaking or an association of undertakings must be involved.D. There must be an effect on trade between EU Member States",
      "definition": "A. The agreement, concerted practice or decision by an association must have the object or effect of distorting competition in the internal market. C. An undertaking or an association of undertakings must be involved. D. There must be an effect on trade between EU Member States."
    },
    {
      "term": "EU competition law can only be applied to entities which are recognized as companies in a member State. True or false? A. TrueB. False",
      "definition": "B. False"
    },
    {
      "term": "An agreement within the meaning of EU competition law requires a written or at least legally binding agreement between the parties. True or false?A. FalseB. True",
      "definition": "A. False"
    },
    {
      "term": "Article 101(3) provides a 'legal exception' to the prohibition in Article 101(1). Which of the following constituent elements must be satisfied for the application of Article 101(3) TEFU? A. An agreement must contribute to improving the production or distribution of goods or to promoting technical or economic progress. B. An agreement must not impose on the undertakings concerned restrictions which are not indispensable to the attainment of these objectives. C. An agreement must not afford such undertakings the possibility of eliminating competition in a substantial part of the products in question. D. An agreement must allow consumers a fair share of the resulting benefit.",
      "definition": "A. An agreement must contribute to improving the production or distribution of goods or to promoting technical or economic progress. B. An agreement must not impose on the undertakings concerned restrictions which are not indispensable to the attainment of these objectives. C. An agreement must not afford such undertakings the possibility of eliminating competition in a substantial part of the products in question. D. An agreement must allow consumers a fair share of the resulting benefit."
    },
    {
      "term": "An agreement is void under Article 101(2) TFEU if: A. It is fulfilling the conditions of Article 101(1) TFEU and not fulfilling the conditions of Article 101(3) TFEU. B. It is fulfilling the conditions of Article 101(1) TFEU.",
      "definition": "A. It is fulfilling the conditions of Article 101(1) TFEU and not fulfilling the conditions of Article 101(3) TFEU."
    },
    {
      "term": "How can the conditions of 101(3) TFEU be described best?A. An exception for agreements which restrict competition only a bit, so-called agreements of minor importance or de minimus agreements.B. An exception for agreements which bring about efficiency.C. An exception for agreements that do not restrict competition.",
      "definition": "B. An exception for agreements which bring about efficiency."
    },
    {
      "term": "What is the aim of the merger regulation?A. To address anticompetitive mergers.B. To prevent the take-over of EU business by foreign firms.C. To foster the emergence of big companies",
      "definition": "A. To address anticompetitive mergers."
    },
    {
      "term": "What was possibly one of the most important aims of the 'new' Regulation 1/2003? A. To ensure effective enforcement by decentralizing the application of competition law, so that EU competition law could also be applied at the national level and the Commission could focus on more serious infringements. B. To enact a new regulation before the old regulation came to its deadline so as to ensure the continuation of effective enforcement for the years beyond 2001 C. To ensure a fair procedure for companies.",
      "definition": "A. To ensure effective enforcement by decentralizing the application of competition law, so that EU competition law could also be applied at the national level and the Commission could focus on more serious infringements. B. To enact a new regulation before the old regulation came to its deadline so as to ensure the continuation of effective enforcement for the years beyond 2001"
    },
    {
      "term": "What is the maximum level of fines the Commission is able to impose on an infringing company under the current framework for setting fines? A. 10 % of the total profits in the preceding business year. B. 100.000 Euros. C. 100.000.000 Euros. D. 10% of the total turnover in the preceding business year.",
      "definition": "D. 10% of the total turnover in the preceding business year."
    },
    {
      "term": "When is a company dominant within the meaning of EU competition law? A. When a company in the EU has a market share that is higher than its two closest competitors. B. When a company holds a strong market position in more than half of EU member states. C. When a company in the context of its business dealings is telling others what to do. D. When a company's market position is so strong that it can behave independently of its customers.",
      "definition": "D. When a company's market position is so strong that it can behave independently of its customers."
    },
    {
      "term": "Which of the following abuses is typically not considered to be exclusionary?A. Exclusive dealing.B. Exclusionary discounts and rebates.C. Refusal to supply.D. Excessive pricing.E. Tying and bundling.F. Predatory pricing.",
      "definition": "D. Excessive pricing."
    },
    {
      "term": "Which law regulates mergers in the EU?A. Regulation 139/2004B. The TFEUC. Regulation 1/2003",
      "definition": "A. Regulation 139/2004"
    },
    {
      "term": "What are the three conditions set out in the Regulation that need to be fulfilled to intervene in a merger? A. Concentration. B. Significantly impediment of effective competition in particular through creating or strengthening of a dominant position. C. An anticompetitive agreement between two companies. D. EU dimension.",
      "definition": "A. Concentration. B. Significantly impediment of effective competition in particular through creating or strengthening of a dominant position. D. EU dimension."
    },
    {
      "term": "What is the one-stop shop under the EU merger regulation? A. A place where you can buy everything in one stop. B. A place where you can hand in your notification and it will be distributed to all the relevant authorities. C. The European Commission, so there is no need to notify elsewhere.",
      "definition": "C. The European Commission, so there is no need to notify elsewhere."
    },
    {
      "term": "When is a merger harmful to competition?A. Where the merger leads to an increased level of competition.B. Where the merger creates a dominant position.C. Where the merger lessens competition significantly.",
      "definition": "B. Where the merger creates a dominant position. C. Where the merger lessens competition significantly."
    },
    {
      "term": "Which power of the following powers does the European Commission not have within the current enforcement framework? A. Wiretap phones of the companies involved. B. Conduct sector inquiries. C. Request information for the companies involved in proceedings. D. Conduct dawn-raids/inspections. E. Take witness statements.",
      "definition": "A. Wiretap phones of the companies involved."
    },
    {
      "term": "What is the role of the Court in competition proceedings in the EU? A. The Court reviews the European Commission's decision in EU competition proceedings. B. The Court issues warrants for dawn raiding companies suspected of infringing EU competition law. C. The Court imposes fines on companies that infringed EU competition law.",
      "definition": "A. The Court reviews the European Commission's decision in EU competition proceedings."
    },
    {
      "term": "The Commission may by decision impose fines on undertakings and associations of undertakings where, either intentionally or negligently:(a) they infringe Article 101 or Article 102 of the Treaty; or(b) they contravene a decision ordering interim measures under Article 8; or(c) they fail to comply with a commitment made binding by a decision pursuant to Article 9.For each undertaking and association of undertakings participating in the infringement, the fine shall not exceed 10 % of its total turnover in the preceding business year.Where the infringement of an association relates to the activities of its members, the fine shall not exceed 10 % of the sum of the total turnover of each member active on the market affected by the infringement of the association.True or false? A. False B. True",
      "definition": "B. True"
    },
    {
      "term": "What could never be considered an undertaking under Article 107 TFEU?A. The State itselfB. A company run by the StateC. A private undertakingD. A municipal body which providesservices",
      "definition": "A. The State itself"
    },
    {
      "term": "What is the main characteristic of EU State aid control?A. It is legalB. It is politicalC. It is economicD. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "Which is the supervisory body in State aid procedure?A. The Member State's competition authorityB. The European CommissionC. The European CouncilD. The Council",
      "definition": "B. The European Commission"
    },
    {
      "term": "What are the consequences of a negative decision in State aid?A. The aid must be repaidB. The decision to pay the aid is invalidC. The payments must stop but the recipient can keep the paid amountsD. They normally carry no real effect",
      "definition": "A. The aid must be repaid"
    },
    {
      "term": "How do we define an 'undertaking' in Article 107(1) TFEU? A. Companies registered in an EU Member StateB. An entity engaging in economic activity regardless of its legal status or how it is financedC. Registered companies, regardless of where they are registeredD. Privately owned limited companies",
      "definition": "B. An entity engaging in economic activity regardless of its legal status or how it is financed"
    },
    {
      "term": "What are the consequences for the application of Article 107 TFEU if the State acted like a normal, private investor?A. There is no State aid in the meaning of Article 107(1) TFEUB. The State must reimburse only parts of the aid EUC. The State must repay the aid itselfD. The aid is considered legal by the Commission, which has to deliver a positive decision",
      "definition": "A. There is no State aid in the meaning of Article 107(1) TFEU"
    },
    {
      "term": "What provision in the Treaties regulates services of general economic interest?A. Article 106 TFEUB. Article 107 TFEUC. Article 108 TFEUD. None of the above. It's only case law of the Court of Justice",
      "definition": "A. Article 106 TFEU"
    },
    {
      "term": "Which of the following is not part of the four main principles of EU public procurement rules?A. Cost-effectivenessB. Non-discriminationC. Procedural fairnessD. TransparencyE. Open competition",
      "definition": "A. Cost effectiveness"
    },
    {
      "term": "Which steps are relevant for a typical procurement procedure under the EU public procurement law?A. Standstill periodB. Debriefing of the partiesC. Submission of bids only until a deadlineD. Publication on the TED",
      "definition": "A. Standstill period B. Debriefing of the parties C. Submission of bids only until a deadline D. Publication on the TED"
    },
    {
      "term": "A national law of Factoria (an imagined EU member state) stipulates that owners of fishing vessels registered in Factoria must be resident in that member state. Non-Nationals of Factoria are much less likely to be resident in Factoria than nationals, so the practice puts non-nationals at a disadvantage, and so it is likely to be indirectly discriminatory on grounds of nationality. What does this mean? A. That the national law breaches EU law. B. That the national law will breach EU law unless Factoria can show that the difference of treatment is justified on grounds allowed by the Treaties.",
      "definition": "B. That the national law will breach EU law unless Factoria can show that the difference of treatment is justified on grounds allowed by the Treaties."
    },
    {
      "term": "Why is the EU service directive a very important directive in the EU? A. The directive introduces important tools that ease the administrative burdens in cross-border situations. B. The service directive is in fact not that important it is the freedoms to provide services within the meaning of Articles 56 to 62 that is important. C. Because it helps the consumer is identifying relevant services in the EU.",
      "definition": "A. The directive introduces important tools that ease the administrative burdens in cross-border situations."
    },
    {
      "term": "Which of the following statements are true? A. The procedure for the conclusion of international agreements is regulated by article 218 TFEU B. The Council initiates the procedure of concluding new international agreements. C. The Commission shall approve the opening of negotiations, adopt negotiating directives, authorize the signing of agreements and conclude them.",
      "definition": "A. The procedure for the conclusion of international agreements is regulated by article 218 TFEU"
    },
    {
      "term": "Which law regulates the Commission's enforcement procedure in competition proceedings relating in particular to cartel and abuse of dominance investigations? A. The European Merger Regulation (only relevant regarding mergers) B. Article 101 and 102 TFEU (does not regulate the procedure but contains the substantive prohibitions C. Council Regulation 1/2003.",
      "definition": "C. Council Regulation 1/2003."
    },
    {
      "term": "What are the legal reasons that the EU cannot exclude environmental or social considerations? A. The demands of the Member StatesB. Article 7 to Article 14 TEUC. Article 7 to Article 14 TFEU",
      "definition": "C. Article 7 to Article 14 TFEU"
    },
    {
      "term": "Do Member States still have the opportunity to limit the provision of services by foreign service providers? A. Yes, but only in a non-discriminatory way where an overriding reason of general interest justifies the restriction. B. Yes, this is the essence of a nation's ability to self-determine its local rules. C. No, this is contrary to the free movement of services.",
      "definition": "A. Yes, but only in a non-discriminatory way where an overriding reason of general interest justifies the restriction."
    },
    {
      "term": "The Transfers of Undertakings, Collective Redundancies, and Employer Insolvency Directives are often referred to as...A. Restructuring directivesB. Restructuring regulationsC. Restructuring rulesD. Restructuring notes",
      "definition": "A. Restructuring directives"
    },
    {
      "term": "The Council is also commonly called A. the Council of the European UnionB. the Council of MinistersC. A and B are correctD. A and B are incorrect",
      "definition": "C. A and B are correct"
    },
    {
      "term": "All states have a private and a public sector, the public sector is financedby...A. TaxB. DonationC. GovernmentD. Individuals",
      "definition": "A. Tax"
    },
    {
      "term": "What is a document that allows the owners to demonstrate their ownership on the goods?A. Sea waybillB. Transport documentC. Consignment noteD. Bill of lading",
      "definition": "D. Bill of lading"
    },
    {
      "term": "Is European Union citizenship status established by Article 20 TFEU?A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "What TEU is abbreviated for?A. Treaty of the Europe UnificationB. Treaty of the European UnitC. Treaty of the European Utility D. Treaty on the European Union",
      "definition": "D. Treaty on the European Union"
    },
    {
      "term": "Which version of TFEU - Treaty on the Functioning of the European Union - is currently agreed by member states?A. Maastricht versionB. Amsterdam versionC. Lisbon versionD. Nice version",
      "definition": "C. Lisbon version"
    },
    {
      "term": "Companies and contracts related by both contracts and companies are institutions in the service of private autonomy.A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "\"Territorial allocation for its distributors in licensing relations is an IPR-related exercise requiring vigilance by a dominant company\". How do you think about this statement?A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "In most countries in Europe, motorcyclists are allowed to travel on motorways, but people on mopeds are not. This is a clear difference in treatment. What is the correct statement for this situation?A. There is no discrimination. Because there are substantial objective differences between motorcycles and mopeds in terms of speed.B. It is discrimination.C. There is no discrimination because the treatment is decided by every country in the EU.D. There is no correct answer",
      "definition": "A. There is no discrimination. Because there are substantial objective differences between motorcycles and mopeds in terms of speed."
    },
    {
      "term": "Why unifying international law is deemed particularly important?A. Because the law of the same country is applied regardless of in which member state the dispute is adjudicated.B. Because the judgments given by a court of a member state are recognized and enforced in the other member states.C. A and B are correct.D. A and B are incorrect.",
      "definition": "C. A and B are correct."
    },
    {
      "term": "From which viewpoint that taxes can be classified?A. GDPB. IncomeC. Economic, legal or tax policyD. All are not correct",
      "definition": "C. Economic, legal or tax policy"
    },
    {
      "term": "What does the Information and Consultation Directive purpose to do?A. This directive is to establish a general framework which sets out minimum requirements for the right to information and consultation of employees.B. This directive is to establish a detailed framework which sets out celling requirements for the right to information and consultation of employees.C. This directive is to establish the right to information and consultation of employers.D. None of the answers is correct",
      "definition": "A. This directive is to establish a general framework which sets out minimum requirements for the right to information and consultation of employees."
    },
    {
      "term": "The so-called Rome Treaty is the name of the original treaty which later set the background for:A. TEUB. TFEUC. TEU and TFEUD. It is another treaty",
      "definition": "C. TEU and TFEU"
    },
    {
      "term": "A copyright protects the rights of__A. creators of derivative works for an indefinite period of time.B. creators of original works for an indefinite period of time. C. creators of derivative works for a defined period of time. D. creators of original works for a defined period of time.",
      "definition": "D. creators of original works for a defined period of time."
    },
    {
      "term": "What is not a condition set out in the Regulation that need to be fulfilled to intervene in a merger?A. An anticompetitive agreement between two companies.B. EU dimension.C. Significantly impediment of effective competition in particular through creating or strengthening of a dominant position.D. Concentration.",
      "definition": "A. An anticompetitive agreement between two companies."
    },
    {
      "term": "Is legal certainty called a fundamental principle of union law?A. TrueB. FalseC. There has no principle named legal certainty in the union lawD. None of the answers is correct",
      "definition": "A. True"
    },
    {
      "term": "The council is made up ofA. All are correctB. MinistersC. EU's statesD. Heads of States or Governments.",
      "definition": "B. Ministers"
    },
    {
      "term": "Is EU labour law mostly regulated in and mostly made up of regulations?A. YesB. No",
      "definition": "B. No"
    },
    {
      "term": "The principle of proportionality has been adopted from... and it is applied in all fields of EU law.A. French lawB. Scotland lawC. UK lawD. German law",
      "definition": "D. German law"
    },
    {
      "term": "What has been described as being the DNA of EU law and the cornerstone on which European integration is built?A. All are correctB. principle of proportionalityC. The principle of transparencyD. The principle of non-discrimination",
      "definition": "D. The principle of non-discrimination"
    },
    {
      "term": "Who is company's stakeholders?A. All are correctB. CreditorC. EmployeesD. Shareholders",
      "definition": "A. All are correct"
    },
    {
      "term": "The legal certainty principle can be used in...A. Two different ways, both as a tool for interpretation and as a standard of judicial review.B. One way, which is to secure the transparency of the lawC. Three ways, which is a tool for interpretation, a standard of judicial review and a tool for resolving disputesD. None of the answers is correct",
      "definition": "A. Two different ways, both as a tool for interpretation and as a standard of judicial review."
    },
    {
      "term": "Most EU publications are available online?A. TrueB. Flase",
      "definition": "A. True"
    },
    {
      "term": "Are taxes the result of a voluntary decision by individualsA. No. They're imposed on taxpayers by national political decisions of parliament and other political subdivisionsB. Yes. Taxes are voluntary agreements between individuals.C. Yes. Because the nature of taxes is depending on the honesty of individuals.D. None of the provided answers is correct",
      "definition": "A. No. They're imposed on taxpayers by national political decisions of parliament and other political subdivisions"
    },
    {
      "term": "Is treating importers of liquors less favourably than those of table wine discriminatory? A. YesB. No. Table wine is more profitable, so its producers are required to be treated with more favours.C. No. Because liquors are more harmful than table wine so we should treat them less favourably to discourage the use of these.D. There is no correct answer",
      "definition": "A. Yes"
    },
    {
      "term": "Flexicurity is aboutA. Combining flexibility for employersB. Security for employeesC. A and B are correctD. A and B are incorrect",
      "definition": "C. A and B are correct"
    },
    {
      "term": "The free movement of services is one of the fundamental treaty freedoms regulated in Article 56 of the Treaty of the Functioning of the European UnionA. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "The benefits of competition that consumers may receive is... A. Offering more products with cheaper priceB. In crease a monopoly and outcomes of the companiesC. The products in the market will be variously enrichedD. More promotions between competitors will benefit consumers",
      "definition": "A. Offering more products with cheaper price C. The products in the market will be variously enriched D. More promotions between competitors will benefit consumers"
    },
    {
      "term": "Is it correct that the charter of fundamental rights was proclaimed in Nice on the 7th of December 2000 and became legally binding in the same year?A. Yes, it is correctB. No. The charter of fundamental rights was proclaimed in Nice on the 7th of December 2000. However, it became legally binding only in December 2009, when the Lisbon treaty entered into force.C. No. The charter of fundamental rights was proclaimed in Nice and become legally binding on the 7th of December 2000.D. None of the provided answers is correct",
      "definition": "B. No. The charter of fundamental rights was proclaimed in Nice on the 7th of December 2000. However, it became legally binding only in December 2009, when the Lisbon treaty entered into force."
    },
    {
      "term": "The aim of the (96/71/EC) Posted Workers Directive is to enable the free movement of persons and services and to provide protection for workers in the case of the posting of workers and the transnational provision of services.A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "Resale price maintenance (RPM - establishing licensee's sales price) in licensing relations is an IPR-related exercise requiring vigilance by a dominant company. What is your identification about this?A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "Is it true that the current version of the TEU and TFEU contain very much of the old original treaty? A. True. The current version of the TEU and TFEU still contain very much of the old original treatyB. False. Both TEU and TFEU are significantly different from the original versionsC. False. Only TFEU is different from the original versionsD. False. Only TFEU is significantly different from the original versions",
      "definition": "A. True. The current version of the TEU and TFEU still contain very much of the old original treaty"
    },
    {
      "term": "The Common Foreign and Security Policy (CFSP) is an integral part of the Common Security and Defense Policy (CSDP)?A. TrueB. False",
      "definition": "A. True"
    },
    {
      "term": "The flexibilisation of the labour market has led to an increase in...A. fixed-term workB. Temporary agency workC. Self-employmentD. All are correct",
      "definition": "D. All are correct"
    },
    {
      "term": "EU's Regulations must be transposed by the national legislator into the national legal order.A. TrueB. False",
      "definition": "B. False"
    },
    {
      "term": "Is treating traders in lamb meat less favourably than traders discriminatory?A. YesB. NoC. It requires more information to decide on the case but generally, there is no discriminationD. There is no correct answer",
      "definition": "C. It requires more information to decide on the case but generally, there is no discrimination"
    },
    {
      "term": "\"Patent protection is more important in industries with long lifecycles, like pharmaceutical industry, than the opposite like, for example the mobile telephone industry.\"A. This statement is correctB. This statement is incorrect",
      "definition": "A. This statement is correct"
    },
    {
      "term": "Refusal to license an essential facility is an IPR-related exercise requiring vigilance by a dominant company. Is it correct?A. YesB. No",
      "definition": "A. Yes"
    },
    {
      "term": "Which transport service falls under the general Treaty provisions on the free movement of service?A. TrainB. Air transportC. Road transportD. Inland waterways",
      "definition": "A. Train C. Road transport D. Inland waterways"
    },
    {
      "term": "The significance of the principle of non-discrimination can be seen in: A. It permeates every aspect of EU lawB. It binds both the EU and all its institutionsC. It binds the member states and it can even bind private parties within the member statesD. All are correct",
      "definition": "D. All are correct"
    },
    {
      "term": "If the national system might not be in line with the provisions of EU law.A. Yes. Since EU rights and obligations very often are dependent on a national system.B. No. Since the principle of legal certainty require that the national system must be in line with the provisions of EU law.C. Yes. This is the principle of EU law.D. No answer is correct",
      "definition": "A. Yes. Since EU rights and obligations very often are dependent on a national system."
    },
    {
      "term": "What are the criteria governing the refusal of registration for lack of distinctiveness?A. Generic TermsB. Descriptive SignsC. All of others are correctD. Letters, Numerals and Basic Geometrical Shapes",
      "definition": "C. All of others are correct"
    },
    {
      "term": "Who will elect the European Parliament?A. Member countries of the EUB. The head of statesC. the citizens of the EUD. The UN",
      "definition": "C. the citizens of the EU"
    },
    {
      "term": "The institutions of the EU identified in Article 13 TEU include the European Parliament, the European Council, the European Commission, the Council, the Court of Justice of the European Union and...A. the European Central BankB. the Court of AuditorsC. the European Central Bank and the Court of AuditorsD. none of the answers is correct",
      "definition": "C. the European Central Bank and the Court of Auditors"
    },
    {
      "term": "Which of the following statements accurately depicts copyright law?A. A copyright protects an invention that is original.B. It protects not an expression, but actual ideas and facts.C. It protects the functional and utilitarian aspects of a product.D. It protects inventors rather than authors.E. It protects original, creative expression.",
      "definition": "E. It protects original, creative expression."
    },
    {
      "term": "What was one of the main features of the Treaty of Maastricht?A. The Court of Justice of the EU was established.B. The European Union was established. C. It established a European Constitution.D. The Charter of Fundamental Rights was adopted.",
      "definition": "B. The European Union was established."
    },
    {
      "term": "Which of the following is the correct definition as provided by the EU Commission for the combination of the relevant market?A. A relevant geographic market comprises the area in which the firms concerned are involved in the supply of products or services and in which the conditions of competition are sufficiently homogeneous.B. A relevant product market comprises all those products and/or services which are regarded as similar or substitutable by the consumer by reason of the products' target group, fabric and intended use.C. A relevant product market comprises all those products and/or services which are regarded as provided in an area in which the firms concerned or retailer are located and in which the conditions of competition are sufficiently homogeneous.D. None of the provided answers is correct.",
      "definition": "A. A relevant geographic market comprises the area in which the firms concerned are involved in the supply of products or services and in which the conditions of competition are sufficiently homogeneous."
    },
    {
      "term": "What are some of the functions and roles of the European Commission?(Check all that apply) | It oversees the practice of the other institutions of the EU, such as the Council. | It acts as the \"Guardian of the Treaties\". | It sets out general guidelines for EU policies. | It proposes new Legislation.",
      "definition": "It acts as the \"Guardian of the Treaties\". | It proposes new Legislation."
    },
    {
      "term": "Following concerns from animal rights campaigners in several member states about the cruelty of seal hunting, and following the introduction by a number of member states of rules prohibiting or limiting the marketing of seal meat and other seal products, the EU introduced a Regulation banning the import of seal meat and other products made from seals. The legal basis for the Regulation was Article 114 TFEU. Several organizations representing seal hunters and traders in seal products brought an action before the Court of Justice of the EU challenging this Regulation, on the grounds that the it breached the principle of conferral, as the EU did not have competence to ban the import of seal products. You are a lawyer advising the EU institutions. What is your advice? | Argue that the measure is necessary for the proper regulation of the internal market. | Argue that the measure is necessary for the functioning of the internal market. | Admit that the EU is wrong and that the Regulation should be invalidated. | Argue that animal welfare is a legitimate interest of both the member states and of the EU, and therefore the EU has competence to legislate where this is necessary to achieve a high standard of animal welfare.",
      "definition": "Argue that the measure is necessary for the functioning of the internal market."
    },
    {
      "term": "According to an EU directive, the Member States shall take the measures necessary to ensure that every worker is entitled to paid annual leave of at least four weeks.Emma Larsson works for a private employer who refuses to grant her the said four weeks of annual leave, since she has been on sick leave during the better part of the past year.According to the national applicable law, a company only has to grant paid annual leave to employees who have actually been working during at least half of the reference period (constituting the past year). However, said national law also stipulates that certain absences, such as those due to maternity leave or work-related accidents, shall count as periods of actual work for the purposes of calculating the length of paid leave that an employee is entitled to. Emma's employer claims that her sick leave cannot count as a period of actual work and that she has, hence, not actually worked for the minimum period of time required for her to be granted paid annual leave.Can Emma force her employer to grant her the four weeks of paid annual leave that is stipulated in the EU directive? | Yes, since the national law should be given an EU conform interpretation, her sick leave should be counted as periods of actual work. | No, but she could possibly sue the Member State where she is working for damages, since the Member State has not implemented the Directive correctly.",
      "definition": "Yes, since the national law should be given an EU conform interpretation, her sick leave should be counted as periods of actual work."
    },
    {
      "term": "Even if a trademark right exists a third party shall, under certain circumstances, be allowed to use the trademark. Which of the following is allowed regarding usage of a trademark, in the course of trade? (Check all that apply) | More or less all types of trademark use is allowed, as long as it is in accordance with honest practices in industrial or commercial matters. | It is allowed to use a competitor's trademark where it is necessary to indicate the intended purpose of a product or service. | It is allowed to use one's own name in commercial information | It is allowed to use a competitors name and address in commercial information. | It is allowed to use a competitor's trademark in order to benefit from the goodwill of the competitors trademarks. | It is allowed to use a competitor's trademark in keyword advertising in order to inform potential costumers about an offer to sell products that are confusingly similar to the products provided by the competitor.",
      "definition": "It is allowed to use a competitor's trademark where it is necessary to indicate the intended purpose of a product or service. | It is allowed to use one's own name in commercial information."
    },
    {
      "term": "A trademark infringement may be defined as an unauthorised use of a trademark. However, in order for such use to be regarded as infringing a trademark right there are a number of prerequisites that have to be fulfilled. Which of the following is a prerequisite for an infringement according to article 5 trademark directive? (Check all that apply) | The use in question is not descriptive. | The use regards use of any sign which is identical with a protected trademark in relation to goods or services which are identical with those for which the trade mark is registered. | The use in question has to be performed within 5 years from the day of registration. | The use gives result to a likelihood of confusion.",
      "definition": "The use regards use of any sign which is identical with a protected trademark in relation to goods or services which are identical with those for which the trade mark is registered. | The use gives result to a likelihood of confusion."
    },
    {
      "term": "The relevant market combines the product market and the geographic market, which of the following is the correct definition as provided by the EU Commission? | A relevant product market comprises all those products and/or services which are regarded as interchangeable or substitutable by the consumer by reason of the products' characteristics, prices and intended use. | A relevant product market comprises all those products and/or services which are regarded as similar or substitutable by the consumer by reason of the products' target group, fabric and intended use. | A relevant geographic market comprises the area in which the firms concerned are involved in the supply of products or services and in which the conditions of competition are sufficiently homogeneous. | A relevant product market comprises all those products and/or services which are regarded as provided in an area in which the firms concerned or retailer are located and in which the conditions of competition are sufficiently homogeneous.",
      "definition": "A relevant product market comprises all those products and/or services which are regarded as interchangeable or substitutable by the consumer by reason of the products' characteristics, prices and intended use. | A relevant geographic market comprises the area in which the firms concerned are involved in the supply of products or services and in which the conditions of competition are sufficiently homogeneous."
    }
  ]
}
