{
  "quizSrc": [
    {
      "term": "According to recent Crowdtap and Forbes surveys, people said which of the following most influenced consumers' purchase decisions? | People they follow on social media | Professional networks | Bloggers | Family and friends",
      "definition": "Family and friends"
    },
    {
      "term": "Which of the following are the 4 C's of Social? | Communications, Concentration, Concurrence & Curating | Communications, Community, Content & Concurrence | Content, Connecting, Community & Curating | Content, Community, Concentration & Communications",
      "definition": "Content, Connecting, Community & Curating"
    },
    {
      "term": "In Judy Franks' interview, she discusses Five Global Truths That Make Sense of a Messy Media World. Which of the following is a truth she noted? | Certainty: Every medium has a specific function/utility with limited overlap. | Selection: Heavy users of certain media tend to be light users of others. | Circuits: Media circuits are now open and in the hands of engaged consumers. | Linear: Content travels from Point A to Point B with limited disruption.",
      "definition": "Circuits: Media circuits are now open and in the hands of engaged consumers."
    },
    {
      "term": "Which of the following is a reason why marketers are having so much trouble adapting to a new media ecosystem? | You need to develop media separately because they do not overlap. | Analog marketers are thriving in the new ecosystem. | Media platforms need to be liberated from silos. | Media is the most important part of social and its impact on marketing.",
      "definition": "Media platforms need to be liberated from silos."
    },
    {
      "term": "Which of the following is a megatrend needed to develop social marketing strategies that grow market share and maximize results and profits for our organization? Check all that apply. (This question has multiple answers) | Develop your professional networks | Develop a holistic view of social | Every medium has a specific function/utility with limited overlap | Return to analog marketing | Think real-time",
      "definition": "Develop your professional networks | Develop a holistic view of social | Think real-time"
    },
    {
      "term": "What is the difference between social networks at the top of the social pyramid and virtual communities at the bottom of it? | Social networks are more popular, so they are at the top of the social pyramid. | Virtual communities are much larger than social networks like Facebook and RenRen. | Social networks are where the really deep discussions are taking place. | Social networks are where people connect with people and virtual communities are where people connect with companies. | Social networks have shallow, quick conversations on a topic, whereas virtual communities have deeper and more long-term discussions of a topic.",
      "definition": "Social networks have shallow, quick conversations on a topic, whereas virtual communities have deeper and more long-term discussions of a topic."
    },
    {
      "term": "Which of the following principles will help you succeed in managing change in social? Check all that apply. (This question has multiple answers) | Add new sites immediately to catch any potential buzz. | Classify sites by their function. | Only add sites when they are popular to your target audiences. | Focus only on sites containing your high-value markets.",
      "definition": "Focus only on sites containing your high-value markets. | Only add sites when they are popular to your target audiences. | Classify sites by their function."
    },
    {
      "term": "Why are thought leaders important for your organization? | They really aren't important to develop for most organizations. | Thought leaders think deeper thoughts, so they are like philosophers. | Thought leaders are likely our competitors and we need to keep track of them. | They are influencers who have significant numbers of followers, and one positive mention from them will impact the people you want to attract.",
      "definition": "They are influencers who have significant numbers of followers, and one positive mention from them will impact the people you want to attract."
    },
    {
      "term": "Which of the following are characteristics of social networks? Check all that apply. (This question has multiple answers) | The creators of social networks are entrepreneurs who want to eventually monetize their site. | Social networks are created to link members together as families, friends or colleagues to allow for conversation and the exchange of pictures. | Many social networks start by focusing on communication. Then, after they grow, they add some type of revenue generation device like advertisements to raise revenues. | Most social networking sites are created by members who also manage them.",
      "definition": "The creators of social networks are entrepreneurs who want to eventually monetize their site. | Social networks are created to link members together as families, friends or colleagues to allow for conversation and the exchange of pictures. | Many social networks start by focusing on communication. Then, after they grow, they add some type of revenue generation device like advertisements to raise revenues."
    },
    {
      "term": "Which of the following statements is true about virtual communities? Check all that apply. (This question has multiple answers) | The creators of virtual communities are entrepreneurs who want to eventually monetize their site. | Most virtual communities are created by members who also manage them. | Conversations are deep and focused on subjects of interest to the members. | Virtual community members want to address their needs to express their passions or address a life event.",
      "definition": "Most virtual communities are created by members who also manage them. | Conversations are deep and focused on subjects of interest to the members. | Virtual community members want to address their needs to express their passions or address a life event."
    },
    {
      "term": "In a community, what is the role of the influencer? | Influencers want to be experts but don't have the time to do it themselves. | Influencers connect community experts with community members to spread key information throughout the community. | Influencers like to take controversial positions to draw attention to themselves. | Influencers want to dominate discussions within the community.",
      "definition": "Influencers connect community experts with community members to spread key information throughout the community."
    },
    {
      "term": "Which of the following are true of passion communities? | People join passion communities to learn from experts who have been there before. | People are driven to passion communities by life events such as retirement or getting married. | Passion communities address an internal need of ours, and we seek them because we want to. | Passion communities are a temporary need and we grow out of them quickly.",
      "definition": "Passion communities address an internal need of ours, and we seek them because we want to."
    },
    {
      "term": "As an organization, what is important when we want to engage a trigger event community? | We need to always keep up with the current trends and quickly provide them to our members. | We need to encourage peer-to-peer discussions to let members talk to each other. | These communities have permanent members who will always want to talk about the newest trends and community gossip. | These communities are on a mission and want to hear from experts who have the solutions they need.",
      "definition": "These communities are on a mission and want to hear from experts who have the solutions they need."
    },
    {
      "term": "As an organization, what is important when we want to engage a passion community? Check all that apply. (This question has multiple answers) | Passion communities are always seeking the newest trends, so we will need to keep up to remain relevant to our members. | We need to encourage peer-to-peer discussions to let members talk to each other about trends and important topics. | Members will quickly leave a passion community once they \"grow up.\" | Community members don't want to talk to each other - they want expertise.",
      "definition": "We need to encourage peer-to-peer discussions to let members talk to each other about trends and important topics. | Passion communities are always seeking the newest trends, so we will need to keep up to remain relevant to our members."
    },
    {
      "term": "Did you sign up for the social networking sites like Twitter, LinkedIn, or whatever is appropriate for your country? | ",
      "definition": "for the social networking sites like Tw"
    },
    {
      "term": "Did you sign up for social tracking sites like is.gd, or whatever is appropriate for your country? | ",
      "definition": "for the social networking sites like Tw"
    },
    {
      "term": "In social Big Data a \"document\" refers to: | any writing that is generated by a word processor. | any single entry or posting on any type of social media. | a portion of an entry containing important analysis information. | an application programming interface.",
      "definition": "any single entry or posting on any type of social media."
    },
    {
      "term": "A paragraph within a blog article would be considered a/an: | document | snippet | SocialGist | API",
      "definition": "snippet"
    },
    {
      "term": "APIs (automatic programming interface) are used for what purpose? | To extract social data in real-time from a social site. | To standardize the connection of learning systems with external service tools. | Microblogging within social networks. | Generating discussion about social media.",
      "definition": "To extract social data in real-time from a social site."
    },
    {
      "term": "When thinking about your professional persona, which of the following recommendations should you consider? (This question has multiple answers) | What happens on the internet, stays on the internet. | If something is free, you are the product. | Somebody is always trying to figure out who you are, what you do and what your future might hold. | In order to capitalize on the potential of collection social data, it is important to know what the various tools do, but not how they actually work.",
      "definition": "What happens on the internet, stays on the internet. | If something is free, you are the product. | Somebody is always trying to figure out who you are, what you do and what your future might hold."
    },
    {
      "term": "Which of the following text analytics terms is used to describe how people on social \"feel\" about a topic? | Categories | Intentions | Themes/Topics | Sentiment",
      "definition": "Sentiment"
    },
    {
      "term": "Which of the following is a common mistake companies make when trying social monitoring systems? | Companies use APIs to extract social data in real-time from a social site. | Companies follow communities and groups associated with their product or service type. | Companies assume communities are referring to them by name. | Companies search for nicknames, initials or abbreviations when using social monitoring systems.",
      "definition": "Companies assume communities are referring to them by name."
    },
    {
      "term": "Regardless of the market you want to monitor, discussions on social are typically about which of the following: (This question has multiple answers) | Organizations, including your company and your competition. | Topics of interest to the community. | Key people in these organizations. | Products and services.",
      "definition": "Organizations, including your company and your competition. | Topics of interest to the community. | Key people in these organizations. | Products and services."
    },
    {
      "term": "When is it important to use a \"for fee\" social analytics system? | When you want to explore a certain country | When you want a word cloud | When you want to analyze a certain language | When you need to analyze a topic over a period of time",
      "definition": "When you need to analyze a topic over a period of time"
    },
    {
      "term": "Sentiment accuracy is difficult to ascertain on which level? | Social | Snippet | Mention | Document",
      "definition": "Document"
    },
    {
      "term": "Social monitoring is used for which of the following? (This question has multiple answers) | Developing personal brands | Real-time marketing | Crisis management | Developing social strategies",
      "definition": "Developing personal brands | Real-time marketing | Crisis management | Developing social strategies"
    },
    {
      "term": "The \"Give to Get\" mantra involves which types of actions? | Giving your influencers a list of topics and categories you would like them to post about. | Sharing tweets, blogs, and other media of your influencers with a positive tone. | Giving constructive criticism to influencers and members of the community when they post something. | Paying extra fees to free social monitoring services to get enhanced capabilities.",
      "definition": "Sharing tweets, blogs, and other media of your influencers with a positive tone."
    },
    {
      "term": "How does Taco Bell deal with their more \"passionate fans\" on social media? | They pay their most influential fans to share advertisements on their profiles. | They bypass this group to focus on more traditional advertising campaigns. | They create a relationship with them and announce their latest products to these followers first. | They hire them as social media consultants.",
      "definition": "They create a relationship with them and announce their latest products to these followers first."
    },
    {
      "term": "When using social monitoring to manage crisis, at which point has the issue been detected too late? | At the second posting | At the first posting | Twitter and Facebook | When it appears on the news or in print",
      "definition": "When it appears on the news or in print"
    },
    {
      "term": "Which of the following would be the best application for engagement marketing? | Expensive products which require a long decision and financing process, such as buying a new car. | Products which provide several options or choices within a brand. | Commodity or impulse products or products with a short selling process. | Products that do not have a specific target market.",
      "definition": "Commodity or impulse products or products with a short selling process."
    },
    {
      "term": "Which of the following is social strategies used by organizations focuses on growing social audiences and attracting people to social assets? | Engagement Marketing | Product placement marketing | Social IMC | Nurture marketing",
      "definition": "Engagement Marketing"
    },
    {
      "term": "What is the success of Engagement Marketing measured in? | Leads turned to prospects | Social metrics, such as followers and likes | Bottom-line business metrics; Return-on-investment | Sales metrics",
      "definition": "Social metrics, such as followers and likes"
    },
    {
      "term": "What type of engagement marketing strategy involves reaching a target market with content that is so \"awesome,\" those who access it will tell all of their friends about it? | Nurture marketing | Going viral | Long selling process | Social IMC",
      "definition": "Going viral"
    },
    {
      "term": "Which of the following statements is true of anonymous relationships with a target market? | Companies communicate with these relationships individually. | Companies will use a database to track these individual relationships. | Companies can communicate with them using a social handle. | Anonymous relationships are typically cultivated in Nurture or Social IMC strategies.",
      "definition": "Companies can communicate with them using a social handle."
    },
    {
      "term": "The social site Upworthy found that viral content occurs when you address three parameters. Which of the following is NOT one of those parameters? | The content must be meaningful to the target market. | The content must be visual. | The content must be unique and something they have not seen before. | The content must blend in with other common marketing.",
      "definition": "The content must blend in with other common marketing."
    },
    {
      "term": "Nurture Marketing is designed to develop which of the following? | Anonymous likes and follows on social media | A community-minded focus | Only first engagement opportunities | A 1-to-1 sales relationship with social visitors.",
      "definition": "A 1-to-1 sales relationship with social visitors."
    },
    {
      "term": "Which of the following is true about Embrace Marketing? Check all that apply: (This question has more than one correct answer) | The Nurture Marketing and Social IMC strategies are two types of Embrace Marketing. | Database-driven, long-term relationships are common with Embrace Marketing. | Short-term, anonymous relationships are common with Embrace Marketing. | Embrace is an acronym that stands for Empowering Brand Activated Community Engagement.",
      "definition": "The Nurture Marketing and Social IMC strategies are two types of Embrace Marketing. | Database-driven, long-term relationships are common with Embrace Marketing. | Embrace is an acronym that stands for Empowering Brand Activated Community Engagement."
    },
    {
      "term": "Which of the following are the most important questions to ask in a Nurture Marketing strategy? Check all that apply. (This question has more than one correct answer) | \"Where are you in the product purchase lifecycle?\" | \"How many likes and follows have we generated?\" | \"How many emails would you like to receive?\" | \"Who are you?\"",
      "definition": "\"Where are you in the product purchase lifecycle?\" | \"Who are you?\""
    },
    {
      "term": "After acquiring registration and email information from prospects, a company should NOT do which of the following? | Database the user's email and registration information. | Observe users using their web, social sites, and private virtual communities. | Engage users in real-time marketing. | Send daily emails about their products and services in order to generate sales.",
      "definition": "Send daily emails about their products and services in order to generate sales."
    },
    {
      "term": "Which of the following is typically a feature of the landing page? Check all that apply. (This question has more than one correct answer) | Knowledgebase data fields | High impact sales copy | Social links to like or follow | Company logo and title",
      "definition": "High impact sales copy | Social links to like or follow | Company logo and title | Knowledgebase data fields"
    },
    {
      "term": "Which of the following will help ensure future success when collecting knowledgebase data? Check all that apply. (This question has more than one correct answer) | Companies should send registrants a follow-up email invitation to access your relevant content, ensuring accuracy of their email address. | Companies should attach a tracking cookie to allow them to understand their market segment and current point in the product purchase lifecycle. | Companies should not include opt-outs so that every registrant will get the same emails. | Companies should keep it short and simple. The more information they ask for, the more registrants they will lose.",
      "definition": "Companies should send registrants a follow-up email invitation to access your relevant content, ensuring accuracy of their email address. | Companies should attach a tracking cookie to allow them to understand their market segment and current point in the product purchase lifecycle. | Companies should keep it short and simple. The more information they ask for, the more registrants they will lose."
    },
    {
      "term": "Which of the following statements best describes a filter and focus blog? | The blog filters through one particular expert's writings and re-hashes them for quicker consumption. | The blog filters through all of the readable information on the topic and focuses on the most complex and intricate information on the subject for only the most well-informed readers. | The blog author(s) filter through various subjects and markets and focus on different markets and topics each week. | The blog author(s) filters through all of the relevant content from the experts on a subject and narrows it down to the most timely, relevant, and credible information and recommendations.",
      "definition": "The blog author(s) filters through all of the relevant content from the experts on a subject and narrows it down to the most timely, relevant, and credible information and recommendations."
    },
    {
      "term": "Which of the following are important in creating effective, impactful blog posts? Check all that apply. (This question has more than one correct answer) | Clean formatting | Formal, complex words and jargon | Relevant topic | Images | Catchy headlines",
      "definition": "Clean formatting | Relevant topic | Images | Catchy headlines"
    },
    {
      "term": "When formatting a blog article, which of the following is NOT recommended? | Bulleted and numbered lists | Using short headers and sub-headers | Long paragraphs that explore topics in depth. | Bold and italics to add emphasis and draw attention",
      "definition": "Long paragraphs that explore topics in depth."
    },
    {
      "term": "What information should be included in a successful filter and focus blog article? Check all that apply. (This question has more than one correct answer) | A way to contact you | Topics specifically involving what is successful in the target market | Unbiased, summaries of information from the experts | Relevant and actionable recommendations",
      "definition": "A way to contact you | Unbiased, summaries of information from the experts | Relevant and actionable recommendations"
    },
    {
      "term": "What are the three main choices marketers have in spending their time and money? | Public, private, and open media | Owned, leased, and coopted media | Paid, owned, and earned media | Paid, free, and split-cost media",
      "definition": "Paid, owned, and earned media"
    },
    {
      "term": "Marketing pundits and agencies mostly agree that marketers should \"pay as little as you can, own as much as you can, and earn positive social mentions.\" What unsolvable questions does this riddle still pose? Check all that apply. | What if social becomes obsolete? | Who can simply rely on the behavior of others? | What if you build it and they don't come? | How much exactly is \"pay a little\"?",
      "definition": "Who can simply rely on the behavior of others? | What if you build it and they don't come? | How much exactly is \"pay a little\"?"
    },
    {
      "term": "Why has paid media become so expensive given all of the options available today? Shouldn't paid media prices have declined? | Audiences to any single media occurrence are larger than they used to be. | When you have to buy advertising a la carte as opposed to in bulk, prices will be lower. | The supply of mass media has increased. | The supply of mass media has declined.",
      "definition": "The supply of mass media has declined."
    },
    {
      "term": "In IMC's rethinking of traditional marketing approaches, which of the following would be the logical first step in the P/O/E media strategy? | Find out who you are trying to reach. | Find out when in a customer's journey it is most appropriate to engage. | Find out what messages and incentives to provide. | Find out where your marketing and content materials should be distributed.",
      "definition": "Find out who you are trying to reach."
    },
    {
      "term": "Which type of advertising is intended to motivate an immediate action? | Analog advertising | Stunting/Visibility advertising | Persuasion/Big Brand advertising | Direct response advertising",
      "definition": "Direct response advertising"
    },
    {
      "term": "Which type of advertising is intended to change awareness or perceptions in order to influence future behavior? | Persuasion/Big Brand advertising | Stunting/Visibility advertising | Direct response advertising | Analog advertising",
      "definition": "Persuasion/Big Brand advertising"
    },
    {
      "term": "Which type of advertising is intended to gain notice from key people? | Persuasion/Big Brand advertising | Analog advertising | Stunting/Visibility advertising | Direct response advertising",
      "definition": "Stunting/Visibility advertising"
    },
    {
      "term": "When using Facebook-style advertising, we've referred to \"the Funnel.\" At which stage in the funnel is it easiest to achieve your goal? | The bottom of the funnel | After the funnel process is complete | The mid-funnel | The top of the funnel",
      "definition": "The bottom of the funnel"
    },
    {
      "term": "In a response marketing process, what should marketers do after first identifying their specific goal? | Scale out your marketing plan. | Throw everything against the wall and see what sticks. | Take what's working and make it better. | Find the things that work the best, and find out what is making it work.",
      "definition": "Throw everything against the wall and see what sticks."
    },
    {
      "term": "Social IMC Strategy involves which of the following strategies? | Social IMC is designed to foster anonymous relationships with people who companies can communicate with using a social handle. | Social IMC is designed to market commodity or impulse products or products with a short selling process. | Social IMC is designed to embrace a high-value market you want to develop and take them to a private virtual community you develop specifically for them. | Social IMC is designed to immediately capitalize on short-term interest from likes and website clicks.",
      "definition": "Social IMC is designed to embrace a high-value market you want to develop and take them to a private virtual community you develop specifically for them."
    },
    {
      "term": "To be successful, a Social IMC strategy must contain which of the following? Check all that apply. | Excellent, engaging content | General information on the target market that is easily found elsewhere on the web | Links to external sites or communities with engaging content and information | An empowering concept that will transition a high-value market over to the private virtual community",
      "definition": "Excellent, engaging content | An empowering concept that will transition a high-value market over to the private virtual community"
    },
    {
      "term": "What actions are necessary in developing an empowering concept? Check all that apply. | Create the tool, event, or device that will help the community. | Identify the mission of the community. | Identify additional services that will keep the members coming back. | Develop marketing ads to sell products to users.",
      "definition": "Create the tool, event, or device that will help the community. | Identify the mission of the community. | Identify additional services that will keep the members coming back."
    },
    {
      "term": "In the Social IMC strategy, what roles can products play in a private virtual community? Check all that apply. | A product can be an outlier for the community members. | A product can be an enabler for the community members. | A product can be an enhancer for the community members. | A product can be an extra for the community members.",
      "definition": "A product can be an enabler for the community members. | A product can be an enhancer for the community members. | A product can be an extra for the community members."
    },
    {
      "term": "Which of the following are proven success tips when using Social IMC strategy? Check all that apply. | The virtual community should be holistic and serve all functions of the target market. | Private virtual communities can be created by invitation. | Social IMC allows you to vet your incoming members. | Never stop selling to your members.",
      "definition": "Private virtual communities can be created by invitation. | Social IMC allows you to vet your incoming members."
    },
    {
      "term": "Which of the following areas are effective targets for applying the Social IMC strategy? Check all that apply. | Member-created virtual communities | Private, controlled discussion with community members | Audiences resistant to social marketing efforts | Highest-value markets",
      "definition": "Private, controlled discussion with community members | Highest-value markets | Audiences resistant to social marketing efforts"
    },
    {
      "term": "If your high-value market is easy to target as they move through a purchase lifecycle, which marketing strategy gives you trackability, lower cost, and sales focus? | Engagement Marketing | Social IMC | Nurture Marketing | Analog Marketing",
      "definition": "Nurture Marketing"
    },
    {
      "term": "For lower-value markets, which marketing strategy allows you to keep them interested and makes you a strong contender when they are ready to buy? | Nurture Marketing | Social IMC | Engagement Marketing | Analog Marketing",
      "definition": "Engagement Marketing"
    },
    {
      "term": "If you have a commodity product like soap, which marketing strategy would be the most effective? | Engagement Marketing | Social IMC | Nurture Marketing | Analog Marketing",
      "definition": "Engagement Marketing"
    },
    {
      "term": "Which of the following performance metrics are used in Engagement Marketing? Check all that apply. | Number of opens or views of content | Growth in likes | Click-throughs to blogs and websites | Revenues and profits",
      "definition": "Number of opens or views of content | Growth in likes | Click-throughs to blogs and websites"
    },
    {
      "term": "Which of the following performance metrics can be used in Embrace Marketing? Check all that apply. | Revenues, investments, and profits | Social break-even and ROI numbers | Growth in likes | Number of opens or views of content",
      "definition": "Revenues, investments, and profits | Social break-even and ROI numbers | Growth in likes | Number of opens or views of content"
    },
    {
      "term": "What is the purpose of the performance funnel? | The performance funnel is a process used in A/B split tests. | The performance funnel is used to manage social monitoring in times of crisis. | The performance funnel filters through all of the relevant content on a subject and narrows it down to the most relevant information to create content for your engagement marketing. | The performance funnel is designed to track a relationship with a consumer from start to finish within a marketing channel.",
      "definition": "The performance funnel is designed to track a relationship with a consumer from start to finish within a marketing channel."
    },
    {
      "term": "In the performance funnel, you will notice that, with each successive step, consumers... | decrease in number | increase in number | make more purchases | provide more personal information",
      "definition": "decrease in number"
    },
    {
      "term": "The percentage or other measure that is calculated based on the fall-off between two successive steps in the performance funnel is known as... | Social IMC | Key Performance Indicator | Brand Activated Community Engagement | Return on Investment",
      "definition": "Key Performance Indicator"
    },
    {
      "term": "Why is testing the effectiveness of a marketing strategy important? Check all that apply. | Testing is low cost. | Testing ensures that actual performance with not vary from key performance indicators (KPIs). | Testing is simple and easy. | Testing is real and provides feedback coming directly from your target markets.",
      "definition": "Testing is low cost. | Testing is simple and easy. | Testing is real and provides feedback coming directly from your target markets."
    },
    {
      "term": "When is head-to-head testing used? | When only two options are being tested against one another | When a small number of consumers are being tested | When the business or marketer has no control over who is being contacted | When the business or marketer can control who is being contacted",
      "definition": "When the business or marketer can control who is being contacted"
    },
    {
      "term": "When are A/B Split tests used? | When the business or marketer can control who is being contacted | When the business or marketer has no control over who is being contacted | When only two options are being tested against one another | When a small number of consumers are being tested",
      "definition": "When the business or marketer has no control over who is being contacted"
    },
    {
      "term": "When considering data generated through our use of social sites, which of the following statements about \"privacy\" concerns is/are accurate? Check all that apply. | Privacy involves concerns from users who feel they need to provide more personal information to you. | Privacy involves concerns that the relationships we are developing on social are controlled by us and used in appropriately by community managers. | Privacy involves the concern of the individual that the information and behavioral data they have supplied is used appropriately by you. | Privacy involves concerns over whether personal data provided by users is safe and secure within your site.",
      "definition": "Privacy involves concerns that the relationships we are developing on social are controlled by us and used in appropriately by community managers. | Privacy involves the concern of the individual that the information and behavioral data they have supplied is used appropriately by you."
    },
    {
      "term": "In discussing security, privacy, and governance, Seth Redmore discussed \"progressive profiling.\" Which of the following statements is an attributes of \"progressive profiling\"? | Progressive profiling involves a government or territory monitoring companies on social based on their size and worth. | Progressive profiling involves interaction between a company and government and territories, and the varying laws that differ from place to place. | Progressive profiling involves a company taking user behavior and information, running analytics on it, and selling leads to another company. | Progressive profiling involves an exchange of value between a company and consumer, such as name and email from the consumer resulting in a free white paper from the company.",
      "definition": "Progressive profiling involves an exchange of value between a company and consumer, such as name and email from the consumer resulting in a free white paper from the company."
    },
    {
      "term": "Which of the following members of an organization are security professionals who already have an open dialogue with the Board or CEO on data security? | Reactors | Representatives | Protectors | Influencers",
      "definition": "Influencers"
    },
    {
      "term": "Which of the following would be included in a fully integrated marketing plan? Choose all that apply. | Social | Promotions | Direct Response | Content syndication",
      "definition": "Social | Promotions | Direct Response | Content syndication"
    },
    {
      "term": "When using metrics to measure success in social, which of the following would be most appropriate for measuring the success of the content syndication of a video? Choose one. | Raw number or views or shares. | Measuring return on investment | Measuring the cost for a click | Cost per complete view",
      "definition": "Cost per complete view"
    },
    {
      "term": "What is a present-day framework that explains the current engagement ecosystem, including insight into how social engagement can play an active role? | The Customer Decision Journey | Loyalty Loop | AIDA Model, or \"The Funnel\" | Customer Engagement Engine",
      "definition": "Customer Engagement Engine"
    },
    {
      "term": "The metric for Amplification measures what? | Number of comments or replies per post | A measure of how appealing your post is | Overall engagement rate | A measure of viral reach or how much your content has inspired your social audience to share it",
      "definition": "A measure of viral reach or how much your content has inspired your social audience to share it"
    },
    {
      "term": "What are performance funnels? | Performance funnels track the number of to clicks that result in shares. | Performance funnels track the price per click. | Performance funnels track a company's success in securing customer data and performance behavior. | Performance funnels track the consumer journey from total market to product purchase.",
      "definition": "Performance funnels track the consumer journey from total market to product purchase."
    },
    {
      "term": "In MOOC 2, we provided you with a number of social analytics tools. What did you learn about the importance of hashtags and keywords in building your professional persona? | ",
      "definition": "OOC 2, we provided you with a number of"
    },
    {
      "term": "There were a number of assignments designed to build your influence by engaging with your high value markets using different types of professional social sites [LinkedIn, Google+, Twitter, etc.]. From these experiences, let us know the following: 1. How many followers did you grow over the last few months on LinkedIn? 2. How many groups did you engage with on LinkedIn? 3. How many followers did you engage in Google +? 4. How many professional communities did you engage with on Google+? 5. What other social sites did you develop for your professional persona? 6. What other community sites did you develop for your professional persona? | ",
      "definition": "OOC 2, we provided you with a number of"
    },
    {
      "term": "Throughout the MOOCs, you were asked to tweet to both our Social Media Marketing twitter site, to me [@RandyHlavac] and to your professional target markets.1. How many Twitter followers did you grow for your professional and social media marketing targets? 2. What did you enjoy or learn from your Tweeting experiences?3. Will you continue them after MOOC 5 ends? | ",
      "definition": "OOC 2, we provided you with a number of"
    },
    {
      "term": "In MOOC 3 you developed a blog and in MOOC 4 tested and then rolled out your blog to your high value market. From these experiences, answer the following:1. How many readers read your blog? 2. How many comments did you receive? 3. What did you learn from the A/B Message tests? 4. Overall, what did you learn or experience from the blogging assignments? 5. Are you planning to continue blogging after the MOOC specialization? | ",
      "definition": "OOC 2, we provided you with a number of"
    },
    {
      "term": "Starting in MOOC 2, we had you use a variety of free and for-fee social monitoring and analytics tools. They were selected to give you experience with Social Big Data as well as a way to quickly define, understand and engage with your high value markets. Please answer the following:Which tools were the greatest value to you? Which tools were the hardest or least productive to use?Overall, what did you think of this hands-on approach to Social Big Data? Any recommendations for future development? | ",
      "definition": "OOC 2, we provided you with a number of"
    },
    {
      "term": "1. Overall, what did you like best about the entire Specialization [up to the Capstone]? 2. Overall, what are areas we can improve or expand for future learners? 3. What are the actions or areas of activity you will continue after this MOOC ends?4. OPTIONAL: As you know, multi-media - especially video - is an effective way to communicate with others. If you enjoyed the specialization, we would like to ask you for one more thing. Using your smart phone or computer, would you be willing to record a short video - NO MORE THAN 3 MINUTES - which covers the following:A. Your name and, if applicable, your company name B. The city and country where you reside C. 1 - 3 greatest learnings you had from the specializationCreate the video and submit it to us at socialmkting.mooc@gmail.com. We want to hear from you to learn what you liked about the specialization and, if it is short enough, we would like to add it to our private YouTube site to let other learners who are considering the program learn about what you experienced. | ",
      "definition": "OOC 2, we provided you with a number of"
    },
    {
      "term": "Which of the following steps are involved in developing your budget? Choose all that apply. | Develop your staffing costs. | Create performance funnels and establish Key Performance Indicators (KPIs). | Determine your technology costs. | Determine your marketing channels and costs.",
      "definition": "Develop your staffing costs. | Create performance funnels and establish Key Performance Indicators (KPIs). | Determine your technology costs. | Determine your marketing channels and costs."
    },
    {
      "term": "What indicates success has been achieved when calculating the marketing return on investment (MROI) of a program? | The MROI is a negative number. | The MROI is over 100% | The MROI is zero, meaning break even. | The MROI is 50% or better.",
      "definition": "The MROI is over 100%"
    },
    {
      "term": "What are the benefits of a pilot program for a social marketing strategy? Choose all that apply. | It's a way to convince skeptical senior management to at least try the program to see its benefits. | Pilots help identify the risks of the program. | A pilot program allows you to gauge action performance and make adjustments to the program before you commit to a plan. | Pilots help to position your company's community contribution in the minds of your high value market.",
      "definition": "It's a way to convince skeptical senior management to at least try the program to see its benefits. | Pilots help identify the risks of the program. | A pilot program allows you to gauge action performance and make adjustments to the program before you commit to a plan. | Pilots help to position your company's community contribution in the minds of your high value market."
    },
    {
      "term": "Which of the following methods assist is developing a pilot project? Choose all that apply. | Increase the budget of your original plan. | Reduce the breadth or reach of the program. | Reduce the timing of the program. | Reduce the scope of the original plan.",
      "definition": "Reduce the breadth or reach of the program. | Reduce the timing of the program. | Reduce the scope of the original plan."
    },
    {
      "term": "Testing different types of media to determine the ones which reach your target markets in an efficient and effective way is known as ______? | Social pyramid | Maximizing market share | Return on investment | Maturity modeling",
      "definition": "Maximizing market share"
    },
    {
      "term": "Which of the following tips should you follow to keep your communities alive and growing on social? Choose all that apply. | Involve your influencers and community members | Constantly develop and deploy new content. | Monitor influencer reactions and community feedback. | Keep testing performance funnels | Monitor your Key Performance Indicators (KPIs) every day.",
      "definition": "Involve your influencers and community members | Constantly develop and deploy new content. | Monitor influencer reactions and community feedback. | Keep testing performance funnels | Monitor your Key Performance Indicators (KPIs) every day."
    }
  ]
}
