{
  "quizSrc": [
    { "term": "M1-W1", "definition": "Social Media for Business" },
    {
      "term": "Which of the following statements about marketing and advertising are true? Select all that apply. A. If you have a good product, people will automatically find you and buy your product, without a need for marketing B. Advertising and Marketing are different words for the same thing: creating campaigns and putting them in front of the right audience C. Advertising is where the largest portion of the money spent on marketing goes D. Advertising is an important part of marketing",
      "definition": "C. Advertising is where the largest portion of the money spent on marketing goes D. Advertising is an important part of marketing"
    },
    {
      "term": "Which of the following are the most common forms of digital marketing? Select all that apply. A. Search engine optimization B. Print advertising C. Social media marketing D. Email marketing E. Content marketing F. TV commercials G. Display advertising",
      "definition": "ACDEG A. Search engine optimization C. Social media marketing D. Email marketing E. Content marketing G. Display advertising"
    },
    {
      "term": "Which of the following is NOT involved in organic social media marketing? A. Establishing a business profile or a business presence B. Connecting with customers for more individual customer service C. Engaging with users on social media. D. Buying targeted ads to reach potential customers",
      "definition": "D. Buying targeted ads to reach potential customers"
    },
    {
      "term": "Which of the following are types of digital marketing? Select all that apply. A. Display advertising B. Email marketing C. Print advertising D. Content marketing",
      "definition": "A. Display advertising B. Email marketing D. Content marketing Search engine optimization | Social media marketing"
    },
    {
      "term": "When looking at the digital marketing landscape which of the following are types of social media platforms available to users? Select all that apply. A. Publishing platforms B. Sharing platform C. Networking platforms D. Learning management platforms",
      "definition": "A. Publishing platforms B. Sharing platform C. Networking platforms | Discussion platforms | Messaging platforms | Collaboration platforms"
    },
    {
      "term": "Which of the following did Meta acquire to increase connections and communication between Facebook users? A. WhatsApp B. Portal C. Oculus VR D. Instagram",
      "definition": "A. WhatsApp"
    },
    {
      "term": "True or false: Many social media platforms, such as Facebook, offer special tools for non-profit organizations. A. True B. False",
      "definition": "A. True"
    },
    {
      "term": "How does digital marketing differ from traditional marketing? Select all that apply. A. It enables measurements of results B. It can be used to raise brand awareness C. It can be used to target specific audiences",
      "definition": "A. It enables measurements of results C. It can be used to target specific audiences"
    },
    {
      "term": "Which of the following statements is true about Instagram? A. Businesses can grow their brand by paying a small fee to share photos and videos. B. Businesses can directly message their customers by paying a small fee C. Instagram is a visual platform to interact and explore with people looking to connect with businesses",
      "definition": "C. Instagram is a visual platform to interact and explore with people looking to connect with businesses | Businesses can promote content through paid advertisements"
    },
    {
      "term": "Which of the following is true about Social Media Marketing? Select all that apply. A. It is a type of digital marketing B. Its focus is to connect people and provide people the ability to share and create content C. Its focus is to raise brand awareness and generate sales for businesses",
      "definition": "A. It is a type of digital marketing B. Its focus is to connect people and provide people the ability to share and create content"
    },
    {
      "term": "Which of these steps is not at the core of marketing? A. Creating messages related to or promoting the product B. Evaluating and optimizing the impact of your message C. Fielding customer questions, concerns, and feedback and solving technical issues D. Understanding and studying the audience or customers for a product",
      "definition": "C. Fielding customer questions, concerns, and feedback and solving technical issues"
    },
    {
      "term": "Which of the following is NOT a type of digital marketing? A. Display advertising B. Print advertising C. Email marketing D. Content marketing",
      "definition": "B. Print advertising"
    },
    {
      "term": "Which of the following statements is true about Instagram? A. Businesses can grow their brand for free by sharing photos and videos B. Instagram provides free promoted advertisements for businesses C.Instagram allows businesses to directly message their customers for a small fee",
      "definition": "A. Businesses can grow their brand for free by sharing photos and videos"
    },
    {
      "term": "Which of the following statements is true about Instagram? A. Businesses can grow their brand by paying a small fee to share photos and videos. B. Businesses can directly message their customers by paying a small fee C. Instagram is a visual platform to interact and explore with people looking to connect with businesses",
      "definition": "C. Instagram is a visual platform to interact and explore with people looking to connect with businesses"
    },
    {
      "term": "For which of the following reasons do companies use social media? A. Build brand loyalty B. Provide customer service C. Engage with customers D. All of the above",
      "definition": "D. All of the above"
    },
    { "term": "M1-W2", "definition": "Social Media Platforms Part I" },
    {
      "term": "True or False: YouTube directly hires all its video creators to create content for the site A. True B. False",
      "definition": "B. False"
    },
    {
      "term": "Which social media platform(s) has the most powerful targeted advertising software? (Choose all that apply) A. Instagram B. Facebook C. YouTube D. LinkedIn",
      "definition": "A. Instagram B. Facebook"
    },
    {
      "term": "Which social media platform is the best for connecting business to business (B2B) marketers to new customers and followers? A. YouTube B. Instagram C. Facebook D. LinkedIn",
      "definition": "D. LinkedIn"
    },
    {
      "term": "On which social media platform should you set up a business page to reach the largest audience? A. LinkedIn B. Facebook C. YouTube D. Instagram",
      "definition": "B. Facebook"
    },
    {
      "term": "How are Facebook Stories designed to be viewed? A. On the laptop B. Full-screen on the TV C. Full-screen and vertical, on their mobile devices D. In black and white",
      "definition": "C. Full-screen and vertical, on their mobile devices"
    },
    {
      "term": "How can you turn your Page posts into ads? A. By posting a job B. By boosting a post C. By creating an event D. By sharing the post to your Group",
      "definition": "B. By boosting a post"
    },
    {
      "term": "True or false? Youtube is a platform designed for sharing video content. A. True B. False",
      "definition": "A. True"
    },
    {
      "term": "Which one of the following statements about Youtube is correct? A. Youtube is a social network that you can use to upload your personal videos to share them with your family. B. Youtube is a platform with user genertated videos, but it does not feature professional content. C. Youtube stars are people hired by Youtube to create content for their network.",
      "definition": "A. Youtube is a social network that you can use to upload your personal videos to share them with your family."
    },
    {
      "term": "Which one of the following features are available on WhatsApp? A. Send animated GIFs. B. Send messages without SMS plan. C. Share photos and videos. D. Make voice and video calls using data and the internet.",
      "definition": "A. Send animated GIFs. B. Send messages without SMS plan. C. Share photos and videos. D. Make voice and video calls using data and the internet."
    },
    {
      "term": "WeChat is primarily used in which country? A. China B. United States C. India D. France",
      "definition": "A. China"
    },
    {
      "term": "Waht kinds of things can users do throught Wechat? A. Chat with friends. B. Oder dinner to delivered. C. Purchase something they see on the app. D. All of the above.",
      "definition": "D. All of the above."
    },
    {
      "term": "Why should a business create a Mini Program for WeChat? (Choose all that apply) A. Businesses don't have to spend a lot to create a lightweight app for WeChat. B. It lets businesses create simple, fun ways to engage with followers. C. Business with Mini Programs in WeChat don't have to pay taxes. D. Businesses have access to over a billion users on WeChat.",
      "definition": "A. Businesses don't have to spend a lot to create a lightweight app for WeChat. B. It lets businesses create simple, fun ways to engage with followers. D. Businesses have access to over a billion users on WeChat."
    },
    {
      "term": "How can you search for accounts you want to follow on Instagram? A. Like a picture B. Share a video C. Scroll through your feed D. Search by account name, by location, or hashtag",
      "definition": "D. Search by account name, by location, or hashtag"
    },
    {
      "term": "What features can you only access once you convert to a business account on Instagram? A. Insights B. Stickers C, Explore D. Instagram Stories",
      "definition": "A. Insights"
    },
    {
      "term": "How can you turn your posts into ads on Instagram? A. By promoting it B. By sharing it on your story C. By sending it to other people D. By boosting it",
      "definition": "A. By promoting it"
    },
    {
      "term": "What is the major reason why someone would use Linkedln? A. To share photos of their travels B. To grow their professional network and find a new job C. To build a new website D. To create a dream board for their new bussiness",
      "definition": "B. To grow their professional network and find a new job"
    },
    {
      "term": "What are some of the things users can do on Linkedln? (Choose all that apply) A. Connect with the former coworker B. Apply for a job C. Watch a video on how to create an email campaign D. Download music",
      "definition": "A. Connect with the former coworker B. Apply for a job C. Watch a video on how to create an email campaign"
    },
    {
      "term": "How can businesses engage with users on Linkedln? (Choose all that apply) A. Advertise to new demographics both domestically and globally B. Post internal notifications, benefits information, and disseminate paychecks to employees. C. Post meaningful and relevant content for their followers. D. Post job listings and attract new talent.",
      "definition": "A. Advertise to new demographics both domestically and globally C. Post meaningful and relevant content for their followers. D. Post job listings and attract new talent."
    },
    {
      "term": "Meta shares its targeted advertising software and data corpus with which of the following two platforms, in addition to Facebook, which it owns? Choose all that apply. A. Instagram B. WhatsApp C. Twitter D. TikTok",
      "definition": "A. Instagram B. WhatsApp"
    },
    {
      "term": "Meta Ads Manager allows companies to do which of the following when creating an ad? A. Choose a marketing objective that aligns with your goals B. Control how much you spend on advertising C. Target a specific audience D. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "Which feature on Instagram can you use if you want to upload a video longer than 60 seconds? A. Reels B. Boomerang C. Stories D. Instagram Video",
      "definition": "D. Instagram Video"
    },
    {
      "term": "Which feature on Instagram can you use if you want to upload a video longer than 60 seconds? A. Videos B. Stories C. IGTV D. Reels",
      "definition": "C. IGTV"
    },
    { "term": "M1-W2", "definition": "Social Media Platforms Overview" },
    {
      "term": "As a business owner, you'd like to set up a presence on a social media platform where you can network with others in your industry, post news and accomplishments and find potential team members to fill open roles. Which of the following would be an ideal platform? A. Twitter B. Linkedin C. Facebook D. Pinterest",
      "definition": "B. Linkedin"
    },
    {
      "term": "As a business owner, you'd like to set up a presence on a text-based social media platform where you can engage with real-time updates, follow niche interests, and provide real-time customer service on a personal level. Which of the following would be an ideal platform? A. Twitter B. WhatsApp C. Instagram D. Pinterest",
      "definition": "A. Twitter"
    },
    {
      "term": "As a business owner, you'd like to set up a presence on a social media platform where you can post videos and images as well as update customers on upcoming sales, new products, and events. Which of the following would be an ideal platform? A. Facebook B. Twitter C. Linkedin D. Pinterest",
      "definition": "A. Facebook"
    },
    {
      "term": "True or false? Youtube is a platform designed for texting, calling, and sharing. A. True B. False",
      "definition": "B. False"
    },
    {
      "term": "True or false? Youtube is a platform designed for sharing video content. A. True B. False",
      "definition": "A. True"
    },
    {
      "term": "True or False: You have to have an account to get started using TikTok. A. True B. False",
      "definition": "B. False"
    },
    {
      "term": "Which social media platform has a powerful tool called Ads Manager that allows companies to create a specific and targeted ad campaign? A. Facebook B. Twitter C. Pinterest D. LinkedIn",
      "definition": "A. Facebook"
    },
    {
      "term": "Waht is Snapchat's core focus? A. It's a friend-to-friend messaging app B. It's a gaming app C. It's professional photography site D. It's a news site",
      "definition": "A. It's a friend-to-friend messaging app"
    },
    {
      "term": "What are some of the things you can do when creating a Snap? A. Add a Lens that can change your hair color or facial features B. Add a Lens that can change your background C. Take some video of cartoon characters in augmented reality D. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "What are some options for businesses when using Snapchat? (Choose all that apply) A. They can post ads and commercials B. They can create unique content for their audience C. They can create branded Lenses and Filters D. They can use it as a profressional recruiting tool",
      "definition": "A. They can post ads and commercials B. They can create unique content for their audience C. They can create branded Lenses and Filters"
    },
    {
      "term": "When Twitter was created, what was it based on? A. Text messaging B. A video game C. Travel magazines D. News station crawl",
      "definition": "A. Text messaging"
    },
    {
      "term": "How are hashtags used on Twitter? A. They are used to bold or italicize certain words B. They collect all tweets regarding a specific theme or event into one stream C. They just look cool but don't have any meaning D. They link to a website",
      "definition": "B. They collect all tweets regarding a specific theme or event into one stream"
    },
    {
      "term": "How can business use Twitter to engaeg with followers? (Choose all that apply) A. Reply directly to followers and have a coversation B. Set up dedicated customer service accounts C. Use hashtags to bring together followers D. Accept job applications through the platform.",
      "definition": "A. Reply directly to followers and have a coversation B. Set up dedicated customer service accounts C. Use hashtags to bring together followers"
    },
    {
      "term": "True or False: Every message on WhatsApp is automatically encrypted. A. True B. False",
      "definition": "A. True"
    },
    {
      "term": "What is Pinterest's central, unique feature? A. It's based around visual images B. It's an authoriative news site C. It's based around real-time status updates D. It offers streaming music",
      "definition": "A. It's based around visual images"
    },
    {
      "term": "What can a user do when they find a image or a pin? (Choose all that apply) A. Save, or \"pin\", it to a board B. Comment on the pin C. \"Shop\" the contents of the pin D. Repost it to a news feed",
      "definition": "A. Save, or \"pin\", it to a board B. Comment on the pin C. \"Shop\" the contents of the pin"
    },
    {
      "term": "How can business advertise on Pinterest? A. Through promoted pins that slide into user's home feed. B. Through banner ads at the top of the website C. Through pop-up ads. D. Posting comments or direct messaging.",
      "definition": "A. Through promoted pins that slide into user's home feed."
    },
    {
      "term": "Which social media site(s) is best for coders and developers? A. MyFitnessPal B. GitHub C. Stack Overflow D. Letterboxd",
      "definition": "B. GitHub C. Stack Overflow"
    },
    {
      "term": "Which major social media platfrom has the same unified profile for individuals and brands alike? A. Twitter B. Linkedln C. Facebook",
      "definition": "A. Twitter"
    },
    {
      "term": "Which major social media platform has the same unified profile for individuals and brands alike? A. Twitter B. Linkedln C. Facebook",
      "definition": "A. Twitter"
    },
    {
      "term": "TikTok is an app that does what? A. A gaming app B. Features short-form videos C. An app to book travel in China D. A clock and timer app",
      "definition": "B. Features short-form videos"
    },
    {
      "term": "What kinds of videos do users post on TikTok? A. Dance videos B. Short skits C. Hashtag challenges D. All of the above",
      "definition": "A. Dance videos B. Short skits C. Hashtag challenges D. All of the above"
    },
    {
      "term": "How can businesses connect to the TikTok audience? (Choose all that apply) A. Create fun, informal videos B. Create long sales pitches C. Cater to a Gen X or Boomer demographic D. Feature people in their videos",
      "definition": "D. Feature people in their videos"
    },
    {
      "term": "On Twitter, you can purchase advertising packages for which kinds of accounts? (Select all that apply) A. Personal accounts B. Private accounts C. Business accounts",
      "definition": "A. Personal accounts C. Business accounts"
    },
    {
      "term": "On which video social media platform can you find short form videos of 15 and 60 seconds? A. Instagram B. TikTok C. Youtube D. Twitch",
      "definition": "B. TikTok"
    },
    {
      "term": "Which of the following can you do on Messenger? Select all that apply. A. Share photos and videos B. Create group chats C. Play games with friends D. Send encrypted messages",
      "definition": "A. Share photos and videos B. Create group chats C. Play games with friends"
    },
    {
      "term": "True or False: Businesses can use stickers on Instagram stories to encourage viewers to engage directly with the business. A. False B. True",
      "definition": "B. True"
    },
    {
      "term": "True or False: Twitter is one of the only social media platforms that has the same unified profile for individuals and brands alike. A. True B. False",
      "definition": "A. True"
    },
    {
      "term": "You recently finished making a new batch of affordable earrings and want to promote your brand and products. Your target audience is teenagers from ages 13-17. On which platform should you make an account? A. Instagram B. Facebook C. Twitter D. WhatsApp",
      "definition": "A. Instagram"
    },
    {
      "term": "You created a dance sequence and want to share your moves and encourage others to participate in a hashtag challenge such as #DiscoDanceChallenge. Which of the following would be an ideal platform? A. TikTok B. LinkedIn C. Github D. Twitter",
      "definition": "A. TikTok"
    },
    {
      "term": "Which of the following is a free messaging app you can use to message your friends and family using internet connection while avoiding SMS fees or charges? A. Instagram B. Snapchat C. Twitter D. WhatsApp",
      "definition": "D. WhatsApp"
    },
    {
      "term": "M1 - W3: Which of the following specifies what you want to achieve, and helps to make sure that you and the people you are working with are all aligned? A. Subgoals B. A goal C. Blockers D. A plan",
      "definition": "B. A goal"
    },
    {
      "term": "Which of the following is a free messaging app you can use to message your friends and family using internet connection while avoiding SMS fees or charges? A. Instagram B. Snapchat C. Twitter D. Whatsapp",
      "definition": "D. WhatsApp"
    },
    {
      "term": "True or False: Goals can help you stay focused on what you hope to accomplish with your marketing efforts. A. False B. True",
      "definition": "B. True"
    },
    { "term": "True or False: It is important to write down your goals.", "definition": "True" },
    {
      "term": "True or False: A goal specifies what you want to achieve, and helps to make sure that you and the people you are working with are all aligned. A. True B. False",
      "definition": "A. True"
    },
    {
      "term": "Goals that serve the bigger business goal but may differ between teams or people with different roles are called: A. Alternative goals B. Tiered goals C. Sencondary goals D. Subgoals",
      "definition": "D. Subgoals"
    },
    {
      "term": "Here are some examples of goals for an online clothing store that sold goods for about $80,000 in revenue over the past half year, which do you think are SMART? (Select all that apply) A. Sell clothes for a total of $100,000 in revenue during the second half of this year B. Increase the number of visitors for the website C. Increase the average checkout value to $100 by the end of the year",
      "definition": "A. Sell clothes for a total of $100,000 in revenue during the second half of this year C. Increase the average checkout value to $100 by the end of the year"
    },
    {
      "term": "Does James have everything he needs to get started? A. No, not quite, James needs a little more information to formulate his SMART goal B. Yes, the goal James is given is specific so he knows what he needs to focus on",
      "definition": "A. No, not quite, James needs a little more information to formulate his SMART goal"
    },
    {
      "term": "When writing your SMART goals, it is important to remember to make them measurable. Which of the following definitions best describes the meaning of a measurable goal? A. A goal that anyone could understand and is specific and clear enough for team members to understand what should be achieved. B. A goal that can be evaluated in a quantifiable way, like for instance number or sales, revenue or number of visitors to a website. C. A goal that has a start and end date. D. A goal that can help achieve bigger business objectives and align with your greater business strategy.",
      "definition": "B. A goal that can be evaluated in a quantifiable way, like for instance number or sales, revenue or number of visitors to a website."
    },
    {
      "term": "According to the SMART acronym, a goal that has a start and end date is considered: A. Time-bound B. Measurable C. Specific D. Relevant",
      "definition": "A. Time-bound"
    },
    {
      "term": "According to the SMART acronym, a goal that helps achieve the bigger business objectives of a company and aligns with the greater business strategy is considered: A. Achievable B. Measurable C. Specific D. Relevant",
      "definition": "D. Relevant"
    },
    {
      "term": "All of the following are elements of the SMART acronym except: A. Agile B. Measurable C. Specific D. Relevant",
      "definition": "A. Agile"
    },
    {
      "term": "Which of the following are part of the SMART goal framework? Select all that apply. A. Meaningful B. Specific C. Achievable D. Time-bound",
      "definition": "B. Specific C. Achievable D. Time-bound"
    },
    {
      "term": "Which of the following goals fit the SMART framework? (Choose all that apply) A. Increase the number of visitors to 100/day B. Gain 20 new followers on the Facebook page by the end of the month C. Enroll 500 new customers D. Increase revenue by 25% by the end of the year",
      "definition": "B. Gain 20 new followers on the Facebook page by the end of the month | A. Get 5,000 website visits in the month of June | B. Increase the number of visitors to 100/day in two months"
    },
    {
      "term": "Which of the following are examples of Key Performance Indicators [KPIs]? (Choose all that apply) A. A pie graph that breaks down your audience's favorite color B. A measurement of website traffic to your new product page C. The number of subscriptions/sales D. Your conversion rate for purchases",
      "definition": "B. A measurement of website traffic to your new product page C. The number of subscriptions/sales D. Your conversion rate for purchases"
    },
    {
      "term": "Which of the following is an important quality of a KPI? A. Finite B. Significant C. Directional",
      "definition": "C. Directional"
    },
    {
      "term": "Which of the following is an important quality of a KPI? A. Directly related to your goal B. Broad C. Time-bound",
      "definition": "A. Directly related to your goal"
    },
    {
      "term": "Which of the following is an important quality of a KPI? A. Trainable B. Measurable C. Static",
      "definition": "B. Measurable"
    },
    {
      "term": "Which of the following is an example of a marketing KPI? Select all that apply. A. Sales revenue B. Engagement C. Conversion rate D. Influence",
      "definition": "A. Sales revenue C. Conversion rate"
    },
    {
      "term": "Which of the following is an example of a marketing KPI? Select all that apply. A. Cost per sale B. Influence C. Email opens D. Sales revenue",
      "definition": "A. Cost per sale"
    },
    {
      "term": "Which of the following is an example of a marketing KPI? Select all that apply. A. Brand awareness B. Engagement C. Cost per lead D. Influence",
      "definition": "A. Brand awareness C. Cost per lead"
    },
    {
      "term": "Successful KPIs should: A. Be quantitative (able to be measured) B. Directly relate to the business and the SMART goal you drafted C. Be directional (able to go up or down) D. Always be accompained by a chart or graph",
      "definition": "A. Be quantitative (able to be measured) B. Directly relate to the business and the SMART goal you drafted C. Be directional (able to go up or down)"
    },
    {
      "term": "True or False? The following goal fit the SMART framework: \"Increase the number of visitors to 150/day in three months.\" A. True B. False",
      "definition": "A. True"
    },
    {
      "term": "Which of the following is a KPI for the following SMART goal? A. \"Get 10,000 website visits during the month of May\" B. Number of yearly website visits C. Days of the month D. Number of monthly website visits",
      "definition": "D. Number of monthly website visits"
    },
    {
      "term": "Which of the following do you think would be th best KPI for Vodafone to track related tho this goal? A. Number of Vodafone website visits B. Number of app downloads C. Number of people who like the Facebook Ad",
      "definition": "B. Number of app downloads"
    },
    {
      "term": "What's the 5-letter framework through which you should plan your business goals?",
      "definition": "SMART"
    },
    {
      "term": "Casey wants to increase sales by 7% for her online furniture store over the course of the next 6 months. This goal meets all of the SMART elements except: A. Time-bound B. Relevant C. Specific D. Measureable",
      "definition": "C. Specific"
    },
    {
      "term": "Sam just started a new food truck business and wants to set up some goals. One of his goals is to get 2,000 customers to sign up for an email newsletter full of coupons and food specials while they are paying for their order. He wants to reach his goal in 3 weeks. Which elements of the SMART acronym does this goal fit? (Select all that apply) A. Achievable B. Time-bound C. Measureable D. Specific",
      "definition": "B. Time-bound C. Measureable D. Specific"
    },
    {
      "term": "Maria set a SMART goal for her chocolate business: \"Increase the amount of new followers on the business' social media page by 20% by the end of 3 months\". What would be a good KPI for her to use when evaluating if she is reaching this goal? A. Brand awareness (number of people who know about your brand) B. Sales Revenue (how much money you generate from sales) C. Conversion rate (how many people took action, e.g. bought something, out of the people you attracted) D. Cost per sale (how much it cost in marketing dollars to generate a sale)",
      "definition": "A. Brand awareness (number of people who know about your brand)"
    },
    {
      "term": "Maria set a SMART goal for her chocolate business: \"Increase online sales by 50% by the end of 6 months\". What would be a good KPI for her to use to evaluate if she is reaching this goal? A. Brand awareness (number of people who know about your brand) B. Conversion rate (how many people took action, e.g. bought something, out of the people you attracted) C. Cost per sale (how much it cost in marketing dollars to generate a sale) D. Sales Revenue (how much money you generate from sales)",
      "definition": "B. Conversion rate (how many people took action, e.g. bought something, out of the people you attracted)"
    },
    {
      "term": "Maria set a SMART goal for her chocolate business: \"Decrease the use of paid ads to market older products and reduce marketing spending by 30% by the end of 6 months\". What would be a good KPI for her to use to evaluate if she is reaching this goal? A. Brand awareness (number of people who know about your brand) B. Conversion rate (how many people took action, e.g. bought something, out of the people you attracted) C. Cost per sale (how much it cost in marketing dollars to generate a sale) D. Sales Revenue (how much money you generate from sales)",
      "definition": "C. Cost per sale (how much it cost in marketing dollars to generate a sale)"
    },
    {
      "term": "Devon set a SMART goal for his hand-knit sweater business: \"Increase revenue from sweater sales by 25% by the end of the year\". What would be a good KPI for him to use when evaluating if he is reaching this goal? A. Brand awareness (number of people who know about your brand) B. Cost per sale (how much it cost in marketing dollars to generate a sale) C. Sales Revenue (how much money you generate from sales) D. Conversion rate (how many people took action, e.g. bought something, out of the people you attracted)",
      "definition": "C. Sales Revenue (how much money you generate from sales)"
    },
    {
      "term": "Devon set a SMART goal for his hand-knit sweater business: \"Gain 20% more new customers by the end of the year\". What would be a good KPI for him to use when evaluating if he is reaching this goal? A. Conversion rate (how many people took action, e.g. bought something, out of the people you attracted) B. Brand awareness (number of people who know about your brand) C. Sales Revenue (how much money you generate from sales) D. Cost per lead (how much it cost in marketing dollars to generate a sale)",
      "definition": "A. Conversion rate (how many people took action, e.g. bought something, out of the people you attracted)"
    },
    {
      "term": "Devon set a SMART goal for his hand-knit sweater business: \"Create more effective social media ads to gain 5% more customers through social media than the previous month\". What would be a good KPI for him to use when evaluating if he is reaching this goal? A. Sales Revenue (how much money you generate from sales) B. Cost per lead (how much it cost in marketing dollars to generate a sale) C. Conversion rate (how many people took action, e.g. bought something, out of the people you attracted) D. Brand awareness (number of people who know about your brand)",
      "definition": "C. Conversion rate (how many people took action, e.g. bought something, out of the people you attracted)"
    },
    {
      "term": "Calla and Ivy set a SMART goal for their B2C flower business: \"Gain 25% more sales from the people who visit the website in the next six months\". What would a good KPI for Calla and Ivy to evaluate to see if they are reaching their goal? A. Subscriptions B. Cost per sale C. Sales revenue D. Conversion rate",
      "definition": "D. Conversion rate"
    },
    {
      "term": "Calla and Ivy set a SMART goal for their B2C flower business: \"Direct 20% more customers to the website through social media posts in the next three months\". What would a good KPI for Calla and Ivy to evaluate to see if they are reaching their goal? A. Subscriptions B. Cost per sale C. Sales revenue D. Website traffic",
      "definition": "D. Website traffic"
    },
    {
      "term": "After a successful year of business, Sheryl wants to expand her makeup and skin care business by opening up two more locations in her town. She decides to set a goal to open up both locations within 12 months. During the expansion process, she encounters difficulties. This is because her goal was not time-bound. A. False B. True",
      "definition": "A. False"
    },
    {
      "term": "M1-W4: As a marketer, you want to reach your target audience. This means you want to get your marketing message in front of: A. Everyoneterm-81 B. Anyone who has heard of your business before C. People who are most likely to be interested in your product",
      "definition": "C. People who are most likely to be interested in your product"
    },
    {
      "term": "When determining your target audience, it is good to write down the demographics of the people you are targeting. These demographics include which of the following? (Select all that apply) A. Household income B. Gender C. Age D. Education and/or occupation",
      "definition": "A. Household income B. Gender C. Age D. Education and/or occupation"
    },
    {
      "term": "True or False: Meta Business Suite Insights can precisely determine who's interacting with your page and give you real-time data when you test different marketing strategies. A. True B. False",
      "definition": "A. True"
    },
    {
      "term": "Some steps you can take to get a better picture of your target audience include which of the following? (Select all that apply) A. Describe current customer B. Talk to customers, friends or strangers C. Pay a large company to do research for you D. Monitor the competition and its target audience",
      "definition": "A. Describe current customer B. Talk to customers, friends or strangers D. Monitor the competition and its target audience"
    },
    {
      "term": "Social media data that can help you determine your target audience includes which of the following? (Select all that apply) A. Page visitors' prior purchasing habits B. Page visitors' social security numbers C. Page visitors' geographic location D. Page visitors' age",
      "definition": "A. Page visitors' prior purchasing habits C. Page visitors' geographic location D. Page visitors' age"
    },
    {
      "term": "All of the following social media data can help you determine your target audience except: A. Page visitors' geographic location B. Page visitors' social security numbers C. Page visitors' age D. Page visitors' prior purchasing habits",
      "definition": "B. Page visitors' social security numbers"
    },
    {
      "term": "True or False: When outlining your target audience, you should consider audience needs, interests, and demographic data. A. False B. True",
      "definition": "B. True"
    },
    {
      "term": "True or False: The process of moving people through the customer journey results in what marketers refer to as a marketing funnel. A. False B. True",
      "definition": "B. True"
    },
    {
      "term": "True or False: A customer journey refers to the process a user goes through when purchasing a product. A. True B. False",
      "definition": "A. True"
    },
    {
      "term": "True or False: Depending on the stage a person is in, different types of messages will work better than others. A. False B. True",
      "definition": "B. True"
    },
    {
      "term": "True or False: The customer journey is always equally explicit or linear. A. False B. True",
      "definition": "A. False"
    },
    {
      "term": "Which of the following is NOT part of the Customer Journey template? A. Conversion: How can I get my target to take action? B. Advocacy: How can I make my target into an advocate? C. Desire: How can I show my target my product really fits in their life? D. Love: How can I get my customer to feel a deep emotional attachment to my product?",
      "definition": "D. Love: How can I get my customer to feel a deep emotional attachment to my product?"
    },
    {
      "term": "Which of the following research tools allows you to view insights about your audience for multiple social media platforms? (Choose all that apply) A. Meta Business Suite Insights B. Google Analytics C. Twitter Business Analytics D. Linkedin Audience Insights",
      "definition": "A. Meta Business Suite Insights B. Google Analytics"
    },
    {
      "term": "Which of the following research tools lets you track the keywords your followers are searching for, their online posting behavior, and the devices they use? A. Meta Business Suite Insights B. Google Analytics C. Twitter Business Analytics D. Linkedin Audience Insights",
      "definition": "C. Twitter Business Analytics"
    },
    {
      "term": "Which of the following research tools lets you track what industries people are interacting with your business from? A. Twitter Business Analytics B. Linkedin Audience Insights C. Google Analytics D. Meta Business Suite Insights",
      "definition": "B. Linkedin Audience Insights"
    },
    {
      "term": "Can you put the different stages of the typical customer journey in oder? A. Awarness - Interest - Desire - Conversion - Advocacy B. Interest - Awarness - Desire - Advocacy - Conversion C. Advocacy - Awarness - Interest - Desire - Conversion",
      "definition": "A. Awarness - Interest - Desire - Conversion - Advocacy"
    },
    {
      "term": "Things you should consider when outlining your target audience include which of the following? Select all that apply. A. Your target audience's eating habits B. Key demographic data that describes your target audience C. Your taet audience's interests D. Your target audience's needs",
      "definition": "B. Key demographic data that describes your target audience C. Your taet audience's interests D. Your target audience's needs"
    },
    {
      "term": "After months of thinking about the new laptop she heard about from a friend, Anna finally decides it's time to buy it. In what stage of the customer journey is Anna? A. Desire B. Advocacy C. Awareness D. Conversion",
      "definition": "D. Conversion"
    },
    {
      "term": "What do marketers use to represent the process of moving people through the customer journey? A. The awarness funnel B. The interest process C. The marketing funnel D. The customer process",
      "definition": "C. The marketing funnel"
    },
    {
      "term": "It's possible for a company to have more than one target audience. A. True B. False",
      "definition": "A. True"
    },
    {
      "term": "Envy is a stage in the typical customer journey. A. True B. False",
      "definition": "B. False"
    },
    {
      "term": "Leonard receives an email about a new Bluetooth headphone brand. At first he isn't totally interested, but a week later his headphones break and he decides to look into the product's features. In which stage of the customer journey is Leonard? A. Conversion B. Advocacy C. Desire D. Interest",
      "definition": "D. Interest"
    },
    {
      "term": "Will just saw an Instagram ad for a sweatshirt claiming to be thterm-56e comfiest sweatshirt ever. In which stage of the customer journey is Will? A. Desire B. Conversion C. Advocacy D. Awareness",
      "definition": "D. Awareness"
    },
    {
      "term": "Which of the following are stages in the typical customer journey? (Select all that apply) A. Awarness B. Envy C. Conversion D. Advocacy",
      "definition": "A. Awarness C. Conversion D. Advocacy"
    },
    {
      "term": "M1 - W5: When you are focused on brand building, what kind of social media platform can help the most? A. Publishing or sharing platforms B. Platforms that offer immediate shopping integration C. Messaging platforms D. Collaboration or networking platforms",
      "definition": "A. Publishing or sharing platforms"
    },
    {
      "term": "When you are focused on generating sales or sales leads through social media marketing, what kind of social media platform can help the most? A. Publishing or sharing platforms B. Platforms that offer immediate shopping integration C. Messaging platforms D. Collaboration or networking platforms",
      "definition": "B. Platforms that offer immediate shopping integration"
    },
    {
      "term": "When you are focused on providing customer service, what kind of social media platform can help the most? A. Publishing or sharing platforms B. Platforms that offer immediate shopping integration C. Messaging platforms D. Collaboration or networking platforms",
      "definition": "C. Messaging platforms"
    },
    {
      "term": "When you are focused on building an online community, what kind of social media platform can help the most? A. Publishing or sharing platforms B. Platforms that offer immediate shopping integration C. Messaging platforms D. Collaboration or networking platforms",
      "definition": "D. Collaboration or networking platforms"
    },
    {
      "term": "Let's think about Calla & Ivy, the flower business again. For now, Imra manages social media for the company by herself. Which of the following platforms would you suggest she focuses on? A. Linkedln B. Youtube C. Instagram D. Pinterest",
      "definition": "C. Instagram D. Pinterest"
    },
    {
      "term": "You're looking to reach the largest possible audience with the most precise targeted advertising tools. Your go-to social media platform should be: A. LinkedIn B. Facebook C. Instagram D. TikTok",
      "definition": "B. Facebook"
    },
    {
      "term": "Your're looking to build a community online. Your go-to social media platform should be: A. TikTok B. Facebook C. Instagram D. Linkedln",
      "definition": "B. Facebook"
    },
    {
      "term": "You're looking to build a community online. Your go-to social media platform should be: A. TikTok B. Facebook C. Instagram D. Linkedln",
      "definition": "B. Facebook"
    },
    {
      "term": "You're looking to advertise specifically to teens. Your go-to social media platform should be: A. Facebook B. TikTok C. Instagram D. LinkedIn",
      "definition": "B. TikTok"
    },
    {
      "term": "You're looking to do visuals-first advertising online. Your go-to social media platform should be: A. Instagram B. Facebook C. LinkedIn D. TikTok",
      "definition": "A. Instagram"
    },
    {
      "term": "You're looking to do mainly B2B (business to business) marketing and to post job applications. Your go-to social media platform should be: A. LinkedIn B. TikTok C. Facebook D. Instagram",
      "definition": "A. LinkedIn"
    },
    {
      "term": "You are a fashion brand looking to create an immediate avenue for shopping. Your go-to social media platform would be: A. Instagram B. Linkedln C. Tiktok D. Facebook",
      "definition": "D. Facebook"
    },
    {
      "term": "Which part of your Linkedln profile should be your virtual elevator pitch? A. Summary B. Background C. Skills & Accomplishments",
      "definition": "A. Summary"
    },
    {
      "term": "What is a corporate social media policy intended to achieve? A. Interest sales, protect the brand, guard against legal risks B. Attract influencers, empower employees, guard against legal risks C. Empower employees, protect the brand, guard against legal risks D. Protect the brand, discourage employees from posting on personal accounts, guard against legal risks",
      "definition": "C. Empower employees, protect the brand, guard against legal risks"
    },
    {
      "term": "Which of the following is not included in establishing a corporate social media policy? A. Verify employees' responsibilities B. Reinforce What's considered confidential information C. Authorize graphic design and image specifications D. Provide a plan for dealing with conflict",
      "definition": "C. Authorize graphic design and image specifications"
    },
    {
      "term": "Microsoft's \"Guidelines for Successful Blogging\" are not in Microsoft's official Employee Handbook, but the rules are manageable and understandable. Which of the following is part of \"Microsoft's Blogging Policy & Guidelines\"? (Select all that apply.) A. Your blog posts should garner as much reaction as possible B. Make friends with your corporate communications department and learn how to work with them C. There is no need to identify yourself D. Respect existing confidentiality agreements",
      "definition": "B. Make friends with your corporate communications department and learn how to work with them D. Respect existing confidentiality agreements"
    },
    {
      "term": "IBM works with employee bloggers, training them to advance the company's goals and corporate reputation. Which of the following is part of \"IBM's Blogging Policy & Guidelines\"? (Select all that apply) A. You may cite or reference clients, partners, or suppliers without their approval. B. You do not need to make yourself or your role at IBM known. C. You must make it clear that you are speaking for yourself and not on behalf of IBM. D. IBMers are personally responsible for their posts. Be mindful that what you write will be public for a long time - protect your privacy.",
      "definition": "C. You must make it clear that you are speaking for yourself and not on behalf of IBM. D. IBMers are personally responsible for their posts. Be mindful that what you write will be public for a long time - protect your privacy."
    },
    {
      "term": "Determine whether the following statement is true or false: Consumers today expect brands to be present on their favorite social media platforms. A. False B. True",
      "definition": "B. True"
    },
    {
      "term": "Determine whether the following statement is true or false: It is mandatory to fill out the Skills & Accomplishments section of your LinkedIn profile. A. True B. False",
      "definition": "B. False"
    },
    {
      "term": "Determine whether the following statement is true or false: When an employee posts from a personal account, it is not important that they use the appropriate tone and messaging. A. True B. False",
      "definition": "B. False"
    },
    {
      "term": "Is the following a quality of a website or a blog? The writing is often more informal A. Website B. Blog",
      "definition": "B. Blog"
    },
    {
      "term": "is the following a quality of a website or a blog? There is a transactional functionality. A. Blog B. Website",
      "definition": "B. Website"
    },
    {
      "term": "Is the following a quality of a website or a blog? The content is not interactive A. Blog B. Website",
      "definition": "A. Website"
    },
    {
      "term": "Which benefit of blogging is the following an example of?Your blog content is shared on social media platforms such as Facebook, LinkedIn, Instagram, and Twitter. A. Search Engine Optimization B. Expand your content's reach C. Build credibility D. Make authentic connections",
      "definition": "Expand your content's reach"
    },
    {
      "term": "Which benefit of blogging is the following an example of?When a business creates quality key-word rich blog posts frequently, it gives search engines fresh content to add to its database A. Search Engine Optimization B. Expand your content's reach C. Build credibility D. Make authentic connections",
      "definition": "B. Expand your content's reach"
    },
    {
      "term": "Which benefit of blogging is the following an example of?Posting valuable content consistently helps elevate a company as a trusted resource within their industry leading to more visitors, more potential customers and more sales. A. Search Engine Optimization B. Expand your content's reach C. Build credibility D. Make authentic connections",
      "definition": "C. Build credibility"
    },
    {
      "term": "Which of the following is not a benefit of blogging for your bussiness? A. Establish your business as an industry throught leader B. Selling your products and services online C. Provide a boost to search engine optimization efforts D. Connecting people to your brand",
      "definition": "B. Selling your products and services online"
    },
    {
      "term": "Which of the following is not a benefit of blogging for your bussiness? A. Increase sales, protect the brand, guard against legal risks B. Attract influencers, empower employees, guard against legal risks C. Empower employees, protect the brand, guard against legal risks D.Protect the brand, discourage employees from posting on personal accounts, guard against legal risks",
      "definition": "C. Empower employees, protect the brand, guard against legal risks"
    },
    {
      "term": "Which of the following are good general guidelines for a corporate blog? Select all that apply. A. Blog posts must respect copyright, privacy, fair use, financial disclosure, and other applicable laws B. Blog posts should not disclose any information that is confidential or proprietary to the company C. Employees can imply that they are speaking on behalf of the company",
      "definition": "A. Blog posts must respect copyright, privacy, fair use, financial disclosure, and other applicable laws B. Blog posts should not disclose any information that is confidential or proprietary to the company"
    },
    {
      "term": "Which of the following is a soft skill? A. Microsoft Office B. Engineering C. Leadership D. Copywriting",
      "definition": "C. Leadership"
    },
    {
      "term": "Which of the following are NOT part of the SMART goal framework? A. Achievable - Can it be done? B. Relevant - Should it be done? C. Social - how will you integrate it into the community where it's done? D. Time-bound - When will it be done?",
      "definition": "C. Social - how will you integrate it into the community where it's done?"
    },
    {
      "term": "True or False: Your target audience is the group of people you want to reach with your marketing message. A. True B. False",
      "definition": "A. True"
    },
    {
      "term": "In marketing, groups of people with similar characteristics (like similar demographics, interests or behaviors) are referred to as: A. Segments B. Parties C. Portions D. Audiences",
      "definition": "A. Segments"
    },
    {
      "term": "What is the group of people you want to reach with your marketing message called? A. Marketing population B. Targeted members C. Target audience D. Marketing Audience",
      "definition": "C. Target audience"
    },
    {
      "term": "Which research tool can precisely determine who's interacting with your page and give you real-time data when you test different marketing strategies? A. Twitter Business Analytics B. Google Analytics C. Meta Business Suite Insights D. LinkedIn Audience Insights",
      "definition": "C. Meta Business Suite Insights"
    },
    {
      "term": "True or False: Twitter Business Analytics is similar to Meta Business Suite Insights, but solely for its own business platform. A. False B. True",
      "definition": "B. True"
    },
    {
      "term": "Determine whether the following statement is true or false: When an employee posts from a personal account, it is not important that they use the appropriate tone and messaging. A. True B. False",
      "definition": "B. False"
    },
    {
      "term": "Of the three core values that a social media policy should achieve, which category does the following statement fit in? \"Nordstrom encourages participation by reinforcing that employees will be compensated for their work.\" A. A social media policy must empower its employees B. A social media policy must guard against legal risks to the organization C. A social media policy must protect the brand",
      "definition": "A. A social media policy must empower its employees"
    },
    {
      "term": "Of the three core values that a social media policy should achieve, which category does the following statement fit in? \"Nordstrom referred to company guidelines that can help employees to represent the company in a way that doesn't harm the brand\" A. A social media policy must protect the brand B. A social media policy must guard against legal risks to the organization C. A social media policy must empower its employees",
      "definition": "A. A social media policy must protect the brand"
    },
    {
      "term": "Of the three core values that a social media policy should achieve, which category does the following statement fit in? \"Nordstrom makes it clear that employees can be held legally responsible for what they post, so they should make sure that they stay within the company guidelines. \" A. A social media policy must protect the brand B. A social media policy must guard against legal risks to the organization C. A social media policy must empower its employees",
      "definition": "B. A social media policy must guard against legal risks to the organization"
    },
    {
      "term": "At its core marketing involves which of these steps? Select all that apply. A. Finding and hiring talented people to fulfill open staff roles B. Ensuring the product is manufactured at the lowest possible cost C. Creating messages related to or promoting the product D. Understanding and studying the audience or customers for a product",
      "definition": "C. Creating messages related to or promoting the product D. Understanding and studying the audience or customers for a product"
    },
    {
      "term": "True or False: Envy is a stage in the typical customer journey. A. False B. True",
      "definition": "A. False"
    },
    {
      "term": "Will just saw an Instagram ad for a sweatshirt claiming to be the comfiest sweatshirt ever. In which stage of the customer journey is Will? A. Awareness B. Conversion C. Advocacy D. Desire",
      "definition": "A. Awareness"
    },
    {
      "term": "Harry was recently promoted at work and wanted to buy himself something to celebrate. He sees a suit in a magazine ad and really wants to buy it. In which stage of the customer journey is Harry? A. Desire B. Awareness C. Advocacy D. Conversion",
      "definition": "A. Desire"
    },
    {
      "term": "The audience that will typically get most of your attention since you expect them to become your most valuable group of customers is: A. Final target audience B. Primary target audience C. Secondary target audience",
      "definition": "B. Primary target audience"
    },
    {
      "term": "Which of the following research tools allows you to view insights about your audience for multiple social media platforms? (Choose all that apply) A. Meta Business Suite Insights B. Linkedin Audience Insights C. Twitter Business Analytics D. Google Analytics",
      "definition": "B. Linkedin Audience Insights D. Google Analytics"
    },
    {
      "term": "Which of the following statements is true about Facebook and Instagram messenger? A. Messenger lets businesses instantly connect with people on the Messenger app, but not on the Facebook Page. B. If businesses want to offer suggestions, assist in sales, or offer support, these should be done in separate conversations. C. Messenger lets businesses integrate ads to further connect with current and new customers.",
      "definition": "C. Messenger lets businesses integrate ads to further connect with current and new customers. | Messenger lets businesses instantly connect with people on their Facebook Page or the Messenger app"
    },
    {
      "term": "Calla and Ivy set a SMART goal for their B2C flower business: \"Grow the number of customers for the monthly flower bouquet subscription by 20% by the end of the year\". What would be a good KPI for Calla and Ivy to evaluate to see if they are reaching their goal? A. Conversion rate B. Sales revenue C. Subscriptions D. Cost per sale",
      "definition": "C. Subscriptions"
    },
    {
      "term": "Joni recently purchased a new pair of shoes for work and is happy with how comfortable they are. She tells coworkers at her office about them and recommends they look into the brand. In what stage of the customer journey is Joni? A. Advocacy B. Awareness C. Desire D. Conversion",
      "definition": "A. Advocacy"
    },
    {
      "term": "Which part of your LinkedIn profile should be your virtual elevator pitch? A. Skills & Accomplishments B. Summary C. Background",
      "definition": "B. Summary"
    },
    {
      "term": "True or False: A secondary target audience can helps you structure your marketing efforts if you sell me than on product or service, or if you feel your products or services may appeal to distinctly different groups of people A. True B. False",
      "definition": "A. True"
    },
    {
      "term": "When defining your target audience, you should think about which of the following criteria? A. Their interests B. Their age C. Their location D. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "True or False: Demographic information such as age, geographic location, and prior purchasing history is a key factor to consider when determining your target audience. A. True B. False",
      "definition": "A. True"
    },
    {
      "term": "M2 - W1: What are the elements of a business social media profile? A. Name, Profile picture and cover photo, Contact information, Description B. Name, Contact information, Description, Call-to-action (CTA) C. Name, Username, Contact information, Description, Call-to-action (CTA) D. Name, Profile picture and cover photo, Contact information, Description, Call-to-action (CTA)",
      "definition": "D. Name, Profile picture and cover photo, Contact information, Description, Call-to-action (CTA)"
    },
    {
      "term": "What would be a good choice for a Facebook business page profile picture? A. A picture of the product B. A stock photo of the product or service C. The business logo D. A headshot of the business owner",
      "definition": "C. The business logo"
    },
    {
      "term": "Which of the following are good descriptive keywords to include if you're setting up an Instagram account for a coffeeshop? (Select all that apply) A. Bean B. Espresso C. Coffee D. Coffeeshop",
      "definition": "B. Espresso C. Coffee D. Coffeeshop"
    },
    {
      "term": "Your social media cover photo should be: A. An image that tells people something about your business, like one of your products, a behind-the-scenes photo, or a reference to a current ad campaign. B. The same image as your profile picture, for visual consistency C. A random image that you find inspiring or beautiful",
      "definition": "A. An image that tells people something about your business, like one of your products, a behind-the-scenes photo, or a reference to a current ad campaign."
    },
    {
      "term": "You're designing a Facebook business page for a startup flower company. Which of the following should you use as your business's profile picture? A. A picture of your office building B. Your CEO's headshot C. A picture of a flower D. Your company logo",
      "definition": "D. Your company logo"
    },
    {
      "term": "If you're a company that sells a physical product, like flowers, bike parts, or dog treats, what should your Call-to-Action button say? A. Donate Today! B. Book a Subscription! C. Shop Now! D. Learn More!",
      "definition": "C. Shop Now!"
    },
    {
      "term": "True or False: In order to create an Instagram Business account, you must switch a personal Instagram account to a Business account in the settings. A. False B. True",
      "definition": "B. True"
    },
    {
      "term": "What should your branding do for customers? (Choose all that apply) A. Customers become less price-sensitive if they're loyal to your brand B. Customers will destroy other brands' products C. You can cut production costs D. Customers will follow your brand to new products",
      "definition": "A. Customers become less price-sensitive if they're loyal to your brand D. Customers will follow your brand to new products"
    },
    {
      "term": "What are the essential components of your social media marketing pages? (Choose all that apply) A. Criticisms of your competitors B. A profile picture C. A brief brand bio D. A video introduction for your brand",
      "definition": "B. A profile picture C. A brief brand bio"
    },
    {
      "term": "Which of the following components does a brand consist of? Select all that apply. A. a website B. a logo C. values D. principles",
      "definition": "B. a logo C. values D. principles"
    },
    {
      "term": "Which of the following is a function of the brand? Select all that apply. A. reduce cost B. signaling device C. foster loyalty",
      "definition": "B. signaling device C. foster loyalty | enable recognition | ease selections"
    },
    {
      "term": "Which of the following components of the EPIC framework does the following statement encompass? How a brand connects with its customers through the written word A. Connection B. Identity C. Purpose D. Existence",
      "definition": "C. Connection"
    },
    {
      "term": "Which of the following is not a part of a brand's existence? A. The location of the company B. The story of the founders C. Organizations that the company donates to",
      "definition": "C. Organizations that the company donates to"
    },
    {
      "term": "Which voice would be most fitting to connect with the following audience? Teenagers between the ages of ten to thirteen, looking to buy colorful jewelry A. formal and serio B. friendly and casual C. witty and smart",
      "definition": "B. friendly and casual"
    },
    {
      "term": "If you're a visually oriented business, what major social media platform is essential for your business to have a page on? A. Instagram B. LinkedIn C. Twitter",
      "definition": "A. Instagram"
    },
    {
      "term": "Which of the following social media platforms are encompassed by Meta? Select all that apply. | Instagram | WhatsApp | Twitter",
      "definition": "Instagram | WhatsApp"
    },
    {
      "term": "What is the key focus of marketing? | Providing offerings that have value | Generating the most profit | Raising brand awareness",
      "definition": "Providing offerings that have value"
    },
    {
      "term": "The most powerful targeted advertising tool in social media marketing is: | KakaoTalk for Business | Meta Ads Manager | Google Analytics | TikTok for Business",
      "definition": "Meta Ads Manager"
    },
    {
      "term": "Your brand should do which of the following? (Choose all that apply) | Differentiate you from your competitors | Create a personality or identity for your business | Consist only of facts and figures about your company | Tell your customers what's wrong with your competitors",
      "definition": "Differentiate you from your competitors | Create a personality or identity for your business"
    },
    {
      "term": "Which of these things are NOT essential for your company social media page? | A link to your website | A brief brand description | A profile picture | Your CEO's biography",
      "definition": "Your CEO's biography"
    },
    {
      "term": "Which of the following components of the EPIC framework does the following statement encompass? How that business got started, and why the world should pay attention | Identity | Purpose | Connection | Existence",
      "definition": "Existence"
    },
    {
      "term": "Which of the following is not a part of a brand's purpose? | The brand's logo | The brand's mission | The brand's values",
      "definition": "The brand's logo"
    },
    {
      "term": "Which voice would be most fitting to connect with the following audience? College students looking for humorous critique on current events and media | formal and serious | friendly and casual | witty and smart",
      "definition": "witty and smart"
    },
    {
      "term": "What's the first major social media platform you should set up a company page for? | LinkedIn | Pinterest | Twitter | Facebook",
      "definition": "Facebook"
    },
    {
      "term": "Which of the following is not a part of brand identity? | The company's origin story | The colors used in the company's websites | The brand logo",
      "definition": "The company's origin story"
    },
    {
      "term": "What major social media platform leads in business-to-business [B2B] interactions? | Twitter | Instagram | LinkedIn | Facebook",
      "definition": "LinkedIn"
    },
    {
      "term": "In what ways can a company use social media to engage with customers? (Select all that apply) | By sharing stories of the business and employees in a relatable and identifiable way | By posting content that shows customers that the company is present and responsive | By ignoring customer feedback on posts | By giving routine sales pitches",
      "definition": "By sharing stories of the business and employees in a relatable and identifiable way | By posting content that shows customers that the company is present and responsive"
    },
    {
      "term": "True or False: You can add a hyperlink url to the caption of your Instagram post. | True | False",
      "definition": "False"
    },
    {
      "term": "True or False: Pinterest is the best app to use if you want to exclusively post videos | True | False",
      "definition": "False"
    },
    {
      "term": "What is the rule of thirds? Select the best answer. | If you break up your image into thirds, horizontally and vertically, your subject matter should be at the intersection of one of the gridlines. | If you break up your image into thirds, horizontally and vertically, your subject matter should be at one of the corners of the image. | If you break up your image into thirds, horizontally and vertically, your subject matter should be at the center of the image.",
      "definition": "If you break up your image into thirds, horizontally and vertically, your subject matter should be at the intersection of one of the gridlines."
    },
    {
      "term": "If you want your Facebook post to be seen by an audience outside of your followers, you can turn it into an ad by selecting which option? | Share Post | React to Post | Engage Post | Boost Post",
      "definition": "Boost Post"
    },
    {
      "term": "A good way to widen your audience for a post is to: (Select all that apply) | Put \"Please Share This!\" in the post text | @ mention people involved to expose it to their followers | Use appropriate hashtags | Direct message the post to as many people as possible",
      "definition": "@ mention people involved to expose it to their followers | Use appropriate hashtags"
    },
    {
      "term": "True or False: Every Instagram post needs to contain a \"hard sell\" for your product. | True | False",
      "definition": "False"
    },
    {
      "term": "You're drafting the text for a Facebook advertisement. What's a good thing to add to guarantee greater engagement? | Use 7-12 emojis | Include an image in your post | DM a celebrity and ask them to share your post for free",
      "definition": "Include an image in your post"
    },
    {
      "term": "Tweets with video typically net how much more engagement than those without? | 4 times as much engagement | 10 times as much engagement | 2.7 times as much engagement | 8 times as much engagement",
      "definition": "2.7 times as much engagement"
    },
    {
      "term": "The social media feature-used across Instagram, Twitter, Facebook, and more-that lets you tag your post with a category and make it more findable is called a: | story | hashtag | advertisement | mention",
      "definition": "hashtag"
    },
    {
      "term": "When you tag another person or social media user with an @ preceding their name in a post, that's called a: | emojis | mention | hashtag | story",
      "definition": "mention"
    },
    {
      "term": "If you were a food delivery service trying to interact with your customers on social media, what would be the best course of action? | Post a video advertisement | Post a photo of a dish from your services | Ask your customers on your stories: \"What did you cook this weekend?!\"",
      "definition": "Ask your customers on your stories: \"What did you cook this weekend?!\""
    },
    {
      "term": "Which of the following is true about videos on social media? | The ideal video length on Youtube is 2 minutes | The ideal video length on Twitter is 2 minutes | The ideal video length on TikTok is 2 minutes",
      "definition": "The ideal video length on Youtube is 2 minutes"
    },
    {
      "term": "True or False? You should always shoot your videos in horizontal landscape view to make them seem more cinematic. | True | False",
      "definition": "True"
    },
    {
      "term": "Let's say your company has a large Instagram following and is trying to do a fundraiser. What are the best ways to leverage Instagram's features? (Select all that apply) | Host a fundraiser on Instagram Live, where people can donate directly through the app | Put a fundraising link in your bio | DM your followers at random and ask them to donate",
      "definition": "Host a fundraiser on Instagram Live, where people can donate directly through the app | Put a fundraising link in your bio"
    },
    {
      "term": "Some of the key elements that make up a social media post are: | Call-to-actions & links | Emojis | Images or video | Hashtags or @mentions",
      "definition": "Call-to-actions & links | Images or video | Hashtags or @mentions"
    },
    {
      "term": "Which of the following is true about the use of images on social media? | A tweet with an image gets 3 times more engagement than a tweet with only text | Creating a post with an image does not have a significant impact on LinkedIn | A Facebook post with an image gets half the engagement it would without an image",
      "definition": "A tweet with an image gets 3 times more engagement than a tweet with only text"
    },
    {
      "term": "A good way to get people to engage with your Facebook post is:(Select all that apply) | Connect with the reader on a personal basis | Identify a problem and offer a solution | Put \"Please Share This!\" in the post text | Direct message the post to as many people as possible",
      "definition": "Connect with the reader on a personal basis | Identify a problem and offer a solution"
    },
    {
      "term": "Instagram users can maximize engagement through use of:(Select all that apply) | Topically appropriate hashtags | Conflicts with other brand accounts | @ mentions | Strategic use of the multiple photo option",
      "definition": "Topically appropriate hashtags | @ mentions | Strategic use of the multiple photo option"
    },
    {
      "term": "True or False? You can safely assume that people viewing your video advertisement will hear the accompanying audio. | True | False",
      "definition": "False"
    },
    {
      "term": "True or False? Instagram only permits you to upload one photo per post. | True | False",
      "definition": "False"
    },
    {
      "term": "Which of the following is not true about hashtags? | The more there are, the better | They can be helpful in making your post surface in search | You can \"hide\" hashtags by adding rows to your post if you'd like to",
      "definition": "The more there are, the better"
    },
    {
      "term": "Which of the following categories does engaging social media content typically fall into when trying to create value for our audience on social media, and create posts that will keep them engaged? (Select correct answer) | Posts that are educational, that teach, update, or inform. | Posts that are inspirational and feel-good | Posts that are fun and entertaining | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "When coming up with new content that's engaging, informative, or fun, there are many different topics you can post about. Which of the following are examples of the different kinds of posts you can create for your page? (Select all that apply) | A series of public statements responding to negative customer reviews. | A social media takeover by an influencer for a day. | A series of posts promoting a competitor's page to show how their product or service is better. | A video from the perspective of an employee showing followers what it's like to work at your business.",
      "definition": "A social media takeover by an influencer for a day. | A video from the perspective of an employee showing followers what it's like to work at your business."
    },
    {
      "term": "True or False: The first thing to determine when starting to storyboard is your engagement goal for our social media post and what story you're going to tell. | True | False",
      "definition": "True"
    },
    {
      "term": "True or False: When you create a content calendar you save time and stress, but you should not tweak it as you go so that you keep to your original goals regardless of engagement or audience reaction. | True | False",
      "definition": "False"
    },
    {
      "term": "Which social media platform has the shortest post \"lifetime\"? | Instagram | WhatsApp | Facebook | Twitter",
      "definition": "Twitter"
    },
    {
      "term": "What elements should you include on your content calendar? | The post's content, including images and hashtags | Which platform(s) you are posting it on | Date and time of the post | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "Which of the following are benefits to having a content calendar for your social media posts? (Select all that apply) | Your team is able to more easily collaborate on posting | Plan content to be posted on days off or holidays when employees aren't working | It helps you keep a consistent brand voice | It lets you set it and forget it",
      "definition": "Your team is able to more easily collaborate on posting | Plan content to be posted on days off or holidays when employees aren't working | It helps you keep a consistent brand voice"
    },
    {
      "term": "DCB Cleaners receives an accusation of shoddy construction from James on their Facebook page. It reads: \"My DCB snack bar fell down! Screw you!\" How do you respond? | \"Hey James-we're sorry to hear that. That's not in line with our standards, and we'll DM you now to talk about this and send someone your way as soon as possible to fix it.\" | No response | \"Hey James-get this off our page, man. It makes us look bad.\" | \"Hey James-sorry to hear that. But that's your problem now.\"",
      "definition": "\"Hey James-we're sorry to hear that. That's not in line with our standards, and we'll DM you now to talk about this and send someone your way as soon as possible to fix it.\""
    },
    {
      "term": "True or False: Admins have total control of a Facebook page and are the only class that can assign and change others' roles. | False | True",
      "definition": "True"
    },
    {
      "term": "Erika launched the Facebook page for the new restaurant she just opened a month ago and is encountering some issues. She feels like she is not posting enough updates because of time constraints and is therefore not attracting followers fast enough. She is looking for some guidance to better manage her page. Which of the following tips should she apply to her strategy? | Erika should work as a team with her employees to share page responsibilities and generate new content for her followers and future customers. | Erika should automate responses for customer messages and comments. | Erika should look into using publishingtools to schedule posts.",
      "definition": "Erika should work as a team with her employees to share page responsibilities and generate new content for her followers and future customers."
    },
    {
      "term": "True or False: When responding to customer comments, it is important to take any issues and criticism of the brand out of the public sphere and address customers in private messages. | True | False",
      "definition": "True"
    },
    {
      "term": "Which of the following is one of the three main categories of engaging social media content? | News statements | Stories | Highlights | Educational posts",
      "definition": "Educational posts"
    },
    {
      "term": "True or False: When using audience analytics software, the number of \"Impressions\" tells you how many times they've clicked your post to further engage with it, while the number of \"Clicks\" tracks the number of times your post appears on users' screens. | False | True",
      "definition": "False"
    },
    {
      "term": "Within how many days should a brand respond to social media comments? | 1 | 48 hours | Within a week",
      "definition": "1"
    },
    {
      "term": "What is the first thing to be done when starting to storyboard? | Write the copy | Determine your engagement goal (i.e. educate, increase traffic, make a sale, etc.) | Make the boxes or panels | Add your desired photos and colors (i.e. images, logos)",
      "definition": "Determine your engagement goal (i.e. educate, increase traffic, make a sale, etc.)"
    },
    {
      "term": "Stacey just launched a Facebook page for her dog day care company called Hugs & Paws. She is looking to have some employees to help her moderate the page. Which of the following roles can she assign to people? (Select all that apply) | Editor | Developer | Moderator | Admin",
      "definition": "Editor | Moderator | Admin"
    },
    {
      "term": "True or False: Moderators for a Facebook Page can respond to page comments and send messages from the page, as well as post directly to the page. | True | False",
      "definition": "False"
    },
    {
      "term": "Which softwares below are social media schedulers you can use to manage and moderate your posts? | Buffer | Hootsuite | LinkedIn | Sprout Social",
      "definition": "Buffer | Hootsuite | Sprout Social"
    },
    {
      "term": "True or False: The best way to create a positive brand impression is by responding to customers' social media comments in a timely and polite manner. | True | False",
      "definition": "True"
    },
    {
      "term": "True or False: Every social media post must be new, unique content. | True | False",
      "definition": "False"
    },
    {
      "term": "True or False: Using Hashtags in your post are a great way to connect with potential customers. | True | False",
      "definition": "True"
    },
    {
      "term": "On Facebook, marketing goals typically fall into three categories. Which of the following is NOT one of these categories? | Conversion | Generating Awareness | Page Views | Engagement",
      "definition": "Page Views"
    },
    {
      "term": "True or False: On the Overview summary page, Facebook allows you to check insights for individual posts. | True | False",
      "definition": "False"
    },
    {
      "term": "Three conversion metrics that are important to track include which of the following? (Select all that apply) | Number of leads resulting from social media | Website visits from social media | Sales resulting from social media | Number of clicks on your posts or links inside your posts",
      "definition": "Number of leads resulting from social media | Website visits from social media | Sales resulting from social media"
    },
    {
      "term": "From the dashboard on the left navigation in Facebook Insights, you can explore which of the following? | An overview of the number of your followers | Your Total Page Likes | Total Reach | All the above",
      "definition": "All the above"
    },
    {
      "term": "Please be sure to expand the \"Instructions\" tab shown above to access the content calendar needed to answer each question. Take a look at Imra's blog post promotions. Which two posts created the most readership on the website, and what insight would that give her for writing future blog posts? (Choose two) | The personal story post created a lot of traffic; include more personal stories in future blog posts to create more of a personal connection. | The Fair Trade Day post created high engagement; write more blog posts around sustainability and worker concerns. | Seasonal flowers post had a lot of engagement; create more lists of seasonal flowers and plants. | Best wedding flowers post created a lot of engagement; create more \"best of\" lists.",
      "definition": "The personal story post created a lot of traffic; include more personal stories in future blog posts to create more of a personal connection. | The Fair Trade Day post created high engagement; write more blog posts around sustainability and worker concerns."
    },
    {
      "term": "Imra has started posting about the bouquet creations she makes for her clients, in order to showcase the flowers and her skills, which will hopefully draw more people to order something they haven't seen before. Which bouquet creations posts are receiving higher engagement? | Bouquet creations featuring only images | Bouquet creations posts that appear later in the week | Bouquet creations featuring questions | Bouquet creations posting later in the day",
      "definition": "Bouquet creations featuring questions"
    },
    {
      "term": "Imra has started a Flower of the Week post, to help educate her followers about the different types of flowers out in the world. Unfortunately, engagement has been pretty low. Which options below could improve engagement? (Choose all that apply) | Add a visual to the post | Post at more consistent and regular times | Add a link to the website | Post on a different platform | Post at a different time or day",
      "definition": "Add a link to the website | Post at a different time or day"
    },
    {
      "term": "Imra noticed a jump in new followers on Instagram on May 10. What could be a reasonable cause of that? | The Tribute to Moms images on May 10 had many click-throughs | The Insta Live at the Festival on May 9 had many impressions | The Insta Live at the Festival on May 9 had many shares | The \"Mother's Day is Sunday\" post on May 8 had many click-throughs",
      "definition": "The Insta Live at the Festival on May 9 had many impressions"
    },
    {
      "term": "Calla & Ivy is going to be hosting some summer classes on floral arrangement, and Imra has posted twice about it, once on May 20 and once on May 27. What are some ways that Imra can gain more audience members for future promotional posts? (Choose all that apply) | Post on a different platform. | Include all the information, such as class titles, descriptions, and dates. | Post at a different time of day.",
      "definition": "Post on a different platform. | Include all the information, such as class titles, descriptions, and dates."
    },
    {
      "term": "Imra started posting \"How to\" Instagram stories for various topics and noticed that her followers were very interested in these, based on the number of shares and impressions. She is planning her next \"How to\" Instagram story videos for the following month, and wants to use her insights to determine which topics her followers would most be interested in. Which topic should she choose? | Caring for house plants | Home Gardening | Maintaining flowers | Color schemes for bouquets",
      "definition": "Home Gardening"
    },
    {
      "term": "What is the importance of including a mention (@) of the account or publication where Imra found the articles to her posts? | Twitter can't track metrics unless there's an @ in the post. | It's not a concern - no need for mentions in any shared content on social media. | It gives credibility to the post. | It alerts the original poster that something they created has been shared, so that they and their audience become aware of and can engage with Calla & Ivy.",
      "definition": "It gives credibility to the post. | It alerts the original poster that something they created has been shared, so that they and their audience become aware of and can engage with Calla & Ivy."
    },
    {
      "term": "Imra makes a note of the important holidays throughout the month of May which might prompt her customers to make a purchase of her flowers. For each holiday, she has planned a post with a link to her website and a purchase page. Based on the data, we can see that the Mother's Day post received the most engagement, including the most click-throughs to the purchase page. In addition to Mother's Day being a more popular holiday for buying flowers, what is another possible cause for the higher engagement of this post? | It was posted to Facebook | It was posted in the morning | The Mother's Day post included an image | A reminder of the holiday was posted a few days prior to the post",
      "definition": "A reminder of the holiday was posted a few days prior to the post"
    },
    {
      "term": "Considering that Calla & Ivy's audience is on Instagram during the early- to mid-afternoon, how is Imra doing on her posting schedule? | Not good. Imra needs to adjust her posting time. | Pretty good! Most posts are between that time, but Calla & Ivy is still seeing good engagement from posts outside of the time frame. | The time you post something on social media doesn't matter. | Great! All posts are within that time.",
      "definition": "Pretty good! Most posts are between that time, but Calla & Ivy is still seeing good engagement from posts outside of the time frame."
    },
    {
      "term": "Which platform has the lowest engagement for Calla & Ivy, and could use more strategy for improvement? | Instagram | Twitter | Facebook | Pinterest",
      "definition": "Twitter"
    },
    {
      "term": "Please be sure to expand the \"Instructions\" tab shown above to access the content calendar needed to answer each question. Take a look at Imra's blog post promotions. Which post had the least readership on the website, and what insight would that give her for writing future blog posts? (Choose one) | Seasonal flowers post had the least engagement; observe the qualities of posts that do well and edit your seasonal flower posts going forward. | The personal story post had the least traffic; include more personal stories in future blog posts to create more of a personal connection. | Best wedding flowers post had the least engagement; create more \"best of\" lists. | The Fair Trade Day post had the least engagement; write more blog posts around sustainability and worker concerns.",
      "definition": "Seasonal flowers post had the least engagement; observe the qualities of posts that do well and edit your seasonal flower posts going forward."
    },
    {
      "term": "Imra has started a Flower of the Week post on Twitter, to help educate her followers about the different types of flowers out in the world. Is Twitter the best platform for this type of post? | No | Yes",
      "definition": "No"
    },
    {
      "term": "Calla & Ivy is going to be hosting some summer classes on floral arrangement. What are some ways that Imra can encourage customers to engage with the promotion posts for the classes? Choose two. | Include a video. | Include all the information, such as class titles, descriptions, and dates. | Post the promotion in the afternoon.",
      "definition": "Include a video. | Include all the information, such as class titles, descriptions, and dates."
    },
    {
      "term": "Imra wanted to broadcast the local Tulip Fest, on May 2, 3, and 9, to her followers in the hopes that it would boost engagement. She chose to use Insta Live video to show her audience the festival as it was happening. What could be a lesson to take into future posts? | Only use Insta Live for one day, not for consecutive days | Remind followers about the live video before it happens | Do not use Insta Live again | Use Instagram Story instead of Insta Live",
      "definition": "Remind followers about the live video before it happens"
    },
    {
      "term": "Imra has started sharing articles to Twitter she thinks her audience may find useful. What is something that Imra should keep in mind when reposting articles written by other people? | Imra should remember to mention (@) the account or publication where she found the articles | Imra should remember to track the metrics of the post. | Imra should remember to include hashtags in her post",
      "definition": "Imra should remember to mention (@) the account or publication where she found the articles"
    },
    {
      "term": "Imra makes a note of the important holidays throughout the month of May which might prompt her customers to purchase her flowers. For each holiday, she has planned a post for Facebook with a link to her website and a purchase page. Which holiday post was most successful with engagement? | Memorial Day | Teacher's Day | Mother's Day | Nurse's Day",
      "definition": "Mother's Day"
    },
    {
      "term": "Considering that Calla & Ivy's audience is on Twitter during the late afternoon and evening, how is Imra doing on her posting schedule? | Pretty good! Imra should not change her posting schedule. | She is doing okay. Imra needs to adjust some of her posting times. | Great! All posts are within that time. | The time you post something on social media doesn't matter.",
      "definition": "She is doing okay. Imra needs to adjust some of her posting times."
    },
    {
      "term": "Imra has started posting about the bouquet creations she makes for her clients, in order to showcase the flowers and her skills, which will hopefully draw more people to order something they haven't seen before. During what time of day are the bouquet creations posts most successful? | Bouquet creations posts that appear later in the week | Bouquet creations posting in the evening | It does not matter what time they are posted | Bouquet creations posting in the morning",
      "definition": "It does not matter what time they are posted"
    },
    {
      "term": "Imra has started a Flower of the Week post, to help educate her followers about the different types of flowers out in the world. However, these posts are seeing very low engagement. What could be a reasonable cause of the low engagement? | She is not using any visuals | She is posting too late in the day | She is using the wrong platform | Her audience does not like flowers",
      "definition": "She is using the wrong platform"
    },
    {
      "term": "Imra noticed a jump in new followers on Facebook on May 11. What could be a reasonable cause of that? | The Fair Trade Day content blog post on May 11 | The \"Flower of the Week\" image on May 11 | The Bouquet Creations image on May 11 | The Tribute to Moms images on May 11",
      "definition": "The Fair Trade Day content blog post on May 11"
    },
    {
      "term": "In honor of Fair Trade Day on May 13, Imra wanted to create some content to raise awareness around fair trade flower farms. Take a look at the blog post promotions from May 11, 12, and 13. What could be a lesson to take into future posts? | Creating content around a specific event doesn't increase engagement | Including a video creates higher web traffic | Nobody will click a link on Facebook if there's already an image or video | The posts should ask a question in order to get better engagement",
      "definition": "Including a video creates higher web traffic"
    },
    {
      "term": "Imra has started sharing articles to Twitter she thinks her audience may find useful, but engagement hasn't been great. You notice that she hasn't been including a mention (@) of the account or publication where she found the articles to her posts. Why is that a concern? | It doesn't alert the original poster that something they created has been shared, so that they and their audience become aware of and can engage with Calla & Ivy. | Twitter can't track metrics unless there's an @ in the post. | It doesn't give credibility to the post if it doesn't include an @. | It's not a concern - no need for mentions in any shared content on social media.",
      "definition": "It doesn't alert the original poster that something they created has been shared, so that they and their audience become aware of and can engage with Calla & Ivy."
    },
    {
      "term": "Since Calla & Ivy is a small business, and loves to support and work with the small businesses in the city, Imra has started featuring businesses in the neighborhood and how Calla & Ivy works with them through her Local Business Feature posts. What could be the reason for the high impression rate? | There's a video with the post | The posts are being posted on multiple platforms | The posts are being shared many times | People love to support small businesses",
      "definition": "People love to support small businesses"
    },
    {
      "term": "Which of the following best describes the difference between Generative AI and Machine Learning? | Machine learning is a subset of Generative AI | Machine Learning operates on fixed rules, whereas Generative AI cannot learn patterns. | Machine learning analyzes data to make predictions, while Generative AI creates new content. | Machine Learning generates content like text and images, while Generative AI does not.",
      "definition": "Machine learning analyzes data to make predictions, while Generative AI creates new content."
    },
    {
      "term": "Natural language processing is best suited to do which of the following types of generative AI? | Creating a new song | Creating an introduction video | Making an image for your website | Writing a professional email",
      "definition": "Writing a professional email"
    },
    {
      "term": "Which of the following is an ethical concern you should be aware of when using Generative AI? | Difficulty in debugging code generated by AI | High cost of implementing AI tools | Creation of viral social media posts | Creation of deepfakes",
      "definition": "Creation of deepfakes"
    },
    {
      "term": "Which business case is generative ai least suited for? | Reaching new customers. | Creating data sets for training and research purposes | Instituting a customer support chatbot | Streamline coding through code completion prompts and bug fixing.",
      "definition": "Reaching new customers."
    },
    {
      "term": "Did you successfully write an email response using Meta AI? | Yes! | Not yet",
      "definition": "Yes!"
    },
    {
      "term": "How does Generative AI support social media marketing strategies? | By analyzing data to understand audiences and generate engaging content. | By allowing for the easier manual creation of social media posts. | By eliminating the need for digital marketing strategies. | By decreasing the accuracy of targeted advertisements.",
      "definition": "By analyzing data to understand audiences and generate engaging content."
    },
    {
      "term": "How can Generative AI be used to understand your target audience? | It eliminates the need to create customer personas. | It requires significant manual data analysis. | It synthesizes large datasets to create detailed audience profiles. | It replaces the need for any audience research.",
      "definition": "It synthesizes large datasets to create detailed audience profiles."
    },
    {
      "term": "Which of the following is an advantage of using Meta Advantage tools in ad campaigns? | They streamline the manual setup of each campaign. | They limit the audience, so you can only reach specific demographics. | They replace the need for social media monitoring. | They automate campaign setup and optimize ad performance.",
      "definition": "They automate campaign setup and optimize ad performance."
    },
    {
      "term": "How can Generative AI tools enhance social media content creation? | By eliminating professional ad agencies | By creating generic content | By generating text, images, and videos based on simple prompts. | By increasing the price of content creation",
      "definition": "By generating text, images, and videos based on simple prompts."
    },
    {
      "term": "Did you create a social media post complete with the text component and the image component using Meta AI? | Yes! | Not yet",
      "definition": "Yes!"
    },
    {
      "term": "Which of the following are true about paid advertisements on social media? (Choose all that apply) | They are labeled as sponsored | They only appear in the feeds of people who follow your business | They are guaranteed to be displayed | You can control where and when your ad is shown",
      "definition": "They are labeled as sponsored | You can control where and when your ad is shown"
    },
    {
      "term": "Which of the following are true about organic posts on social media? (Choose all that apply) | They are guaranteed to be displayed to every individual who follows your account | Unless shared, they only appear directly in the feeds of people who already follow your business | You have control over when and where organic posts are seen | They are free to post",
      "definition": "Unless shared, they only appear directly in the feeds of people who already follow your business | They are free to post"
    },
    {
      "term": "In what ways can Facebook and Instagram ads help grow your business? | They can increase your followers | They can promote your website | They can bring customers to your physical location | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "True or False: Facebook and Instagram are the only social media platforms on which you can advertise. | True | False",
      "definition": "False"
    },
    {
      "term": "A video that conveys your message and tells a story is referred to as which component of a social media ad? | Target Audience | Copy | Call to Action (CTA) | Creative",
      "definition": "Creative"
    },
    {
      "term": "You're running ads for a nonprofit dedicated to ocean conservation and you want your target audience to educate themselves about your work. Which of the following Facebook Call to Action buttons would be most appropriate for your ad? | Learn More | Book Now | Download | Shop Now",
      "definition": "Learn More"
    },
    {
      "term": "You're creating an ad for a boutique smartphone case company called Case. The target audience is design-conscious people aged 21-39, with an interest in modern art and minimalist home decor.Your ad creative is a photo of a child looking pensively over the ocean. Your copy reads: \"You're stylish-shouldn't your phone be, too?\" Your CTA says \"Shop Now!\" Which part of the ad is ineffective? | Creative | Copy | CTA",
      "definition": "Creative"
    },
    {
      "term": "True or false? Mobile-video consumption is rising by 100% every year, making video ads a must for marketers. | False | True",
      "definition": "True"
    },
    {
      "term": "True or false? If you're advertising on a platform like Pinterest that doesn't offer Call-to-Action buttons, you can't include a CTA in your ad. | True | False",
      "definition": "False"
    },
    {
      "term": "Effective social media ads should always include which of the following? (Select all that apply) | A clear offer | Emojis in the ad copy | A Call-to-Action | A corresponding destination (often a landing page)",
      "definition": "A clear offer | A Call-to-Action | A corresponding destination (often a landing page)"
    },
    {
      "term": "Which of the following statements is true in regards to how paid advertising may benefit a business? (Select all that apply) | Paid advertising can help you reach a specific audience that you may not be reaching already with your organic social media efforts. | Paid advertising can help you increase your follower count. | Paid advertising will increase traffic to your site, and therefore increase conversions. | Paid advertising can help you market your business' goods and services.",
      "definition": "Paid advertising can help you reach a specific audience that you may not be reaching already with your organic social media efforts. | Paid advertising can help you increase your follower count. | Paid advertising can help you market your business' goods and services."
    },
    {
      "term": "True or False: Paid ads are guaranteed to be displayed in the feeds of your target audience. | False | True",
      "definition": "True"
    },
    {
      "term": "When choosing platforms for your paid campaign you want to consider which of the following? (Select all that apply) | Your target audience | How much you can spend | The type of content you are sharing | The type of ad you are buying",
      "definition": "Your target audience | How much you can spend | The type of content you are sharing"
    },
    {
      "term": "Twitter's Card ad formats are specific image or video ads that drive users to take a certain action. Which of the following formats do Card ads come in? (Select all that apply) | Profile Card | Email Card | Website Card | App Card",
      "definition": "Website Card | App Card"
    },
    {
      "term": "You're running ads for a business that designs tailor-made dresses and operates primarily through consultations. Which of the following Facebook Call to Action buttons should you use if you want people to sign up for a consultation? | Shop Now | Subscribe | Book Now | Watch Now",
      "definition": "Book Now"
    },
    {
      "term": "You're creating an ad for a boutique smartphone case company called Case. The target audience is design-conscious people aged 21-39, with an interest in modern art and minimalist home decor.Your ad creative is a video of four well-dressed 20s-somethings laughing over coffee, with their Case-covered phones placed on the table. Your copy reads: \"You're stylish-shouldn't your phone be, too?\" Your CTA says \"Book Now\" Which part of the ad is ineffective? | Creative | Copy | CTA",
      "definition": "CTA"
    },
    {
      "term": "True or false? Image ads are some of the most common ads that appear on social media, incorporating an eye-catching photo, overlaid with little-to-no text on the image itself. | True | False",
      "definition": "True"
    },
    {
      "term": "True or false? Your promoted post will not appear alongside other posts and stories and look almost like an organic post. | True | False",
      "definition": "False"
    },
    {
      "term": "Which of the following are ad formats offered to users for purchase on Youtube? (Select all that apply) | Video ad | Display ad | Side Ad | Overlay ad",
      "definition": "Video ad | Display ad | Overlay ad"
    },
    {
      "term": "The age, gender, location, and interests of your customers make up which component of a social media ad? | Copy | Landing Page | Creative | Target Audience",
      "definition": "Target Audience"
    },
    {
      "term": "You're running ads for a company that creates and sells art through a webshop. Which of the following Facebook Call to Action buttons should you use to get people to purchase a piece of art? | Contact Us | Book Now | Subscribe | Shop Now",
      "definition": "Shop Now"
    },
    {
      "term": "Brady is looking to advertise a new job opening at his company and is not having much luck on traditional job posting sites. To expedite the process and better target ideal candidates, he decides to run an ad. Which of the following ad types would best suit his advertising needs? | Carousel ad on Instagram | An image ad on Pinterest | Video ad on Snapchat | Sponsored InMail ads on LinkedIn",
      "definition": "Sponsored InMail ads on LinkedIn"
    },
    {
      "term": "While scrolling on your Instagram feed, you encounter what looks to be a sponsored post for a skincare product on a beauty influencer's page. Which required details of the post let you know that it's sponsored? (Select all that apply) | The post appears next to other ads in your Instagram feed | There's a \"sponsored\" label that lets you know the post is sponsored | The post has a call to action button | The influencer stated in the post's caption that it is sponsored",
      "definition": "There's a \"sponsored\" label that lets you know the post is sponsored | The post appears next to other ads in your Instagram feed"
    },
    {
      "term": "When running an ad on Facebook, you can choose to have your ad shown in which of the following locations? (Select all that apply) | Instagram direct Message | Instagram Stories | Facebook Messenger | Facebook feed",
      "definition": "Instagram Stories | Facebook Messenger | Facebook feed"
    },
    {
      "term": "True or false? A post is \"organic\" when it is posted from your account and spreads from people who engage with your content to their friends without having to pay. | True | False",
      "definition": "True"
    },
    {
      "term": "The objective for your ad campaign is to promote awareness of your brand and get people to remember it. Which KPI will be most important for you to measure? | Return on Ad Spend (ROAS) | Ad Recall Lift | Cost per visit | Conversion Rate",
      "definition": "Ad Recall Lift"
    },
    {
      "term": "The total revenue generated by an ad campaign divided by the total ad spend (how much you spend on the ad campaign) is the formula for which KPI? | Cost per lead | Cost per visit | Return on Ad Spend (ROAS) | Ad Recall Lift",
      "definition": "Return on Ad Spend (ROAS)"
    },
    {
      "term": "True or False: When designing videos for your Instagram ad campaign, you should design for sound on. | True | False",
      "definition": "False"
    },
    {
      "term": "What two things should the opening of your ad copy accomplish? (Choose all that apply) | Tell your audience what to do | Call out your audience | Present the solution to a problem | Pique the audience's curiosity",
      "definition": "Pique the audience's curiosity | Call out your audience"
    },
    {
      "term": "Which of the following are tips for writing effective copy for your ad? (Choose all that apply) | Try emojis | Create urgency | Never mention price | Change your tone depending on the channel or platform that you are using",
      "definition": "Try emojis | Create urgency"
    },
    {
      "term": "Which of the following is NOT a recommended way to source visual elements for your ads? | Source from your existing organic posts | Use product images from your online shop | Look at what worked from your competitors and copy their work | Source from user generated content",
      "definition": "Look at what worked from your competitors and copy their work"
    },
    {
      "term": "An ad agency submits a creative brief to you. It looks almost complete, but it's missing the single most important benefit of your offer for your target audience. Which creative brief element is missing? | Objective | Look and Feel | Guidelines | Key benefit",
      "definition": "Key benefit"
    },
    {
      "term": "You need someone to produce all the written materials that represent a brand. You're looking to hire a: | Designer | Email Marketer | Copywriter | Marketing Analyst",
      "definition": "Copywriter"
    },
    {
      "term": "Which part of your creative brief describes what you're trying to promote or sell? | Deliverable | Proof point | Objective | Offer",
      "definition": "Offer"
    },
    {
      "term": "True or false? If you have a Designer on your team, you will usually not need a Brand Manager as the designer can take care of the logo and brand designs. | True | False",
      "definition": "False"
    },
    {
      "term": "True or False: Brand marketers own and set the overall vision of a brand, its personality, and how it is positioned in the market. | True | False",
      "definition": "True"
    },
    {
      "term": "Which of the following are good tips to keep in mind when shooting a picture for your ad campaign? (Choose all that apply) | Follow the Rule of Thirds | Optimize for viewing on a desktop computer or a laptop | Use attractive color combinations | Keep it simple",
      "definition": "Follow the Rule of Thirds | Use attractive color combinations | Keep it simple"
    },
    {
      "term": "True or False: When shooting a video for your ad campaign, always shoot vertically. | True | False",
      "definition": "True"
    },
    {
      "term": "True or false? Once you have grabbed your audience's attention with your opening and made them aware of the problem you are solving, it's time for your call to action. | False | True",
      "definition": "False"
    },
    {
      "term": "Wes is the owner of a spa and massage center called OASIS. He wants to convey to potential customers the mental and physical benefits of his massage and spa offerings, as well as the accessibility of his business. Which of the following tips should he follow to appropriately get his message across? (Select all that apply) | Use customer reviews to support claims about physical and mental health benefits | Organize in-person massage demonstrations | Mention price or special offers for spa treatments and massages | Create an artificial timeframe to imply the offerings or benefits are only available for a limited time",
      "definition": "Use customer reviews to support claims about physical and mental health benefits | Mention price or special offers for spa treatments and massages"
    },
    {
      "term": "True or false? Copywriting and email marketing are effectively the same job, as they both involve text-based communication with customers. | True | False",
      "definition": "False"
    },
    {
      "term": "You want to run an ad campaign on Facebook for a gym facility you just started working for. You decide to brainstorm some ideas for creative visual assets to accompany the campaign. Which of the following sources should you consider first when determining your visuals? | User generated content | Reuse existing posts | Stock photos and footage | Use advertising budget to shoot from scratch",
      "definition": "Reuse existing posts"
    },
    {
      "term": "You should organize the copy of your ad into three parts. Which of the following is NOT one of those three parts? | Conclusion | Transition | Opening | Call to Action",
      "definition": "Conclusion"
    },
    {
      "term": "You need someone to create the visual assets for your campaigns. You're looking to hire a: | Designer | Email Marketer | Copywriter | Marketing Analyst",
      "definition": "Designer"
    },
    {
      "term": "Your ad objective or goal is to bring people to your online store and ultimately sell them your product. Which KPI will be most important for you to measure? | Ad Recall Lift | ROAS (Return on Ad Spend) | Cost per lead | Cost per visit",
      "definition": "ROAS (Return on Ad Spend)"
    },
    {
      "term": "True or false? Emojis can be an effective way to grab their attention and communicate in a casual way. | True | False",
      "definition": "True"
    },
    {
      "term": "An ad for luxury bathrobes appears next to an article about how to create an at-home spa experience. Is this an example of contextual or data-based advertising? | Data-based | Contextual",
      "definition": "Contextual"
    },
    {
      "term": "You just purchased a new activity tracker and are now seeing ads for running shoes and workout gear. Is this an example of contextual or data-based advertising? | Contextual | Data-based",
      "definition": "Data-based"
    },
    {
      "term": "If a company that has no clear relationship with the company you are currently interacting with is tracking your data using browser cookies, what type of data are they collecting? | First-party data | Third party data | Second-party data",
      "definition": "Third party data"
    },
    {
      "term": "This can be created on websites where people have to log in. It is a unique number assigned to someone's account and is associated with all their interactions and behavior on that website. What is this called? | UID | IP Address | Hashtag | Cookie",
      "definition": "UID"
    },
    {
      "term": "True or False: Cookies can work across multiple devices and browsers. | False | True",
      "definition": "False"
    },
    {
      "term": "True or false? Companies that violate the GDPR can be fined up to 4% of the annual revenue of a company. | True | False",
      "definition": "True"
    },
    {
      "term": "True or false? The GDPR is an international agreement that applies to both companies in the United States and the European Union, independent of where their customers or users are based. | True | False",
      "definition": "False"
    },
    {
      "term": "What is the maximum fine related to GDPR violations? | $400,000 | $4,000,000 | 4% of the annual revenue of a company | 4% of the annual profit of a company",
      "definition": "4% of the annual revenue of a company"
    },
    {
      "term": "What's the acronym for the US law that took effect in 2000 and limits the collection and use of personal information of people under the age of 13? | COPPA | GDPR | CCPA",
      "definition": "COPPA"
    },
    {
      "term": "True or false? If an advertiser or publisher enrolls in the DAA's YourAdChoices program they are automatically compliant with GDPR or CCPA. | False | True",
      "definition": "False"
    },
    {
      "term": "Which of the following are NOT European self-regulatory principles for Data-Driven Advertising? | Optimism | Education | User choice | Data security",
      "definition": "Optimism"
    },
    {
      "term": "How is data-driven advertising different from other forms of advertising? | Advertisers look for content that is typically related to their ads | Ads are matched with the audience who sees them, regardless of where the ad appears | Advertisers bid on keywords so that advertisements related to specific keywords are placed at the top of the search engine results page | Advertisers make ads match the content that surrounds it in the form of articles and videos with valuable information, making the advertising message less overt",
      "definition": "Ads are matched with the audience who sees them, regardless of where the ad appears"
    },
    {
      "term": "A website-specific code stored in a person's browser to ease navigation is called what? | Browser | Cookie | Web server log | UID",
      "definition": "Cookie"
    },
    {
      "term": "True or false? Most large online platforms and websites have a data policy, in which they explain what data they receive, what they use it for, and how people can control what they share. | True | False",
      "definition": "True"
    },
    {
      "term": "Which of the following are GDPR data protection obligations for companies who collect data? (Select all that apply) | Companies must document their advertising targeting criteria on their website | Companies are prohibited from collecting certain data categories (like ethnicity or sexual orientation) | Companies must alert people within 72 hours if their personal data was leaked | Companies must designate people whose job it is to protect the data they receive",
      "definition": "Companies are prohibited from collecting certain data categories (like ethnicity or sexual orientation) | Companies must alert people within 72 hours if their personal data was leaked | Companies must designate people whose job it is to protect the data they receive"
    },
    {
      "term": "True or false? COPPA is an extension law to CCPA? | True | False",
      "definition": "False"
    },
    {
      "term": "What's the acronym for the law that protects data and online privacy in the European Union? | GDPR | COPPA | CCPA",
      "definition": "GDPR"
    },
    {
      "term": "True or false? The main goal of industry self-regulatory organizations is to enforce data protection laws. | True | False",
      "definition": "True"
    },
    {
      "term": "True or False? Facebook users can choose to opt out of seeing ads from specific advertisers on Facebook. | True | False",
      "definition": "True"
    },
    {
      "term": "You recently signed up for a new account with Facebook. The information that you entered when signing up for your account and your interactions on your account are examples of what type of data? | A cookie | First-party data | Third-party data | Second-party data",
      "definition": "First-party data"
    },
    {
      "term": "Which of the following are GDPR citizen rights? (Select all that apply) | Citizens have the right to access the personal information received about them | Citizens have the right to correct their information | Citizens have the right to access family members' data | Citizens have the right to have all the information that was collected and saved about them erased",
      "definition": "Citizens have the right to access the personal information received about them | Citizens have the right to correct their information | Citizens have the right to have all the information that was collected and saved about them erased"
    },
    {
      "term": "Which of the following data categories are companies allowed to collect under the GDPR? | Age | Location | Ethnicity | Sexual orientation",
      "definition": "Age | Location"
    },
    {
      "term": "What's the acronym for the law that gives residents of California more insight into what data is collected about them, and was passed in 2020? | CCPA | COPPA | GDPR",
      "definition": "CCPA"
    },
    {
      "term": "True or false? The DAA's YourAdChoices program performs the same role in the US that the GDPR does in the European Union. | False | True",
      "definition": "False"
    },
    {
      "term": "Which of the following are European self-regulatory principles for Data-Driven Advertising? | Education | Parental access to children's data | User choice | Sensitive segmentation",
      "definition": "Education | User choice"
    },
    {
      "term": "True or false? Ideally, the cookie would function as the memory of the interactions between a website and a person. However, a person may use different computers, different browsers and mobile devices, and cookies don't work across devices. | False | True",
      "definition": "True"
    },
    {
      "term": "You are on Facebook and see an ad for a clothing brand that seems very specific to your particular taste. You decide to click the three dots at the top right corner of the post and use Meta's ad tool to be informed on who the advertiser is trying to reach based on their audience targeting information. This tool is called: | \"Why You're Seeing This Ad\" | \"When Will This Ad Disappear\" | \"What Does This Ad Mean\" | \"Who Is This Ad For\"",
      "definition": "\"Why You're Seeing This Ad\""
    },
    {
      "term": "Which of the following are details you can set when defining your audience on Facebook Ads Manager? | Age | Location | Specific Interests | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "Which of the following are steps in creating an ad campaign on Facebook Ads Manager? (Choose all that apply) | Choose an objective | Set a budget and campaign duration | Set your target audience | Cross post your ad on Twitter",
      "definition": "Choose an objective | Set a budget and campaign duration | Set your target audience"
    },
    {
      "term": "Let's say you just totally redesigned your business's website and it works better than ever. You want to get more people to see the update that your website just got. Which Facebook Ads Manager objective should you choose for your campaign? | Get More Website Visitors | Get More Website Purchases | Promote Your Page | Promote Your Business Locally",
      "definition": "Get More Website Visitors"
    },
    {
      "term": "Let's say you just started a company that specializes in creating specialty jewelry. You put up a business page on Facebook and are hoping people will view it and start connecting with you there. Which Facebook Ads Manager objective should you choose? | Get More Website Visitors | Get More Website Purchases | Promote Your Page | Get More Leads",
      "definition": "Promote Your Page"
    },
    {
      "term": "Let's say you have a catering business that you're promoting an Instagram post for. There are too many tiered catering options for you to list on Instagram, so you need to direct customers to a separate page. Your promoted post should direct them towards: | Your Direct Messages | Your Profile | Your Website",
      "definition": "Your Website"
    },
    {
      "term": "Let's say you're advertising a new video game on Instagram. You want your ads to be seen by people with similar interests as your current followers, but limit the age range to people under 35. Which advertising targeting option should you use? | Automatic targeting | Create Your Own Audience",
      "definition": "Create Your Own Audience"
    },
    {
      "term": "To keep your stories dynamic, you should: | Strategically deploy speed | Break them into multiple scenes | Film them without sound | Limit use of brand logos",
      "definition": "Break them into multiple scenes"
    },
    {
      "term": "True or false? After creating an ad, you submit it for review to make sure that it meets Instagram's Advertising Policies. | False | True",
      "definition": "True"
    },
    {
      "term": "You start a Facebook Business Page and want to run an ad to increase people's awareness of your business and get more Page likes. Which Facebook Ads Manager objective should you choose? | Boost A Post | Promote Your App | Promote Your Page | Get More Leads",
      "definition": "Promote Your Page"
    },
    {
      "term": "Let's say you own an online specialty kitchenwares store. You want to get more people to sign up for your new newsletter that gives cooking techniques and highlights new products. Which Facebook Ads Manager objective should you choose for your campaign? | Boost a Post | Promote Your Page | Promote Your Business Locally | Get More Leads",
      "definition": "Get More Leads"
    },
    {
      "term": "Theresa wants to run an ad on Instagram to promote her new pet care store. As she sets up her ad, she is asked to determine her target audience. She'd like her ad to reach people like those who already follow her business account. Which of the following options should she choose? | None of the above | Automatic | Create Your Own",
      "definition": "Automatic"
    },
    {
      "term": "Which success metric should you monitor if you choose the ad object \"Promote Your App\" for your Facebook business page? | Number of ad engagements | Number of people you reached | Number of app downloads | Number of website visits",
      "definition": "Number of app downloads"
    },
    {
      "term": "What action would a business want its customers to take if it selects \"Promote Your Page\" as its campaign objective when creating an ad on Facebook? | Install their app | Like a post | Make a purchase | Like their page",
      "definition": "Like their page"
    },
    {
      "term": "Let's say you have a surfboard business that you're promoting an Instagram post for. Most of your work is custom, so you need to talk with customers before they order. Your promoted post should direct them towards: | Your Direct Messages | Your Profile | Your Website",
      "definition": "Your Direct Messages"
    },
    {
      "term": "Let's say you're advertising a new restaurant on Instagram. You want your ads to be seen by people with similar interests as your current followers. Which advertising targeting option should you use? | Automatic targeting | Create Your Own Audience",
      "definition": "Automatic targeting"
    },
    {
      "term": "Which of the following statements are true about Instagram Stories Ads? (Select all that apply) | Stories ads appear between Instagram posts in your feed. | Instagram Stories Ads disappear after 24 hours. | Stories on Instagram give you an immersive, full-screen vertical format to bring your business to life. | Stories have an intimate and personal feel that allows people to be more immersed and in the moment.",
      "definition": "Stories on Instagram give you an immersive, full-screen vertical format to bring your business to life. | Stories have an intimate and personal feel that allows people to be more immersed and in the moment."
    },
    {
      "term": "True or False: Facebook Ads Manager allows you to set an ad duration and a budget for your campaign. | False | True",
      "definition": "True"
    },
    {
      "term": "Let's say you own a sporting goods store. You decide to boost a pre-existing post as an ad to create more awareness around your business and increase online visibility for your business. Which success metric should you track to determine whether your ad was successful? | Post engagement number | Number of website purchases brought in through the ad | Number of app downloads from your ad | Link clicks on your ad",
      "definition": "Post engagement number"
    },
    {
      "term": "Your business is hoping to get in contact with more of their customers directly. In order to achieve that goal, what should they do? | Select the \"Get More Website Visitors\" ad object so customers will contact you through your site | Boost a post asking customers to reach out to your page | Target an age group that is most likely to message your business | Include a CTA Send Message button on an ad",
      "definition": "Include a CTA Send Message button on an ad"
    },
    {
      "term": "What action would a business want its customers to take if it selects \"Get More Website Purchases\" as its campaign objective when creating an ad on Facebook? | Make a purchase | Install an app | View a video | Like a post",
      "definition": "Make a purchase"
    },
    {
      "term": "Let's say you have a food magazine that you're promoting an Instagram post for. Your goal is to build a larger following on Instagram to eventually grow your business. Your promoted post should direct users towards: | Your Profile | Your Website | Your Direct Messages",
      "definition": "Your Profile"
    },
    {
      "term": "True or false? Engagement rates are higher for Instagram stories without sound, as people frequently watch them muted. | True | False",
      "definition": "False"
    },
    {
      "term": "Which of the following is the first step in creating an ad campaign with Facebook Ads Manager? | Create the actual ad | Set your budget | Choosing your ad objective | Choose your target audience",
      "definition": "Choosing your ad objective"
    },
    {
      "term": "You just opened a thrift store in your town and are looking to utilize your Facebook Business page to reach people around your brick-and-mortar business. Which Facebook Ads Manager objective should you choose? | Get More Website Purchases | Get More Website Visits | Promote Your Business Locally | Promote Your Page",
      "definition": "Promote Your Business Locally"
    },
    {
      "term": "Which advertising tool on Facebook implements the simplest, and least detailed, way to create a Facebook ad? | Facebook Feed | Facebook Ads Manager App | Advertising from your Business Page | Facebook Ads Manager (web version)",
      "definition": "Advertising from your Business Page"
    },
    {
      "term": "Which two ad placement options are available on Instagram? | Stories | Feed | Marketplace | Right column",
      "definition": "Stories | Feed"
    },
    {
      "term": "Which major ad placement encompasses native, banner, interstitial, and rewarded video ads? | Search | Apps | Messages | Feed",
      "definition": "Apps"
    },
    {
      "term": "True or False? Facebook advertising happens through an auction, rather than the more traditional route of paying directly for advertising space. | True | False",
      "definition": "True"
    },
    {
      "term": "Which part of the Facebook total value ad auction equation covers how much an advertiser is willing to pay to achieve their desired outcome? | Ad Quality | Total Value | Estimated Action Rate | Advertiser Bid",
      "definition": "Advertiser Bid"
    },
    {
      "term": "Let's say two bike part companies are competing in an auction to show one person, named Marissa, an ad. Marissa lives in Portland, Oregon. She regularly buys her bike parts from internet start-ups with a Portland angle. Company One's ads target all American women who cycle, whereas Company Two's ads target cyclists who live in Portland with Portland-specific messages. Which part of Company Two's Total Value score does Marissa's purchasing history boost? | Ad Quality | Advertiser bid | Estimated Action Rate",
      "definition": "Estimated Action Rate"
    },
    {
      "term": "Which of the following are examples of ad placement options for ads created on Ads Manager? (Choose all that apply) | Stories | Profile | Media Carousel | In-Article",
      "definition": "Stories | In-Article | Feed | In-Stream | Search"
    },
    {
      "term": "Which type of major ad placement places your ads on Facebook and Facebook Marketplace if someone searches something related to your product? | In-Article | Messages | In-Stream | Search",
      "definition": "Search"
    },
    {
      "term": "Which part of the Meta total value ad auction equation tells you the numerical score Meta assigns to an ad through the auction? | Estimated Action Rate | Ad Quality | Advertiser Bid | Total Value",
      "definition": "Total Value"
    },
    {
      "term": "Let's say two skateboard companies are competing in an auction to show one person, named Daniel, an ad. Daniel lives in the mountains and loves hiking, snowboarding, and skateboarding. Company One targeted people who like skateboarding who live near the mountains in a few U.S. states. Company Two is targeting all men who like to skateboard in the U.S. Daniel clicked \"Shop Now!\" on a lot of mountain-themed skate merchandise ads in the past. Which part of Company One's Total Value score will this boost? | Advertiser Bid | Estimated Action Rate | Ad Quality",
      "definition": "Estimated Action Rate"
    },
    {
      "term": "Which part of your ad account does Meta automatically set based on your profile location? | Business Information and Advertising Purpose | Payment Settings | Account Spending Limit | Currency and Time Zone",
      "definition": "Currency and Time Zone"
    },
    {
      "term": "True or False? If you have a Facebook profile or an Instagram account, you automatically also have an Ads Manager account. | True | False",
      "definition": "True"
    },
    {
      "term": "Which of the following shows the correct order of actions you need to take at the ad level? | Write copy  add photos and videos  choose format  define destination | Choose format  add photos and videos  write copy  define destination | Choose format  define destination  write copy  add photos and videos | Add photos and videos  write copy  choose format  define destination",
      "definition": "Choose format  add photos and videos  write copy  define destination"
    },
    {
      "term": "What is the first built-in step for the campaign-creation process in Ads Manager? | Select where ads will be seen through placements | Create a Lookalike Audience based on website visitors | Align the business goal to an advertising objective | Identify the right creative for the campaign",
      "definition": "Align the business goal to an advertising objective"
    },
    {
      "term": "In what Ads Manager business tool category would you find tools to prepare mockup ad campaigns? | Engage Customers | Manage Business | Advertise",
      "definition": "Advertise"
    },
    {
      "term": "True or False? Ads Manager's Engage Customers section is where you can create a \"catalog\" of all your products. | False | True",
      "definition": "False"
    },
    {
      "term": "Which part of the Meta total value ad auction equation covers feedback from people that view or hide your ad, as well as findings of \"low-quality\" attributes such as sensationalized language, engagement bait, and more? | Total Value | Estimated Action Rate | Advertiser Bid | Ad Quality",
      "definition": "Ad Quality"
    },
    {
      "term": "Let's say two skateboard companies are competing in an auction to show one person, named Daniel, an ad. Daniel lives in the mountains and loves hiking, snowboarding, and skateboarding. Company One targeted people who like skateboarding who live near the mountains in a few U.S. states. Company Two is targeting all men who like to skateboard in the U.S. Company Two budgeted way more money than Company One for ads. Which part of their Total Value score will this boost? | Advertiser Bid | Estimated Action Rate | Ad Quality",
      "definition": "Advertiser Bid"
    },
    {
      "term": "True or False? Clicking the \"gear\" icon in the bottom corner of Ads Manager's left sidebar will bring you to the Settings menu. | True | False",
      "definition": "True"
    },
    {
      "term": "Which of the following is NOT something you define when thinking about ad sets? | Budget | Objective | Schedule | Target Audience",
      "definition": "Objective"
    },
    {
      "term": "What is the third step in the campaign-creation process in Ads Manager? | Create a Lookalike Audience based on website visitors | Create your ads-choose the ad format and then add videos or photos, write copy, and define your destination | Align the business goal to an advertising objective | Select where ads will be seen through placements",
      "definition": "Create your ads-choose the ad format and then add videos or photos, write copy, and define your destination"
    },
    {
      "term": "In what Ads Manager business tool category would you find tools to learn more about why Meta might have rejected your ad? | Advertise | Manage Business | Engage Customers",
      "definition": "Manage Business"
    },
    {
      "term": "Which type of major ad placement places your ads in some articles on the Facebook mobile app? | Search | In-Stream | In-Article | Messages",
      "definition": "In-Article"
    },
    {
      "term": "Which of the following ad account settings helps you control your total ad costs and will pause your ads after a certain spending limit is reached? | Change Currency | Payment Settings | Account Spending Limit | Notifications",
      "definition": "Account Spending Limit"
    },
    {
      "term": "Which marketing goal group focuses on encouraging customers to purchase or use your product or service? | Awareness | Consideration | Traffic | Conversion",
      "definition": "Conversion"
    },
    {
      "term": "Which specific ad campaign objective promotes traffic to your brick and mortar store? | Store Traffic | Conversion | Brand Awareness | Reach",
      "definition": "Store Traffic"
    },
    {
      "term": "If you choose the Traffic objective on Ads Manager, Facebook will show your ad to people who are: | Likely to visit your physical store | Likely to click through to your website | Likely to sign up for your newsletter | Likely to buy your product",
      "definition": "Likely to click through to your website"
    },
    {
      "term": "A car dealership wants to receive data information on Facebook from potential customers to increase test drives. Which ad objective is appropriate for this business? | Lead Generation | Brand Awareness | Engagement | Traffic",
      "definition": "Lead Generation"
    },
    {
      "term": "An animal shelter wants to raise awareness that there's going to be an influx of pets from breeding season up for adoption. They specifically want to target people who have demonstrated online interest in animals and animal adoptions. Which ad objective is appropriate for this business? | Lead Generation | Brand Awareness | Traffic | Engagement",
      "definition": "Brand Awareness"
    },
    {
      "term": "Which ad campaign objective group (and customer journey stage) includes objectives that get people to consider, seek information about, and engage with your product or service? | Awareness | Consideration | Conversion | Traffic",
      "definition": "Consideration"
    },
    {
      "term": "A retailer is opening a new store and wants to optimize towards generating more physical store visits to that location to claim exclusive offers. Which objective should the retailer apply? | Lead Generation | Engagement | Sales | Awareness",
      "definition": "Awareness"
    },
    {
      "term": "What type of budget tells Facebook how much you're willing to spend over the entire runtime of your campaign? | Lifetime budget | Advantage campaign budget | Campaign budget | Ad Set budget",
      "definition": "Lifetime budget"
    },
    {
      "term": "Let's say you have an expected revenue of $100,000. With the Rule of Thirds in mind, what should your upper limit for advertising spending be in dollars? | 30,000 | 33,333 | 50,000",
      "definition": "33,333"
    },
    {
      "term": "Which bid strategy limits what Meta can bid in every single auction? | Target Cost | Cost per Result Goal | Bid Cap | Highest Volume",
      "definition": "Bid Cap"
    },
    {
      "term": "Which bid strategy is best for making sure you don't sell any single item ever at a loss? | Bid Cap | Target Cost | Cost per Result Goal | Highest Volume",
      "definition": "Bid Cap"
    },
    {
      "term": "If you're doing a split-test, which variable should you change to test whether it's more effective to optimize for impressions, leads, link clicks, or other options. ? | Creative | Placement | Audience | Delivery Optimization",
      "definition": "Delivery Optimization"
    },
    {
      "term": "Which variable in a split compares how your ad performs with a video asset versus an image carousel, or with any other differentiation in ad-level adjustments? | Placement | Audience | Delivery Optimization | Creative",
      "definition": "Creative"
    },
    {
      "term": "Which Meta ad campaign objective group (and customer journey stage) includes objectives to create initial awareness of your brand? | Awareness | Consideration | Conversion | Traffic",
      "definition": "Awareness"
    },
    {
      "term": "Which feature in Ads Manager allows Meta to dynamically assign budget to ad sets based on their performance, therefore maximizing your spending efficiency? | Ad Set budget | Daily budget | Lifetime Budget | Advantage campaign budget",
      "definition": "Advantage campaign budget"
    },
    {
      "term": "Let's say you sell bike chains, which each cost $200. You have a revenue goal of $10,000. You know that one out of every 100 customers who visits your page buys one bike chain. How many people exactly need to visit your page for you to meet your projected revenue goal? | 5,000 | 2,000 | 10,000",
      "definition": "5,000"
    },
    {
      "term": "Which bid strategy allows you to set the average amount you're willing to pay for a desired outcome, like a conversion on your website? | Cost per Result Goal | Target Cost | Highest Volume | Bid Cap",
      "definition": "Cost per Result Goal"
    },
    {
      "term": "If you're doing a split-test, which variable should you change to compare how effective your ads are at reaching different demographics? | Creative | Placement | Audience | Delivery Optimization",
      "definition": "Audience"
    },
    {
      "term": "Which variable in a split test compares automatic placements with specifically chosen ad placements? | Placement | Audience | Delivery Optimization | Creative",
      "definition": "Placement"
    },
    {
      "term": "A nonprofit is creating a newsletter and wants to optimize towards collecting email addresses to send it to. Which objective should the nonprofit apply? | Leads | Traffic | Awareness | Engagement",
      "definition": "Leads"
    },
    {
      "term": "Which type of budget in Ads Manager lets you control how much money you spend on each ad set? | Advantage campaign budget | Campaign budget | Lifetime budget | Ad Set budget",
      "definition": "Ad Set budget"
    },
    {
      "term": "Which bid strategy tells Meta to bid with the goal of getting you the lowest possible cost per desired action, while also spending your entire budget by the end of the campaign? | Highest Value | Highest Volume | Cost per Result Goal | Bid Cap",
      "definition": "Highest Volume"
    },
    {
      "term": "Which bid strategy does Meta recommend you select in Ads Manager? | Bid Cap | Highest Volume | Cost per Result Goal | Target Cost",
      "definition": "Highest Volume"
    },
    {
      "term": "If you're doing a split-test, which variable should you change if you want to see whether one image-text combination gets more leads than another? | Creative | Placement | Audience | Delivery Optimization",
      "definition": "Creative"
    },
    {
      "term": "Which variable in a split test compares how effective your ads are at reaching different audiences or demographics? | Placement | Audience | Delivery Optimization | Creative",
      "definition": "Audience"
    },
    {
      "term": "Why is targeting your audience important? (Choose all that apply) | Find potential customers based on characteristics and behaviors who may be interested in your products or services | Better match your customers and your products | Better optimize your ad spend, time, and resources | It guarantees you future sales",
      "definition": "Find potential customers based on characteristics and behaviors who may be interested in your products or services | Better match your customers and your products | Better optimize your ad spend, time, and resources"
    },
    {
      "term": "What are the types of audiences you can create in Ads Manager? | Core Audience, Custom Audience, and Lookalike Audience | Page Followers, Website Visitors, and App Users | Custom Audience and Lookalike Audience | Core Audience, Page Followers, and Engagement",
      "definition": "Core Audience, Custom Audience, and Lookalike Audience"
    },
    {
      "term": "What criteria categories can you adjust when you create a Core Audience? | Time Zone, Zip Code, Demographics, and Behaviors | Location, Age, Gender, Network, Friends, and Other | Location, Age, Gender, Demographics, Interests, and Behaviors | Demographics, Interests, and Behaviors",
      "definition": "Location, Age, Gender, Demographics, Interests, and Behaviors"
    },
    {
      "term": "Which of the following events can the Facebook pixel track? | Placing an item in a shopping cart | Submitting an online form | Visiting a specific webpage | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "Which of the following are ways to create a Custom Audience? (Choose all that apply) | Use data from Facebook's SDK installed on your app | Upload a customer list | Use data based on a person's browsing history | Use data based on Facebook information, such as people who watch a specific video or people who have interacted with your Instagram profile",
      "definition": "Use data from Facebook's SDK installed on your app | Upload a customer list | Use data based on Facebook information, such as people who watch a specific video or people who have interacted with your Instagram profile"
    },
    {
      "term": "Which Custom Audience is better? | Typically a bigger, really broad audience is best | Typically a smaller, really broad audience is best | Typically a smaller, more specific audience is the best | Typically a bigger audience from one location is best",
      "definition": "Typically a smaller, more specific audience is the best"
    },
    {
      "term": "If a business wants to retarget customers who previously purchased an item from its website, what audience type should it use? | Page followers | Behaviors | Lookalike Audience | Custom Audience",
      "definition": "Custom Audience"
    },
    {
      "term": "Which example below best fits the concept of a \"target audience\"? | An arts-and-culture leader in the community seeing ads for college sports | An artist in the Southwest seeing an ad for an art supply sale from a brick-and-mortar store in the Northeast | A Millennial city-dweller who loves fitness seeing an ad for a new treadmill gym opening in their neighborhood | A marathon runner seeing ads for junk food",
      "definition": "A Millennial city-dweller who loves fitness seeing an ad for a new treadmill gym opening in their neighborhood | A Boston Red Sox fan seeing ads for Red Sox and other Boston sports team apparel | A suburban dad with young kids and a backyard pool seeing an ad in late spring for a new line of inflatable pool toys"
    },
    {
      "term": "The three audience types you can create in Ads Manager are Core Audiences, Lookalike Audiences, and _____________? | Custom Audiences | Personalized Audiences | Creative Audiences | Tailored Audiences",
      "definition": "Custom Audiences"
    },
    {
      "term": "An apparel company known for its line of t-shirts and hoodies is trying to boost an accessories line it launched last year, but they can't seem to get it to pick up. They know they have sales, and they know they have visitors to the product page, but they can't connect the two. Retargeting their core audience doesn't seem to be working. They recently installed the Meta Pixel on the website. What course of action can they now take? | They can track visitors to the accessories webpage, create a custom audience of those visitors, and use the lookalike audience to target new potential customers who fit the characteristics of the niche buying segment | They can use the Pixel to give them a list of names of accessory buyers, who they can reach out to directly and invite to be brand ambassadors | The Pixel actually won't be able to help them in this situation | The Pixel can design and create more attractive advertising that might attract new consumers, but they'll still need to cast a wide net to find them",
      "definition": "They can track visitors to the accessories webpage, create a custom audience of those visitors, and use the lookalike audience to target new potential customers who fit the characteristics of the niche buying segment"
    },
    {
      "term": "A skate park just opened in a suburban town, the biggest of its kind in the Northeast USA.You're creating a Core Audience for them. What criteria would you probably choose? | Location: Northeast USAAge: 18-25Gender: AllDetailed Targeting: Skateboarding, Spots, Extreme Sports, Vans, Thrasher Magazine | Location: Metro New York City AreaAge: 40-60Gender: MenDetailed Targeting: Movies, Road Movies, Motorsports, Auto Racing | Location: Southwest USAAge: 18-30Gender: AllDetailed Targeting: Movies, Action Movies, Console Gamers, Gaming, RPG | Location: New York CityAge: 30-60Gender: All",
      "definition": "Location: Northeast USAAge: 18-25Gender: AllDetailed Targeting: Skateboarding, Spots, Extreme Sports, Vans, Thrasher Magazine"
    },
    {
      "term": "A music shop wants to start advertising to bring more people in for in-person instrument lessons. They have a big following on Facebook, and a lot of people like, comment on, and share their mini video lessons. They know they can capitalize on that audience somehow, but they're not sure how. What would you tell them? | Post a comment on each video about in-person lessons | Target their entire Facebook following with advertising for in-person lessons | Create a Custom Audience from viewers of the videos, and target them with advertising for in-person lessons | Mention the in-person lessons more in their email newsletter",
      "definition": "Create a Custom Audience from viewers of the videos, and target them with advertising for in-person lessons"
    },
    {
      "term": "True or False: You must have a Lifetime budget selected in order to set a specific ads schedule (i.e. one with specified days and times). | False | True",
      "definition": "True"
    },
    {
      "term": "What is the difference between \"Stories\" ad placement and \"In-Stream\" ad placement, and why is it important? | \"Stories\" placement come as a \"commercial break\" in the story you're watching, so the user is less likely to click away; \"In-Stream\" comes between finish videos, so the user is more likely to click away | They both refer to the same thing: A video ad between Facebook and Instagram Stories. | They're different things, but they both produce the same results. | \"Stories\" placement comes between finished stories, so the user is more likely to click away; \"In-Stream\" comes as a break in the video, so the user is less likely to click away.",
      "definition": "\"Stories\" placement comes between finished stories, so the user is more likely to click away; \"In-Stream\" comes as a break in the video, so the user is less likely to click away."
    },
    {
      "term": "What is the primary goal of optimizing for \"landing page views\" in Ads Manager? | Deliver ads to unique users once a day to increase your reach | Show your ad as many times as possible | Show your ad to users who are likely to click the link and load the page | Allow Ads Manager to choose a default optimization setting it finds suitable for your campaign objective",
      "definition": "Show your ad to users who are likely to click the link and load the page"
    },
    {
      "term": "You've recently stepped in to run ads for an e-commerce business. They've run just a few ad campaigns, but saw a lot lower actions taken than they thought they would see. They're just not getting enough reach. What would you investigate? | The way the audience was set, to see if the options were set too narrowly. | The placements of the ads, to see if too many options were turned off. | The budget, to see if it's too low for what the business needs. | All of the above.",
      "definition": "All of the above."
    },
    {
      "term": "A quick service restaurant client is launching a new delivery service and wants to build awareness of the service to a large number of people. The client wants to launch a campaign that reaches people ages 18-34 who are interested in food and dining. The client has two creatives: a ThruPlay video and a 6-second video. Which objective and placements should the client use? | Leads objective on Facebook feed and Instagram Stories | Awareness objective on Instagram Stories, Instagram feed and Facebook feed | Traffic objective on Instagram Stories, Instagram feed and Facebook feed | App promotion objective on Facebook feed and Instagram feed",
      "definition": "Awareness objective on Instagram Stories, Instagram feed and Facebook feed"
    },
    {
      "term": "An apparel company known for its line of t-shirts and hoodies is trying to boost an accessories line it launched last year, but they can't seem to get it to pick up. They know they have sales, and they know they have visitors to the product page, but they can't connect the two, and retargeting their core audience doesn't seem to be working. They recently installed the Meta Pixel on the website. What are all the events they can now track? | Page visitors to see who is visiting the accessories page so they turn them into an audience | Completed purchases to see who is buying from the accessories page so they turn them into an audience | Started purchases to see who is buying from the accessories page so they turn them into an audience | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "A skate park just opened in a suburban town, the biggest of its kind in the Northeast USA:You're creating a Core Audience for them. What criteria would you probably choose? | Location: Metro New York City AreaAge: 40-60Gender: MenDetailed Targeting: Movies, Road Movies, Motorsports, Auto Racing | Location: Northeast USAAge: 18-25Gender: AllDetailed Targeting: Skateboarding, Spots, Extreme Sports, Vans, Thrasher Magazine | Location: New York CityAge: 30-60Gender: All | Location: Southwest USAAge: 18-30Gender: AllDetailed Targeting: Movies, Action Movies, Console Gamers, Gaming, RPG",
      "definition": "Location: Northeast USAAge: 18-25Gender: AllDetailed Targeting: Skateboarding, Spots, Extreme Sports, Vans, Thrasher Magazine"
    },
    {
      "term": "A commercial baking supply company can't seem to crack the code on their marketing. You've been brought in to help, and wonder if the fact that bakers work overnight is playing a factor in this.You find that Insights tells you that your target audience is on Facebook mostly late evening/early morning, while ads were scheduled during the afternoon/peak hours. Why is this good to know? | It shows that there's a connection between what your audience clicks on and when you schedule ads | It shows that there's a connection between when the audience is online and ad placement | It shows that you need to be aware of when your audience is online in order to schedule ads accordingly | It shows that ads scheduled during the afternoon/peak hours work best",
      "definition": "It shows that you need to be aware of when your audience is online in order to schedule ads accordingly"
    },
    {
      "term": "A mobile app-based company wants to improve their advertising, and wants to start playing around with Manual Placements to see if that improves their return. Of the four responses below, which would be a good place to start? | Set their ad placements to Mobile only | Set their ad placements to Audience Network only | Set their ad placements to Messenger only | Set their ad placements to Desktop only",
      "definition": "Set their ad placements to Mobile only"
    },
    {
      "term": "When you optimize for \"impressions\" in Ads Manager, what outcome should you expect? | Your ads are shown as frequently as possible | You only pay when a specific action is taken | Your ads are displayed to unique users once a day | Optimization defaults to daily unique actions",
      "definition": "Your ads are shown as frequently as possible"
    },
    {
      "term": "You've recently stepped in to run ads for an e-commerce business. They've run multiple ad campaigns, but saw a lot lower actions taken than they thought they would see. You investigate their Core Audience settings, and find the location set to three neighborhoods in San Francisco, the age set to 25-30, and just one detailed targeting criteria. What does this tell you? | They set their audience up too narrowly, but that's okay - they can just keep trying. | They set their audience up too broadly, so their Audience Size was too big, and didn't get them the right audience they needed. | They set their audience up too narrowly, so their Audience Size was too small, and didn't get them the reach they needed. | Their Core Audience looks fine, and you're not sure why there's a problem.",
      "definition": "They set their audience up too narrowly, so their Audience Size was too small, and didn't get them the reach they needed."
    },
    {
      "term": "An apparel company known for its line of t-shirts and hoodies is trying to boost an accessories line it launched last year, but they can't seem to get it to pick up. They know they have sales, and they know they have visitors to the product page, but they can't connect the two, and retargeting their core audience doesn't seem to be working. Why would installing the Meta Pixel be a good idea? | The Pixel will manage and schedule their social media content, so they can have a better strategy for targeting their audience | The Pixel is like Google Analytics, so it'll provide web metrics content | The Pixel will allow them to track events customers take - like website visits, start purchases, and completed purchases - so that they can create custom audiences and target audiences for their new product line | The Pixel will start collecting names and purchasing history to create a database for them",
      "definition": "The Pixel will allow them to track events customers take - like website visits, start purchases, and completed purchases - so that they can create custom audiences and target audiences for their new product line"
    },
    {
      "term": "A movie theater just opened in New York City. They show classic, foreign, and art-house films, and do theme weeks, film festivals, and actively promote local filmmakers, bringing them in for discussions of their films.You're creating a Core Audience for them. What criteria would you probably choose? | Location: Metro New York City AreaAge: 40-60Gender: MenDetailed Targeting: Movies, Road Movies, Motorsports, Auto Racing | Location: New York CityAge: 30-60Gender: AllDetailed Targeting: Filmmaking, Art Film, Movies, Short Films, Documentaries | Location: Northeast USAAge: 18-30Gender: AllDetailed Targeting: Movies, Action Movies, Console Gamers, Gaming, RPG | Location: New York StateAge: 30-40Gender: WomenDetailed Targeting: Visual arts, performing arts, art film, museums, galleries",
      "definition": "Location: New York CityAge: 30-60Gender: AllDetailed Targeting: Filmmaking, Art Film, Movies, Short Films, Documentaries"
    },
    {
      "term": "A local bookstore has been in a town for thirty years, owned by one family. The daughter is now taking over the business. She has plans to upgrade the store's website and create a social media presence for it. They do have a massive list of customers stored in their internal database from sales tracking and newsletter signups. How could they easily begin targeting their audience online using Ads Manager? | Upload all that customer data to create a Custom Audiences to begin targeting their audience online | Start from scratch on Ads Manager by creating a Core Audience | Ask customers in the store if they like to buy books online, and note their names for future reference | Email each person individually with a link to the bookstore's social media profiles, asking if they'll follow",
      "definition": "Upload all that customer data to create a Custom Audiences to begin targeting their audience online"
    },
    {
      "term": "A business wants to sell products online. What ad format clearly displays both a video and a product? | Video | Stories | Slideshow | Collection",
      "definition": "Collection"
    },
    {
      "term": "A new nail polish company is creating an ads campaign for the launch of their new fall line with nine different colors. In the ad all new colors must be shown to the audience. However, the business doesn't know which new products will best sell. The business wants to link each style page directly to the product with a call-to-action purchase button. Which ad format should the retailer use to meet these requirements? | Collection | Single image | Carousel | Slideshow",
      "definition": "Carousel"
    },
    {
      "term": "In the Identity section, all ads are required to be associated with what? | An Instagram Account | An Audience Insights Account | A Facebook Page | A profile",
      "definition": "A Facebook Page"
    },
    {
      "term": "True or False: Ads Manager automatically shortens ad text depending on the placement your ad receives. | True | False",
      "definition": "True"
    },
    {
      "term": "If, when you create an ad, your photo is too large for a square or horizontal format, you should: | Crop the photo | Pick a new photo | Pick a new campaign objective | Pick a new ad format",
      "definition": "Crop the photo"
    },
    {
      "term": "Which of the following things could cause Facebook to reject your ad campaign while it's in review? | \"Shock and Scare\" Violence | Vulgar Language | Sexual Content | Advertising to Teenagers",
      "definition": "\"Shock and Scare\" Violence | Vulgar Language | Sexual Content"
    },
    {
      "term": "What is a valid reason that an ad would be rejected by Facebook? | The link to the landing pages included content that was relevant to the ad | An image within the ad was relevant to its message | The ad used a video ad that was originally created for television | The ad used before-and-after weight loss photos",
      "definition": "The ad used before-and-after weight loss photos"
    },
    {
      "term": "Which ad format is designed to reflect the way people actually consume video- from bite-sized videos they watch on the go, to longer video styles they watch on the couch? | Carousel | Single Video | Collection | Single Image",
      "definition": "Single Video"
    },
    {
      "term": "A beard oil company is new to Ads Manager and wants to begin experimenting and creating ads. Which ad format is the best one with which to start? | Collection | Single image | Carousel | Slideshow",
      "definition": "Single image"
    },
    {
      "term": "An advertiser is looking to change an ad campaign's budget. Where should the advertiser navigate in Ads Manager? | Campaign level | Ad account level | Ad level | Ad set level",
      "definition": "Campaign level"
    },
    {
      "term": "True or False? It's a good idea to use stock photos when creating your ads as opposed to your own photos, as stock photos are more universal. | False | True",
      "definition": "False"
    },
    {
      "term": "You design an ad for a campaign that markets skate shoes to teens. Is Meta likely to reject this campaign for violating its Ad Policies? | Yes | No",
      "definition": "No"
    },
    {
      "term": "What is a valid reason that an ad would be rejected by Meta? | An image within the ad was relevant to its message | Lead ads were used to receive email, first name and phone number | The link to the landing pages included content that was relevant to the ad | The ad contained sexually suggestive images.",
      "definition": "The ad contained sexually suggestive images. | The ad used a Facebook logo with a red background instead of the official blue | An image within the ad focused on individual body parts"
    },
    {
      "term": "Which KPI measures how many times an ad's link to reach your website was clicked? | Estimated Ad Recall Lift | Post Engagements | Link Clicks | Conversion Events",
      "definition": "Link Clicks"
    },
    {
      "term": "A new menswear brand company delivers a campaign to generate maximum awareness among new potential customers. Which metric should the company use to evaluate the success of the campaign? | Reach | Impressions | Clicks | Conversions",
      "definition": "Reach"
    },
    {
      "term": "A men's retail business is launching a new shoe line with eight different style/color combinations. All styles must be shown to the audience. However, the business doesn't know which new products will best sell. The business wants to link each style page directly to the product to receive pixel information. Which ad format should the retailer use to meet these requirements? | Carousel | Slideshow | Video | Single image",
      "definition": "Carousel"
    },
    {
      "term": "True or False? When creating image-based ads, you should crop them to make sure they look great in a square, vertical, and horizontal format. | True | False",
      "definition": "True"
    },
    {
      "term": "You design an ad for a campaign that raises awareness about the dangers of drunk driving, and your image is a photo of a dead body after a drunk-driving accident. Is Meta likely to reject this campaign for violating its Ad Policies? | Yes | No",
      "definition": "Yes"
    },
    {
      "term": "Which KPI estimates how many people would remember seeing your ad if they were asked within two days? | Conversion Events | Cost per Link Click | Estimated Ad Recall Lift | Post Engagements",
      "definition": "Estimated Ad Recall Lift"
    },
    {
      "term": "A new alcoholic seltzer company wants to compete in a crowded market by creating a video ad campaign which people will remember when they go to the store. Which metric should the company use to evaluate the success of the campaign? | Impressions | Conversions | Estimated Ad Recall Lift | Reach",
      "definition": "Estimated Ad Recall Lift"
    },
    {
      "term": "Which ad format opens up a broader catalog of up to 50 different products when tapped on? | Single Image | Carousel | Collection | Single Video",
      "definition": "Collection"
    },
    {
      "term": "A hardware business wants users to immediately be able to browse its pipe collection, which contains more than 25 types of pipe of varying lengths and widths. Which ad format should the retailer use to meet these requirements? | Collection | Single image | Slideshow | Carousel",
      "definition": "Collection"
    },
    {
      "term": "An advertiser is delivering an ad campaign and recently created an Instagram business profile. Where should the advertiser navigate in Ads Manager in order to include the Instagram business profile in the campaign? | Ad set level | Campaign level | Ad account level | Ad level",
      "definition": "Ad set level"
    },
    {
      "term": "Which KPI measures all reactions, comments, shares and clicks on your post? | Conversion Events | Landing Page Views | Estimated Ad Recall Lift | Post Engagements",
      "definition": "Post Engagements"
    },
    {
      "term": "Which interface can be used to set up a Facebook ad campaign? | Facebook IQ ads | Ads Manager | Facebook Insights | Mobile Studio Advertising | Creative Hub ads",
      "definition": "Ads Manager"
    },
    {
      "term": "What is the primary goal of a Facebook group? | A space to organize and respond to public Facebook events | A space where businesses can visualize Facebook Page performance | A space to communicate about shared interests with certain people on Facebook | A space where businesses can display and sell products in Facebook shop",
      "definition": "A space to communicate about shared interests with certain people on Facebook"
    },
    {
      "term": "Which of the following statements are true about Instagram Stories Ads? (Select two) | Stories ads appear between Instagram posts in your feed. | Stories have an intimate and personal feel that allows people to be more immersed and in the moment. | Stories on Instagram give you an immersive, full-screen vertical format to bring your business to life. | Instagram ads only appear in people's stories for 24 hours.",
      "definition": "Stories have an intimate and personal feel that allows people to be more immersed and in the moment. | Stories on Instagram give you an immersive, full-screen vertical format to bring your business to life."
    },
    {
      "term": "What is a benefit of using a Facebook ad instead of a regular Page post? | Facebook ads let you share a slideshow | Facebook ads can reach a more specific audience | Facebook ads offer video options | Facebook ads allow comments, likes, and shares | Facebook ads do not appear in News Feed",
      "definition": "Facebook ads can reach a more specific audience"
    },
    {
      "term": "What can a boosted post help an advertiser achieve? | Obtain in-depth reporting that includes cost per purchase | Measure the number of purchases on the business website | Increase engagement on Page content | Have their message appear on the top of people's news feeds | Review actions on the business website",
      "definition": "Increase engagement on Page content"
    },
    {
      "term": "What is the first step required to establish a business presence on Facebook? | Create an ad | Pay to set up your business account | Create an event | Create a page | Create a post",
      "definition": "Create a page"
    },
    {
      "term": "Which of these is an ad account permission granted to the analyst role? | Manage admin permissions | Create and edit ads | Pause ad campaigns | Edit payment method | Access reports",
      "definition": "Access reports"
    },
    {
      "term": "When can you include a dedicated link to your landing page? | When you create an ad | When you create a story | When you boost a Page post | When you create a post | When you promote a post",
      "definition": "When you create an ad"
    },
    {
      "term": "When you begin a new campaign on Ads Manager, what is the first step in the process? | Produce the right creative for the campaign | Align your marketing goal with a campaign objective | Select where ads will be seen through placements | Create a Lookalike Audience based on website visitors",
      "definition": "Align your marketing goal with a campaign objective"
    },
    {
      "term": "You want to set a maximum bid amount for individual actions like link clicks and landing page views. What should you create? | Promoted post | Boosted Page post | Facebook ad | Advertising budget | Instagram post",
      "definition": "Facebook ad"
    },
    {
      "term": "If your goal is to generate sales on your website, which campaign objective should you select? | Engagement | Sales | Awareness | Traffic",
      "definition": "Sales"
    },
    {
      "term": "If you select Traffic as your campaign objective, what are you hoping your audience will do? | Make a purchase | View a video | Visit your website | Install an app",
      "definition": "Visit your website"
    },
    {
      "term": "What are the benefits of Meta Pixel? (Choose two) | Helps advertisers reach the right people | Measures the results of an ad across devices | Helps advertisers to create ad mock-ups | Measures in-app activity",
      "definition": "Helps advertisers reach the right people | Measures the results of an ad across devices"
    },
    {
      "term": "Which two ad placement options are available on Instagram? (Choose two) | Marketplace | Feed | Right column | Stories",
      "definition": "Feed | Stories"
    },
    {
      "term": "Which two variables are available for A/B tests? (Choose two) | Placement | Audience | Objective | Bid type | Bid Cap",
      "definition": "Placement | Audience"
    },
    {
      "term": "Which two settings can be changed at the ad set level? (Choose two) | Headline | Bid amount | Objective | Image | Placements",
      "definition": "Bid amount | Placements"
    },
    {
      "term": "Which part of the total value ad auction equation covers feedback from people that view or hide your ad, as well as findings of \"low-quality\" attributes such as sensationalized language, engagement bait, and more? | Total Value | Advertiser Bid | Estimated Action Rate | Ad Quality",
      "definition": "Ad Quality"
    },
    {
      "term": "A car dealership wants to receive contact information on Facebook from potential customers to increase test drives. Which campaign objective is appropriate for this business? | Traffic | Awareness | Engagement | Leads",
      "definition": "Leads"
    },
    {
      "term": "A new ecommerce company wants more people to start conversations through Messenger or WhatsApp for customer service. Which campaign objective should be used to meet this business goal? | Leads | Engagement | Sales | Awareness | Click to chat",
      "definition": "Engagement"
    },
    {
      "term": "A business wants to acquire new customers and increase sales. Which strategy should the business select? | Reach more people through the Awareness objective and retarget them with lead ads | Use the Engagement objective to interact with its audience | Create a campaign with the Sales objective | Create a campaign with the Leads objective and contact its leads with relevant information | Use the Traffic objective to generate more traffic to the website",
      "definition": "Create a campaign with the Sales objective"
    },
    {
      "term": "Which element is required to create a Custom Audience from website visitors? | Facebook profile | User Cookie | Meta Pixel | Meta SDK | Facebook Shop",
      "definition": "Meta Pixel"
    },
    {
      "term": "Who do businesses try to reach with a lookalike audience? | People who have shown interest in the brand in the past | People for whom the business has contact information | People who have indicated certain interests | People who have a similar profile to an existing audience | People who have visited the website of the advertiser",
      "definition": "People who have a similar profile to an existing audience"
    },
    {
      "term": "Which type of major ad placement places your ads before, during or after video content? | In-Article | Search | Messages | In-Stream",
      "definition": "In-Stream"
    },
    {
      "term": "What can you estimate when creating a Awareness campaign? | Reach | Conversions | Link clicks | Likes",
      "definition": "Reach"
    },
    {
      "term": "In which major section of Ads Manager (found in the top navigation bar) would you prepare mockup ad campaigns? | Advertise | Manage Business | Engage Customers",
      "definition": "Advertise"
    },
    {
      "term": "Which of the following are GDPR citizen rights? (Select three) | Citizens have the right to access the personal information received about them | Citizens have the right to have all the information that was collected and saved about them erased | Citizens have the right to access family members' data | Citizens have the right to correct their information",
      "definition": "Citizens have the right to access the personal information received about them | Citizens have the right to have all the information that was collected and saved about them erased | Citizens have the right to correct their information"
    },
    {
      "term": "What can public figures, businesses, brands, organizations and nonprofits create on Facebook to establish a presence and connect with an audience? | Event | Page | Group | Profile",
      "definition": "Page"
    },
    {
      "term": "What is the minimum criteria a company must meet to receive the \"very responsive to messages\" badge? | A response rate of at least 95% and a response time of less than 15 minutes | A response rate of at least 90% and a response time of less than 15 minutes | A response rate of at least 70% and a response time of less than 30 minutes | A response rate of at least 80% and a response time of less than 20 minutes",
      "definition": "A response rate of at least 90% and a response time of less than 15 minutes"
    },
    {
      "term": "What is a similarity between a boosted post and Facebook ad? | Both use advanced targeting capabilities | Both are designed to make people shop on your website | Both are created in Meta Ads Manager | Both increase audience engagement | Both require budget to be shared with a wider audience",
      "definition": "Both require budget to be shared with a wider audience"
    },
    {
      "term": "What must you do first in order to establish a business presence on Instagram? | Post content using relevant hashtags | Add pertinent business information | Switch a personal profile to a business profile | Start following similar business accounts",
      "definition": "Switch a personal profile to a business profile"
    },
    {
      "term": "Which role for managing your Facebook page is the lowest class of permissioning and has access to audience data? | Analyst | Moderator | Jobs Manager | Editor",
      "definition": "Analyst"
    },
    {
      "term": "Which feature is available for an unpaid (organic) post on a Page? | Select a placement | Assign a budget | Select an objective | Add a video",
      "definition": "Add a video"
    },
    {
      "term": "What is the structure of an Ad Campaign, as set through Ads Manager? | Ad set --> ad --> campaign | Ad set --> ad | Campaign --> ad set --> ad | Campaign --> ad set",
      "definition": "Campaign --> ad set --> ad"
    },
    {
      "term": "What action does a business want its customers to take if it selects Traffic as its campaign objective? | Comment or react to the ad | View a video | Remember an ad | Visit business website | Make a purchase",
      "definition": "Visit business website"
    },
    {
      "term": "You recently installed the Meta Pixel on your company's website. At what level should you choose the conversion event optimization? | Campaign | Ad | Ad set | Ad account",
      "definition": "Ad set"
    },
    {
      "term": "An advertiser wants to get a high-level view of how all of their campaigns are performing. Which level of Ads Manager should they view to see these results? | Ad level | Ad set level | Campaign level | Ad account level | Business manager level",
      "definition": "Ad account level"
    },
    {
      "term": "Which part of the total value ad auction equation tells you how much an advertiser is willing to pay to achieve their desired outcome? | Advertiser Bid | Estimated Action Rate | Total Value | Ad Quality",
      "definition": "Advertiser Bid"
    },
    {
      "term": "An online store wants to build a database of customer information but it does not have the Meta Pixel installed. Which campaign objective meets this business goal? | Awareness | Engagement | Traffic | Sales | Leads",
      "definition": "Leads"
    },
    {
      "term": "A brand wants to send more people to the App Store to download its app. Which campaign objective is most relevant? | App Conversions | App Promotion | App Reach | App Lead Generation | App Traffic",
      "definition": "App Promotion"
    },
    {
      "term": "Where can an advertiser create a Custom Audience or Lookalike Audience? | Audience Insights | Audiences | Page Insights | Campaign Planner",
      "definition": "Audiences"
    },
    {
      "term": "Which audience creation tool should be used to create an audience of people who have signed up for a business's newsletter? | Custom Audience | Saved audience | Lookalike Audience | Core Audience",
      "definition": "Custom Audience"
    },
    {
      "term": "What is an advantage of using the slideshow format instead of video when designing an ad for mobile? | It uses 3D animation | It is the most interactive ad format | It always puts the brand first | It works well in areas with limited connectivity",
      "definition": "It works well in areas with limited connectivity"
    },
    {
      "term": "In order to access the ad scheduling feature in Ads Manager, which setting must you select? | Advantage+ Placements | Lifetime budget | Daily budget | Accelerated delivery",
      "definition": "Lifetime budget"
    },
    {
      "term": "Which variable in a split test compares how your ad performs with a video asset versus an image carousel, or with any other differentiation in ad-level adjustments? | Placement | Audience | Delivery Optimization | Creative",
      "definition": "Creative"
    },
    {
      "term": "You have created a campaign with multiple ad sets and individual ads. You want to know the amount spent on a specific ad set. Where can this be found? | The Campaigns tab within Ads Manager in the Amount Spent column | The Campaigns tab within Ads Manager in the Budget column | The Ad Set tab within Ads Manager in the Budget column | The Ad Set tab within Ads Manager in the Amount Spent column",
      "definition": "The Ad Set tab within Ads Manager in the Amount Spent column"
    },
    {
      "term": "What's the difference between reach and impressions? | Impressions and reach are different words for the same thing, which is how many people saw an ad | Impressions refers to how many times an ad appeared on a screen, Reach refers to the number of times the ad changed the brand perception of the person it was shown to | Impressions refers to how many times an ad appeared on a screen. Reach is an estimate of how many people saw an ad | Impressions and reach are different words for the same thing, which is how many times an ad appeared on a screen | Impressions refers to how many people saw an ad. Reach refers to how many times an ad appeared on a screen",
      "definition": "Impressions refers to how many times an ad appeared on a screen. Reach is an estimate of how many people saw an ad"
    },
    {
      "term": "How can a business increase the reach of an organic post on its Page without creating a campaign in Ads Manager? | Add a link to its website | Create a new ad set | Boost the post | Edit the post | Sponsor the Page",
      "definition": "Boost the post"
    },
    {
      "term": "What is organic reach? | The number of people reached after setting up a Custom Audience | The number of people who have seen a post through paid distribution | The number of followers of your Facebook page | The number of people who have shared a boosted Page post | The number of people who have seen a post through unpaid distribution",
      "definition": "The number of people who have seen a post through unpaid distribution"
    },
    {
      "term": "Which Facebook roles are able to manage an ad account? (Choose two) | Viewer | Analyst | Administrator | Advertiser",
      "definition": "Administrator | Advertiser"
    },
    {
      "term": "In what order is an advertising campaign created in Ads Manager? | Campaign, Ad Set, Ad | Campaign, Ad, Destination URL | Ad set, Campaign, Ad | Ad, Ad Set, Campaign | Creative, Call to Action, Budget",
      "definition": "Campaign, Ad Set, Ad"
    },
    {
      "term": "Where is the pixel installed? | Business App | Ads Manager | Personal Facebook Page | Facebook Page | Business website",
      "definition": "Business website"
    },
    {
      "term": "Which two ad placement platforms are available when you create an ad in Ads Manager? (Choose two) | Audience Network | Twitter | Audience Insights | Facebook Page | Instagram Feed",
      "definition": "Audience Network | Instagram Feed"
    },
    {
      "term": "A restaurant launches a video campaign for a new location. The goal is to maximize the number of times the video has started to play per impression. Which metric should be used to measure success? | Video ThruPlays | Reach | Video plays | Sales | 3-second video views",
      "definition": "Video plays"
    },
    {
      "term": "A retailer is opening a new store and wants to optimize towards generating more physical store visits by creating strong awareness in the local population. Which objective should the retailer apply? | Awareness | Engagement | Leads | Sales",
      "definition": "Awareness"
    },
    {
      "term": "A retail business is launching a new shoe line with eight different style and color combinations. All styles must be shown to the audience. However, the business isn't sure which products will sell best. The business wants to link each style page directly to the product to receive pixel information. Which ad format should the retailer use to meet these requirements?\" | Carousel | Single image | Video | Slideshow",
      "definition": "Carousel"
    },
    {
      "term": "A business set up a campaign. During the process, it tested different placements and observed a higher estimated total reach when it selected automatic placements. What caused this result? | Advantage+ Placements more efficiently set up a bid cap. | Advantage+ Placements more efficiently allocated the ad set budget. | Advantage+ Placements are automatically optimized the ad shown to different users | Advantage+ Placements more efficiently adjusted the cost control. | Advantage+ Placements more efficiently distributed the ad bids.",
      "definition": "Advantage+ Placements more efficiently allocated the ad set budget."
    },
    {
      "term": "True or False: You must have a lifetime budget selected in order to set a specific ad set schedule (i.e. one with specified days and times). | False | True",
      "definition": "True"
    },
    {
      "term": "A business wants to forecast the reach of their ad set. Which tool should an advertiser use to perform this task? | Attribution | Estimated daily results | Analytics | Audience Insights",
      "definition": "Estimated daily results"
    },
    {
      "term": "A candy company creates a campaign to increase sales of its candies through its website. Which metric should the company use to evaluate the success of the campaign? | Awareness | Sales | Impressions | Clicks",
      "definition": "Sales"
    },
    {
      "term": "Which of the following are GDPR data protection obligations for companies who collect data? (Select three) | Companies are prohibited from collecting certain data categories (like ethnicity or sexual orientation) | Companies must document their advertising targeting criteria on their website | Companies must designate people whose job it is to protect the data they receive | Companies must alert people within 72 hours if their personal data was leaked",
      "definition": "Companies are prohibited from collecting certain data categories (like ethnicity or sexual orientation) | Companies must designate people whose job it is to protect the data they receive | Companies must alert people within 72 hours if their personal data was leaked"
    },
    {
      "term": "DCB Cleaning ran an $800 campaign for businesses with new locations, offering one month of cleaning services for $300. They had 10 new clients sign up. What was the ROAS of the campaign? | 0.375 | 3.75 | 26.67",
      "definition": "3.75"
    },
    {
      "term": "DCB Cleaning ran another campaign targeting big businesses looking to switch their cleaning services, offering a six month commitment for $1000. The campaign ran for three months, at $200 per month, and gained 6 new clients. What was the ROAS? | 30 | 10 | 1.67 | 5",
      "definition": "10"
    },
    {
      "term": "DCB Cleaning ran a campaign to get people to download their app, knowing that for every five downloads, they generate $200 in revenue. The campaign cost $1000 and they received 75 downloads. What was the ROAS? | 15 | 3 | 1",
      "definition": "3"
    },
    {
      "term": "Inu + Neko is launching a new product line on their website: bandanas for dogs. Each one costs $10, and in the month of their $800 campaign they sold out all 200 bandanas. What was the ROAS? | 2.5 | 0.25 | 25",
      "definition": "2.5"
    },
    {
      "term": "Each bandana cost Inu + Neko $2 each to make. Remember that they sold 200 bandanas at $10 a piece and spent $800 on an ad campaign.What was their ROI on the campaign?(Round your answer to the nearest hundredth) | 0.67 | 2 | 1.57",
      "definition": "0.67"
    },
    {
      "term": "Having spent $800 on their ad campaign, Inu + Neko sold out of their initial stock of 200 bandanas. They also collected 500 preorders. What is their ROAS now? Note: You do not need to take the cost of materials into account for the ROAS calculation. | 8.75 | 6.25 | 0.875",
      "definition": "8.75"
    },
    {
      "term": "Inu + Neko ran another campaign driving traffic to their website, which cost them $1000 over the course of two months. They received 2,000 new website visits, each of whom averaged out to $5.50 a purchase. What was the ROAS? | 2.75 | 2 | 11",
      "definition": "11"
    },
    {
      "term": "Calla & Ivy ran a lead generation campaign for a free bouquet, knowing that one out of every four people eventually spend $50. They received 200 sign-ups for a campaign that cost $200. What was the ROAS? | 50 | 1 | 12.5",
      "definition": "12.5"
    },
    {
      "term": "It costs Calla & Ivy $10 in materials to make each free bouquet. Keep in mind that they spent $200 on their marketing campaign and 50 of their 200 sign-ups each resulted in a $50 purchase. What is their ROI? | 10 | 12.45 | 40 | 47.5",
      "definition": "10"
    },
    {
      "term": "Calla & Ivy ran a campaign to boost app downloads, knowing that one out of every six people eventually purchase a subscription for $100. They spent $800 on the campaign and received 48 downloads. What was the ROAS? | 2.88 | 0.75 | 1 | 6",
      "definition": "1"
    },
    {
      "term": "Inu + Neko has recently run a number of campaigns, and is calculating the Cost Per Result of each. First, they start with a reach campaign, which generated 1,000 impressions for a $200 campaign. What was the Cost Per Result? | $0.02 | $0.20 | $2.00",
      "definition": "$0.20"
    },
    {
      "term": "They ran another reach campaign spending the same amount ($200) and changed some of their settings. This time, they generated ten times more impressions than the last campaign, which generated 1,000 impressions. What was the Cost Per Result? | $0.20 | $200 | $0.02",
      "definition": "$0.02"
    },
    {
      "term": "Their next campaign was a lead generation campaign. They know that every five leads converts into a $20 sale. The campaign cost $800, and they generated 1,000 leads. What was the Cost Per Result? | $0.25 | $4.00 | $0.80",
      "definition": "$0.80"
    },
    {
      "term": "They ran another lead generation campaign, which cost them $200 per month for four months. Over that four months they brought in 2,000 leads, double the amount of leads as before. What was the Cost Per Result? | $0.40 | $0.025 | $0.10",
      "definition": "$0.40"
    },
    {
      "term": "Next, they ran a campaign to increase views on their grooming videos. They allocated a $10 daily budget for the month of September, which has 30 days. They received 75 plays by the end. What was the Cost Per Result? | $4.00 | $0.13 | $0.40",
      "definition": "$4.00"
    },
    {
      "term": "Not liking the Cost Per Result of the previous campaign, Inu + Neko ran another campaign and adjusted their settings in Ads Manager. They spent the same amount, $300, and received 300 views, which is four times the previous amount. What was the Cost Per Result? | $1.00 | $0.25 | $2.00",
      "definition": "$1.00"
    },
    {
      "term": "Inu + Neko is trying to drive more traffic to the new products on their site, and set up a conversion campaign, allotting $500 a month for six months. At the end of that time they made $20,000 in sales from 600 customers. What was the Cost Per Result? | $5.00 | $0.15 | $2.00",
      "definition": "$5.00"
    },
    {
      "term": "Inu + Neko wants to test out Catalogue Sales to showcase more inventory from their online store. They set up a campaign that cost $1500 total and lasted three months, and got 200 conversions for a total of $6000 revenue. What was the Cost Per Result? | $7.50 | $0.25 | $0.75",
      "definition": "$7.50"
    },
    {
      "term": "Inu + Neko set up a traffic campaign to drive visitors to their website, paying $200 a month for five months. Over the course of that time, they gained 10,000 new visits, half from advertising and half from organic. What was the Cost Per Result? | $0.10 | $0.20 | $0.02",
      "definition": "$0.20"
    },
    {
      "term": "After that campaign, they changed some of their settings, but set up the same five month campaign at the same price. After that time, they gained another 10,000 visitors, three-quarters of which came from organic traffic. What was the Cost Per Result? | $0.40 | $0.05 | $0.13",
      "definition": "$0.40"
    },
    {
      "term": "Calla & Ivy want to figure out the lifetime value of their customers. They know that the average customer's value is $50 a month, and the average lifespan of a customer is 5 years (60 months). What is the LTV? | $250 | $3000 | $600",
      "definition": "$3000"
    },
    {
      "term": "The information for Questions 2-5 will be connected. Each subsequent question will require information from the previous questions to solve. Calla & Ivy are now trying to figure out some of the components of lifetime value for a particular demographic that comes into the store to buy flowers. This demographic made 100 purchases and spent $12,000 in the last month. What is their Average Purchase Value? | $120 | $1200 | $12,000",
      "definition": "$120"
    },
    {
      "term": "Next, Calla & Ivy want to figure out the purchase frequency. There were 50 people in this demographic that made purchases last month. What is the Average Purchase Frequency Rate per month? You need to use the information in Question 2 to figure this one out. | .5 | 240 | 2",
      "definition": "2"
    },
    {
      "term": "What is the Average Customer Value per month for this particular demographic? You need to use the information in Questions 2 & 3 to figure this one out. | $240 | $60 | $120",
      "definition": "$240"
    },
    {
      "term": "If the average lifespan of a customer is 5 years, what is the LTV per customer for this demographic? You need to use the answer from Question 4 to figure this one out. | $14,400 | $5,000 | $1,200",
      "definition": "$14,400"
    },
    {
      "term": "The information in Questions 6-9 is all connected. Each subsequent question will require information from the previous questions to solve. Inu + Neko are now trying to calculate the LTV of their customers. Last month, they made $30,000 over 1500 purchases. What was their Average Purchase Value? | $2,000 | $20 | $31,500",
      "definition": "$20"
    },
    {
      "term": "As for Inu + Neko's purchase frequency, they were able to see that 1000 people bought something at the store. What is the Average Purchase Frequency Rate per month? You need to use the information in Question 6 to figure this out. | 15 | 30 | 1.5",
      "definition": "1.5"
    },
    {
      "term": "What is Inu & Neko's Average Customer Value per month? You need to use the information from Questions 6 & 7 to figure this out. | $15 | $1.5 | $30",
      "definition": "$30"
    },
    {
      "term": "If the average lifespan of a customer is 12 years (the lifetime of their pet), what is the LTV per customer? You need to use the answer from Question 8 to figure this out. | $240 | $4320 | $360 | $2880",
      "definition": "$4320"
    },
    {
      "term": "SnackWall has increased the yearly subscription so that the Average Purchase Value has now changed to $2500 for small businesses. If there were 8 small businesses that each purchased one yearly subscription in the past year, and the Average Customer Lifespan is 10 years, what would the customer LTV for small businesses be? | $20,000 | $200,000 | $25,000 | $300,000",
      "definition": "$25,000"
    },
    {
      "term": "A business wants to evaluate their campaign, and specifically wants to look at how much net profit after investments they made versus how much they spent on advertising. This measurement would be: | ROAS | LTV | CPR | ROI",
      "definition": "ROI"
    },
    {
      "term": "A business wants to evaluate how much they're spending on their customers, versus how much their customers go on to spend. If they want to see how much a customer will spend during the time they're a customer, that measurement would be: | CAC | ROI | CPR | LTV",
      "definition": "LTV"
    },
    {
      "term": "A business is setting up a campaign, and is thinking ahead to which metrics they would want to track. Which KPIs would you track for an awareness campaign? | Reach, impression, or brand awareness | Likes, traffic, or engagement | Purchases, store visits, or lead generation | None of the above",
      "definition": "Reach, impression, or brand awareness"
    },
    {
      "term": "A business set up an awareness campaign, a consideration campaign, and a conversion campaign to get new customers to their first purchase. They spent $3000 on the awareness campaign, $2000 on the consideration campaign, and $2000 on the conversion campaign. At the end of it, they got 140 new customers. What was their Customer Acquisition Cost? | $20 per customer | $60 per customer | $40 per customer | $50 per customer",
      "definition": "$50 per customer"
    },
    {
      "term": "A company recently sold $10,000 worth of products, yet only spent $2000 on their advertising. What was their ROI, if they sold 5000 units, which cost $.50 to make? | 5 | 3.75 | 4 | 1.22",
      "definition": "1.22"
    },
    {
      "term": "A marketing manager is attempting to collect data on their campaign. Where could they find information on website traffic? | Web host analytics dashboard | Google Analytics | Adobe Analytics | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "A coffee shop's average customer comes in twice a week, and spends $5 on each purchase. An average customer will spend five years frequenting that coffee shop. What is their lifetime value? | $2,600 | $3,000 | $1,300 | $5,200",
      "definition": "$2,600"
    },
    {
      "term": "A business recently ran an awareness campaign, where they spent $200 a month for three months. At the end of that time they gained 2000 impressions. What was their Cost Per Result? | $0.40 | $0.20 | $0.10 | $0.30",
      "definition": "$0.30"
    },
    {
      "term": "A business wants to see how well its campaigns are going. They've had an ROAS of around 3 in the past, and want to get a bigger return than that. They spent $600 and sold $2,100 worth. How did they do? | They stayed the same | Better - their ROAS went up by 1 | Worse - their ROAS went down by .5 | Better - their ROAS went up by .5",
      "definition": "Better - their ROAS went up by .5"
    },
    {
      "term": "A business determined that they spent $50 to acquire a customer. What would be included in that amount? | Money spent on awareness campaigns | Money spent on consideration campaigns | Money spent on conversion campaigns | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "A business is setting up a campaign, and is thinking ahead to which metrics they would want to track. Which KPIs would you track for a conversion campaign? | Purchases, store visits, or lead generation | Reach, impression, or brand awareness | Likes, traffic, or engagement | None of the above",
      "definition": "Purchases, store visits, or lead generation"
    },
    {
      "term": "A marketing manager is attempting to collect data on their campaign. Where would they gather metrics from? | Meta Ads Manager | Google Analytics | Individual platform dashboards | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "A business had an ROAS of 5 for their last campaign, and they're pretty happy about it. They changed a few settings, though, based on their data, and for this campaign, on which they spent $2000, they generated $14,000 worth of revenue. How did they do? | Worse - their ROAS went down by 2 | Better - their ROAS went up by 2 | Worse - their ROAS went down by 1 | Better - their ROAS went up by 3",
      "definition": "Better - their ROAS went up by 2"
    },
    {
      "term": "A business ran a consideration campaign, where their Cost Per Result was $0.50. Considering their previous campaign returned a Cost Per Result of $0.75, how did they do? | Better - their Cost Per Result went up | There's no way to tell | Better - their Cost Per Result went down | Worse - their Cost Per Result went down",
      "definition": "Better - their Cost Per Result went down"
    },
    {
      "term": "A business wants to evaluate how much they're spending on their customers, versus how much their customers go on to spend. If they want to see how much they spent on getting the customer to a first purchase, that measurement would be: | CPR | ROI | LTV | CAC",
      "definition": "CAC"
    },
    {
      "term": "A business set up an awareness campaign, a consideration campaign, and a conversion campaign to get new customers to their first purchase. If they spent $10,000 total and got 500 new customers, what was their Customer Acquisition Cost? | $5 per customer | $100 per customer | $20 per customer | $50 per customer",
      "definition": "$20 per customer"
    },
    {
      "term": "A company sells products that cost them $5 each to produce. They recently spent $2500 on advertising, and sold 300 of them at a $20 price point. What was their ROI? | 0.5 | 2.4 | 2 | 1.8",
      "definition": "2.4"
    },
    {
      "term": "A business recently ran a consideration campaign, where they spent $1000 total for two months. At the end of that time they had 10,000 new visitors to their website. What was their Cost Per Result? | $0.40 | $0.10 | $0.30 | $0.20",
      "definition": "$0.10"
    },
    {
      "term": "A business is trying to get a better return on their ad spend - they've been hovering around 1.5 - and they're hoping this last campaign helped. It ran at $400 ad spend a month for three months, and they generated $1500 in revenue. How did they do? | Worse - their ROAS went down by .5 | Worse - their ROAS went down by .25 | Better - their ROAS went up by .5 | Better - their ROAS went up by .1",
      "definition": "Worse - their ROAS went down by .25"
    },
    {
      "term": "Experiments use a treatment and a control group. Which of the following correctly describes how the treatment and control group differ when testing advertising effectiveness? | People in the treatment group are guaranteed to see your ad, people in the control group won't see your ad | The treatment group may see your ad, the control group won't see your ad | People in the treatment group will see a different version of your ad from the people in the control group | People in the treatment group will see your ad more often than people in the control group, who will only see your ad once",
      "definition": "The treatment group may see your ad, the control group won't see your ad"
    },
    {
      "term": "When you decide to run an advertising effectiveness study using experiments, which 2 conditions should be met to make your study powerful? | The advertising effectiveness test should use a treatment and a control group and you should make sure the people in the treatment group actually saw the ad | The advertising effectiveness test requires that you evenly split the audience in a test and control group and the test should use intention to treat (ITT) | The advertising effectiveness test should use a randomized controlled trial (RCT) and assure everyone in the treatment group actually sees the ad | The advertising effectiveness test should use a randomized controlled trial (RCT) design and use intention to treat (ITT)",
      "definition": "The advertising effectiveness test should use a randomized controlled trial (RCT) design and use intention to treat (ITT)"
    },
    {
      "term": "Why should you randomly assign people to the treatment or the control group in an advertising effectiveness test using experimental design? | By randomly assigning people to groups, they will see a random selection of ads which will help control any external variables that might affect results. | Randomly assigning people to the treatment versus the control group will help the advertiser choose who gets to see your ads and who doesn't. | Randomization helps to control for external effects, or variables that are harder to control. By randomly assigning people you try to vary the influence of external factors evenly across groups. | By randomly assigning people to groups, you guarantee that people who are supposed to see an ad actually see the ad.",
      "definition": "Randomization helps to control for external effects, or variables that are harder to control. By randomly assigning people you try to vary the influence of external factors evenly across groups."
    },
    {
      "term": "What does it mean if an experiment uses 'Intention to Treat (ITT)'? | It means that it is your intention to show an ad to people in the treatment group | ITT means that people who are assigned to a treatment group will stay in that treatment group, even if they did not receive the treatment for some unforeseen reason | It means you won't count the results for people in the treatment group who ended up not seeing the ad you had intended for them | ITT means that you randomly assign people to the treatment or the control group",
      "definition": "ITT means that people who are assigned to a treatment group will stay in that treatment group, even if they did not receive the treatment for some unforeseen reason"
    },
    {
      "term": "Imagine you work in the marketing department of a large electronics company. You are planning to set up a new conversion campaign on Facebook focused on generating online sales for computer monitors. Your manager asks you to make sure you can report on the effectiveness of your campaign once the campaign is completed. The first section of the Brand Survey Test focuses on the test details. What are your options for what you can test? (Select all that apply) | You can test the effect of all the campaigns that are running in your account together. | You can test the effect of a group of campaigns. | You can test the effect of a group of campaigns that have not run yet but you plan to run. | You can test a specific campaign.",
      "definition": "You can test the effect of all the campaigns that are running in your account together. | You can test the effect of a group of campaigns. | You can test a specific campaign."
    },
    {
      "term": "How might a Brand Survey Test on the Facebook platform help an advertiser? | It shows you what people think of your ad | It tells you how you could improve your advertising creative to make your campaign more effective | It helps evaluate the incremental lift in conversions resulting from your campaign. | It shows the incremental lift in ad recall caused by a brand awareness focused campaign, thus helping to evaluate the effectiveness of that campaign",
      "definition": "It shows the incremental lift in ad recall caused by a brand awareness focused campaign, thus helping to evaluate the effectiveness of that campaign"
    },
    {
      "term": "Which of the following are elements of an experimental design? | Treatment Group | Control Group | Treatment Variable | Variable Group",
      "definition": "Treatment Group | Control Group | Treatment Variable"
    },
    {
      "term": "You want to run an experiment for your company's advertising campaign. When designing your experiment, you randomly assign people to a control group and a treatment group. Studies that use this type of experiment are referred to as: | Incremental Impact | Brand Survey Test | Randomized Control Trials (RCTs) | Holdout Test",
      "definition": "Randomized Control Trials (RCTs)"
    },
    {
      "term": "What do we mean by 'control group' in an experiment? | The group that will have the biggest effect on your results. | The group for which the advertiser controls the ads they see | The group that could potentially be exposed to the treatment | The group that won't be exposed to the treatment",
      "definition": "The group that won't be exposed to the treatment"
    },
    {
      "term": "The Meta pixel can track conversions made on what platform? | None of the above | Website | Mobile app | Offline shopping (e.g. in a store)",
      "definition": "Website"
    },
    {
      "term": "True or false? When Meta says it uses Intention to Treat (ITT) in advertising effectiveness tests, it means that those who are part of the test (or treatment) group in an experiment will not remain in the group. | True | False",
      "definition": "False"
    },
    {
      "term": "What is the difference between a Holdout Test and a Brand Survey Test on Meta? | A Holdout Test evaluates the effect of your ads on conversion lift whereas a Brand Survey test evaluates the effect of your ads on link clicks | A Holdout Test uses a test and a control group and a Brand Survey test does not | A Brand Survey Test evaluates the effect of your ads by polling people on ad recall, whereas a Holdout Test measures the effect of your ads by asking people whether they bought your product | A Holdout Test measures the effect of your ads on conversions, whereas a Brand Survey Test measures the effect of your ads on ad recall and other brand related metrics measured through the use of a survey",
      "definition": "A Holdout Test measures the effect of your ads on conversions, whereas a Brand Survey Test measures the effect of your ads on ad recall and other brand related metrics measured through the use of a survey"
    },
    {
      "term": "You run the marketing for a high end clothing retailer and recently run a brand survey test for your company's Facebook ad campaigns. Your results consist of which of the following? (Select all of the following) | Brand lift percentage | Cost per brand lift | Brand lift | Confidence level of results",
      "definition": "Brand lift percentage | Brand lift | Confidence level of results | Cost per brand lift"
    },
    {
      "term": "True or false? If the confidence level for your test isn't very high, stop running your test for a bit longer and decrease your advertising budget to see a bigger effect. | True | False",
      "definition": "False"
    },
    {
      "term": "Imagine you run an online art supply store. You are looking to increase awareness of online purchases by 5 percentage points among the target audience within three months. Which test would best measure this goal? | Brand Survey Test | Holdout Test",
      "definition": "Brand Survey Test"
    },
    {
      "term": "True or false? If you want to run an experiment to test your advertising effectiveness, you have to plan it before you create and run your advertising campaign. | True | False",
      "definition": "True"
    },
    {
      "term": "Why is it important to randomly assign people to the control or the treatment group in an experiment? | It is necessary to make sure you have an equal number of people in the control and the treatment group | It helps to minimize the effect of external variables outside of your control on the results | It helps the advertiser control who gets to see their ads | It is helps to make sure that the people you intended to see your ad actually see it",
      "definition": "It helps to minimize the effect of external variables outside of your control on the results"
    },
    {
      "term": "True or false? The 'control group' is the group in the experiment that will be exposed to the treatment. | True | False",
      "definition": "False"
    },
    {
      "term": "Imagine you run an online furniture store and want to see results or actions people took in-store, over-the-phone as part of Ads Manager reports and use this information in experiments like Holdout Tests. Which Meta tool would be most helpful? | Meta Pixel | The Meta SDK | Offline Conversions",
      "definition": "Offline Conversions"
    },
    {
      "term": "True or false: A Holdout Test uses a test and a control group and a Brand Survey test does not. | True | False",
      "definition": "False"
    },
    {
      "term": "Imagine you ran a Brand Survey test for your campaign on Facebook and it is clear from the report that the confidence level for your test is low. In fact, it says in your report: \"the chance that your Facebook ads caused brand lift of 63.2%\". You would like to see a higher confidence level. What could you do? | Change the target audience for your campaign | Run a Holdout Test instead, which will most likely come back with a higher confidence level | Keep running the campaign and increase the test period and the ad budget | Keep running the campaign but reduce the daily budget so you can spread the test of more time.",
      "definition": "Keep running the campaign and increase the test period and the ad budget"
    },
    {
      "term": "Imagine you work in the marketing department of a large electronics company. You are planning to set up a new conversion campaign on Facebook focused on generating online sales for computer monitors. Your manager asks you to make sure you can report on the effectiveness of your campaign once the campaign is completed. How do you make sure you can fulfill her requirements? | By setting up a Holdout Test before the campaign starts running | By setting up a Brand Survey Campaign before the campaign starts running | By running a Holdout Test after the campaign is complete | By running a Brand Survey test after the campaign is complete",
      "definition": "By setting up a Holdout Test before the campaign starts running"
    },
    {
      "term": "True or false? Meta suggests that in order to run a successful test, you should at least spend about $30,000 on advertising in the campaigns you are testing. | True | False",
      "definition": "True"
    },
    {
      "term": "True or false? A well designed experiment requires that people in the test are randomly assigned to the test or the control group. | True | False",
      "definition": "True"
    },
    {
      "term": "Imagine you want to track customer actions taken on your company's app. Which Meta tool would be most helpful? | Meta Pixel | The Meta SDK | Offline Conversions",
      "definition": "The Meta SDK"
    },
    {
      "term": "You run the marketing for a high end clothing retailer and recently ran a holdout test for your company's Facebook ad campaigns. In Meta Ads Manager, you look at your overview and observe how many additional conversions happened as a result of your ad. This is called the: | Cost per brand lift | Conversion Lift | Sales lift | Purchase funnel",
      "definition": "Conversion Lift"
    },
    {
      "term": "What is an acceptable confidence level for your test? | Anything above 75% | Depends on the test | 90% and above | Between 80-85%",
      "definition": "90% and above."
    },
    {
      "term": "In which of the following scenarios would an A/B test be helpful? (Select all that apply) | If you want to optimize the copy (the text) in your ad | If you would like to know which audience group your ad performs best in | If you have two different images you could use in your ads and you want to know which image would generate most results | If you want to know whether your advertising was effective at increasing sales",
      "definition": "If you want to optimize the copy (the text) in your ad | If you would like to know which audience group your ad performs best in | If you have two different images you could use in your ads and you want to know which image would generate most results"
    },
    {
      "term": "The results of an A/B test on the Facebook platform include which of the following 2 elements? | The increase in brand awareness as a result of seeing your ad and the confidence level for the test | The number of results from version A and version B of the ad and the portion of the budget that was spent on each ad | The winner of the test (version A or version B) and the confidence level for the test | The incremental lift of your ad compared to the control group and the winner of the test",
      "definition": "The winner of the test (version A or version B) and the confidence level for the test"
    },
    {
      "term": "Which of the following is true when setting up an A/B test in Facebook? | There are two control groups | The test group receives a treatment and the control group does not | Facebook duplicates your ads and changes several variables | There is no control group",
      "definition": "There is no control group"
    },
    {
      "term": "What does the confidence level of an A/B test tell you? | It tells you what the chance is of getting the same winner if you ran this test again. | It tells you how confident you can be that people were randomly assigned to the A and the B group | It tells you how confident you can be that your advertising was effective. | It tells you how likely it is that you can further improve your ad .",
      "definition": "It tells you what the chance is of getting the same winner if you ran this test again."
    },
    {
      "term": "Imagine you work in the marketing department of a large clothing retailer. You want to run a marketing mix modeling study. Which of the following statements regarding the benefits of conducting this study are true? (Select all that apply) | It can help you analyze last year's data to understand what worked. | It can predict what will work in the future for your company. | Is solely used to determine on which platform your advertisement performed best. | It can help plan how to best spend your money next year to improve results.",
      "definition": "It can help you analyze last year's data to understand what worked. | It can predict what will work in the future for your company. | It can help plan how to best spend your money next year to improve results."
    },
    {
      "term": "True or false? When you are only testing two variations of one variable, you use an A/B test to determine which version will produce the best results. | True | False",
      "definition": "True"
    },
    {
      "term": "Which of the following is correct about a last click attribution model? | It gives credit to the ads in the conversion path based on a statistical attribution model | It evenly spreads the credit for a conversion across all the ads a consumer clicked on before finally converting | It gives all the credit for a conversion to the last ad a user clicked on before converting | It gives credit to the last ad a user saw or clicked on before converting",
      "definition": "It gives all the credit for a conversion to the last ad a user clicked on before converting"
    },
    {
      "term": "In A/B testing in advertising, it's best practice to only change one variable at a time between the version A and B of your ad. Why is that? | When you only vary one variable and leave all other aspects of the different versions of the ad identical, then you will know exactly which variable was responsible for the difference in results | When you test only one variable at a time your chances of finding a winner are higher | It is easier to change only one variable at a time as it will reduce the time it takes to test | When you test only one variable at a time, the confidence level for your test will be higher",
      "definition": "When you only vary one variable and leave all other aspects of the different versions of the ad identical, then you will know exactly which variable was responsible for the difference in results"
    },
    {
      "term": "True or false? Statistical models are not as robust as rule based models and less accurately reflect reality. | False | True",
      "definition": "False"
    },
    {
      "term": "You are working on a campaign with the objective to drive app downloads. You have created an audience on Facebook for your campaign. But, you also have a list of emails from people who have downloaded an app from you before, and you plan to create a custom audience using that list. Now, you would like to know which audience will be most likely to download your app. The new audience you created, or the custom audience of people who downloaded one of your apps before. Which study could help you? | You can run a Marketing Mix Modeling study | You can run a Brand Survey Test | You can run an A/B test | You can use an Attribution Modeling study",
      "definition": "You can run an A/B test"
    },
    {
      "term": "True or false? A/B tests help you optimize using a test and control group, whereas attribution modeling studies don't. | False | True",
      "definition": "False"
    },
    {
      "term": "True or false? Historically, advertisers have relied on cookies to connect a sequence of touchpoints to a person. | False | True",
      "definition": "True"
    },
    {
      "term": "True or false? You would run a marketing mix modeling study to show how your advertising on different platforms contributed to company sales. | False | True",
      "definition": "True"
    },
    {
      "term": "Imagine you are planning a campaign for scented candles on Instagram. You have several images of the candles you want to promote, but you are not sure which image will work best. After a meeting with your team, you narrowed the choices down to two different images. One is an image of three candles on a dresser, the other one is an image of one candle only. You have already decided which copy will accompany the image. What should you do to help you decide on the right image to use? | Conduct a Holdout Test in which you check the effect of each of the images. | Conduct an A/B test in which you test a version A with the image of the three candles with a text that talks about the promotion and version B with the image of the single candle and copy that talks about the new scent of this candle | Use an attribution modelling study to evaluate which images have worked best in the past | Conduct an A/B test as part of the Instagram campaign in which you create two ads that are identical except for the image.",
      "definition": "Conduct an A/B test as part of the Instagram campaign in which you create two ads that are identical except for the image."
    },
    {
      "term": "Which of the following is correct about a positional model? | It evenly spreads the credit for a conversion across all the ads a consumer clicked on before finally converting. | It gives credit to the last ad a user saw or clicked on before converting. | It gives more credit to first and last touch points whether they are clicks or impressions, while the credit for the remaining touchpoints in the middle is divided equally. | It gives credit to the ads in the conversion path based on a statistical attribution model",
      "definition": "It gives more credit to first and last touch points whether they are clicks or impressions, while the credit for the remaining touchpoints in the middle is divided equally."
    },
    {
      "term": "True or false? Attribution is mostly used to evaluate the impact of online media channels on a purchase. | True | False",
      "definition": "True"
    },
    {
      "term": "Why may advertisers want to use attribution modeling studies? | Attribution modeling can help advertisers understand how much influence their ads on different platforms had on their result | Attribution modeling helps advertisers adjust their bid for the Facebook auction | Attribution studies help to test different variable of an ad and understand which variables work best and drive the best results | Attribution modeling can help advertisers understand the effect of their ads on ad recall",
      "definition": "Attribution modeling can help advertisers understand how much influence their ads on different platforms had on their result"
    },
    {
      "term": "True or false? When we want to track advertising effectiveness across the whole customer journey, we do not need to be able to monitor behavior on the different platforms. | True | False",
      "definition": "False"
    },
    {
      "term": "Which of the following is NOT a component of the attribution method? | Marketing channels | The input data | The output | A model",
      "definition": "Marketing channels"
    },
    {
      "term": "Which of the following describes some of the most common challenges we face when measuring advertising effectiveness? | It is often challenging to create a test with enough power or a high enough confidence interval | It's not always easy to connect data from different platforms and devices. Also, connecting all the advertising touchpoints to one individual user can be challenging | It can be challenging to randomly assign people to a control or an experimental group | It is hard to connect data from people who log in to Facebook on both their mobile device and on the web",
      "definition": "It's not always easy to connect data from different platforms and devices. Also, connecting all the advertising touchpoints to one individual user can be challenging"
    },
    {
      "term": "True or false? In statistical or math models you let the data speak and you don't decide on a model ahead of time. | True | False",
      "definition": "True"
    },
    {
      "term": "Both A/B tests and Attribution Modeling studies help you to optimize your advertising, but how do they differ? | A/B tests help you to optimize within a campaign, whereas attribution modeling studies help you to optimize your budget across campaigns across platforms | A/B tests help you optimize using a test and control group, whereas attribution modeling studies don't. | A/B tests help you to optimize within a campaign, whereas attribution modeling studies help you optimize the creative for your TV campaign as well as your online campaigns | A/B tests help you optimize the image you use in your ads, whereas attribution modeling studies help you optimize all other aspects of your ad.",
      "definition": "A/B tests help you to optimize within a campaign, whereas attribution modeling studies help you to optimize your budget across campaigns across platforms"
    },
    {
      "term": "What's the goal of presenting your campaign results? | To show what actions you took to achieve your goals | To show what insights you found in the campaign data | To show how you'll iterate on campaigns in the future | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "What should your presentation begin with? | Results | Data | Goals | Campaign actions",
      "definition": "Goals"
    },
    {
      "term": "Why would you state your objectives? | To show how you'll put your goals into action | To bridge the narrative of your presentation from goals to campaign | To explain your audience your strategy | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "Why is it good to state your KPIs before talking about creating your campaign? | Since KPIs are tied to goals and objectives, it shows you're thinking through every step of your campaign | Since KPIs are the first thing you consider, you determine your KPIs before your goals and objectives | Since KPIs are tied to goals and objectives, you measure them before setting up your campaign | There's no reason - you can talk about KPIs anywhere",
      "definition": "Since KPIs are tied to goals and objectives, it shows you're thinking through every step of your campaign"
    },
    {
      "term": "How much information should you give about your campaign? | An overview of how you set up your campaign, including intentions, audience, placements, duration, and budget | Take your audience through each detail of how you set up your campaign, step-by-step | You don't need to tell your audience anything about your campaign, since you already know about it | Only tell your audience about your campaign budget",
      "definition": "An overview of how you set up your campaign, including intentions, audience, placements, duration, and budget"
    },
    {
      "term": "What data points might you include when talking about awareness campaign results? | Purchases, add to cart, and payment info | Ad recall, reach, and impressions | Link clicks, engagement, and landing page views | Likes, shares, and comments",
      "definition": "Ad recall, reach, and impressions"
    },
    {
      "term": "What data points might you include when talking about consideration campaign results? | Link clicks, engagement, and landing page views | Purchases, add to cart, and payment info | Ad recall, reach, and impressions | Online store traffic, and lead generation",
      "definition": "Link clicks, engagement, and landing page views"
    },
    {
      "term": "What data points might you include when talking about conversion campaign results? | Likes, shares, and comments | Link clicks, engagement, and landing page views | Ad recall, reach, and impressions | Purchases, add to cart, and payment info",
      "definition": "Purchases, add to cart, and payment info"
    },
    {
      "term": "What would you do when asked about causal relationships? | Point to the results of your experiments | Explain how A/B testing showed you that your campaign did get results | Explain how attribution studies show the path of customer behavior, and the path from campaign to result | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "Why would you include plans for future campaigns in your presentation? | To show that you've drawn conclusions from your data that can be used to iterate | To show that you're proactively thinking ahead to the next campaign | To demonstrate tangible ways to improve results in the future | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "What data might you include when presenting on consideration KPIs? | Charts and graphs on reach and impressions | Charts and graphs on lead gen sign-ups and purchases | Charts and graphs on traffic and engagement | Charts and graphs on bidding strategy and auctions",
      "definition": "Charts and graphs on traffic and engagement"
    },
    {
      "term": "What might be a good tactic when thinking about opening and closing your presentation? | Skip the opening and closing - they're not needed | Connect the opening and closing with a story, a question, or an interesting fact | Look at them as separate, unrelated parts of your presentation | Open and close by stating your results",
      "definition": "Connect the opening and closing with a story, a question, or an interesting fact"
    },
    {
      "term": "What are some slides you'd want to include in your slide deck? | All the data results you could find | The details of how Facebook conducts their bidding and auctions | How you brainstormed your creative | Your campaign and its results",
      "definition": "Your campaign and its results"
    },
    {
      "term": "What is a best practice to keep in mind when presenting data visually? | You don't need to highlight data points with color | Only use grayscale | Make sure your colors are deliberate, brand colors, or gradients of one color | Use as many different colors as you can",
      "definition": "Make sure your colors are deliberate, brand colors, or gradients of one color"
    },
    {
      "term": "You're anticipating audience questions, especially one asking who the advertising went to, and where. You'd then include a slide addressing what? | How you set up your campaign | ROAS, ROI, and CAC | Your campaign objectives | Causal relationships",
      "definition": "How you set up your campaign"
    },
    {
      "term": "How should you be thinking about your slide deck during a presentation? | Make sure it has branded colors and fonts | Make sure it presents data clearly and visually | Make sure it just lists bullet points | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "When creating a presentation, what should you focus on last? | Ways you'll iterate future campaigns | How you set your campaign up | Demonstrating causal relationships | The data results of your campaign",
      "definition": "Ways you'll iterate future campaigns"
    },
    {
      "term": "You want to talk about an experiment you ran that showed the difference between two audiences being marketed to. Which of the following would you talk about? | Holdout study | A/B Testing | Attribution study | Lift study",
      "definition": "A/B Testing"
    },
    {
      "term": "It's the day of your presentation, and you are NOT confusing your audience. Why? | You spent time thinking about how to communicate your information clearly to them | You're talking slowly and leaving pauses so they can follow you | You created clear, uncluttered slides | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "If you were presenting your data results, and wanted to talk about your revenue as a ratio to what you spent, what number would you include? | LTV | ROI | CAC | ROAS",
      "definition": "ROAS"
    },
    {
      "term": "Have you verified that the email for your Meta Blueprint account matches the email for your Coursera account? | Yes! | No",
      "definition": "Yes!"
    },
    {
      "term": "Which of the following activities are at the core of marketing? Select all that apply. | Getting these messages in front of the right people | Setting an ad budget | Evaluating and optimizing the impact of your message | Understanding and studying the audience or customers for a product",
      "definition": "Getting these messages in front of the right people | Evaluating and optimizing the impact of your message | Understanding and studying the audience or customers for a product"
    },
    {
      "term": "True or false: In 2014, Meta acquired the photo-sharing platform Instagram. | False | True",
      "definition": "False"
    },
    {
      "term": "True or false: Businesses and non-profit organizations can participate in Social Media Marketing. | False | True",
      "definition": "True"
    },
    {
      "term": "True or False: Meta Business Suite Insights is a paid, integrated target audience research and tracking tool for managing large accounts. | True | False",
      "definition": "False"
    },
    {
      "term": "Laura owns a bridal shop and is looking to connect with her business contacts and gather information about her B2B audience. The social media research tool she should use is: | Google Analytics | LinkedIn Audience Insights | Twitter Business Analytics | Meta Business Suite Insights",
      "definition": "LinkedIn Audience Insights"
    },
    {
      "term": "True or False: A secondary target audience can help you structure your marketing efforts if you sell more than one product or service, or if you feel your products or services may appeal to distinctly different groups of people. | True | False",
      "definition": "True"
    },
    {
      "term": "When outlining your target audience, you should consider all of the following except: | Key demographic data that describes your target audience | Your target audience's needs | Your target audience's interests | Your target audience's eating habits",
      "definition": "Your target audience's eating habits"
    },
    {
      "term": "(Questions 1-3 pertain to the video lecture \"Exploring the Relational Data Model of CSV\") What is the approximate population of La Paz county in the state of Arizona for the CENSUS2010POP (column H)? (Choose the best answer.) | 20000 | 10000 | 15000 | 25000",
      "definition": "20000"
    },
    {
      "term": "What county in the state of Wyoming has the smallest estimated population? | Niobrara | Uinta | Sweetwater | Platte",
      "definition": "Niobrara"
    },
    {
      "term": "At 2:45 of the video, the Instructor creates a filter for all of the counties in California with a population greater than 1,000,000. However, included in the results is the entire state of California. This anomalous value might skew our analysis if, for example, we wanted to compute the average population of these results. What additional filter might work to resolve this problem? | Add a filter to detect and remove results which do not include the word \"County\" in column G. | Add a filter which finds all counties with population greater than 100,000 AND less than 10,000,000 for column H (CENSUS2010POP). | Add a filter where the value in column E is greater than 1,000,000. | None of the above",
      "definition": "Add a filter to detect and remove results which do not include the word \"County\" in column G."
    },
    {
      "term": "(Questions 4 and 5 pertain to the video \"Exploring Sensor Data\")How often (in seconds) do the R5 measurements occur? | 40 | 50 | 30 | 60",
      "definition": "60"
    },
    {
      "term": "What is the field for rain accumulation? | Dn | Sm | Rc | Dx",
      "definition": "Rc"
    },
    {
      "term": "(Questions 6 and 7 pertain to the video lecture \"Exploring the Array Data Model of an Image\")What is the (Red, Green, Blue) pixel value for location 500, 2000? | (50, 156, 182) | (134, 145, 46) | (100, 123, 149) | (163, 118, 79)",
      "definition": "(163, 118, 79)"
    },
    {
      "term": "Is this value likely to be land or ocean? | Land | Ocean",
      "definition": "Land"
    },
    {
      "term": "(Questions 8 and 9 pertain to the video lecture \"Exploring the Semistructured Data Model of JSON\")Given a tweet, what path would you most likely enter to obtain a count of the number of followers for a user? | user/followers_count | user/statuses_count | user/listed_count | None of the above",
      "definition": "user/followers_count"
    },
    {
      "term": "Which of the following fields are nested within the 'entities' field (select all that apply)? | tweets | symbols | user_mentions | views | events | urls",
      "definition": "symbols | user_mentions | urls"
    },
    {
      "term": "What is a possible pitfall of utilizing Excel as a way to manipulate small databases? | Excel is a user program and thus cannot run on a server. | Excel does not allow algorithms for data manipulation. | Excel does not enforce many principles of relational data models.",
      "definition": "Excel does not enforce many principles of relational data models."
    },
    {
      "term": "What does the term \"atomic\" mean in the context of relational databases? | Fixed schema of a particular database. | A tuple that cannot be reduced. | A column or row of data. Depends on the context. | One unit of information that cannot be decomposed.",
      "definition": "One unit of information that cannot be decomposed."
    },
    {
      "term": "What is the Pareto-Optimality problem? | Find the shortest path from source node to target node. | Find the optimal path that requires going through specific nodes given by the user. | Find the best possible path given two or more optimization criteria where neither constraint can be fully optimized simultaneously.",
      "definition": "Find the best possible path given two or more optimization criteria where neither constraint can be fully optimized simultaneously."
    },
    {
      "term": "What constitutes a community within a graph? | High density of nodes at a certain location. | A neighborhood defined by an integer constant K around a specific node. All K+1 nodes belong in another community. | A dense amount of edge connections between nodes in a community and a few connections across communities. | Many anomalous neighborhoods within the same vicinity.",
      "definition": "A dense amount of edge connections between nodes in a community and a few connections across communities."
    },
    {
      "term": "Why are trees useful for semi-structured data such as XML and JSON? | It is not always the case that XML and JSON can be represented as trees. | They are only useful for XML data as tree-like structure is apparent with tags. While JSON does not contain a tree-like structure as it contains arrays. | Computers can easily visualize the data with a tree structure. | Trees take advantage of the parent-child relationship of the data for easy navigation.",
      "definition": "Trees take advantage of the parent-child relationship of the data for easy navigation."
    },
    {
      "term": "What is the general purpose of modeling data as vectors? | Enables weighting of the query. | Results can be ordered by similarity using vector projection. | The ability to normalize vectors allowing probability distributions. | Enables image searching.",
      "definition": "Results can be ordered by similarity using vector projection."
    },
    {
      "term": "For the following questions 7, 8, and 9, suppose a registration website creates data with the following fields for each person registered (note: if the user does not input a value, NULL is stored instead): Name, Date, Address, and Account Number. Suppose we collect data month by month. Each month, we would have a batch of data containing the fields listed above. At the end of the year, we want to summarize our registrant activities for the entire year, so we would remove redundancies in our data by removing any records with duplicate account numbers from month to month. What type of operation do we use in this scenario? | Union | Not an Operation | Join | Subsetting",
      "definition": "Union"
    },
    {
      "term": "From the information given in question 7, what are the constraints, if any, which we have placed on the Account Number field for the end of year collection? | Account Number should be unique. | If we had n duplicate Account Numbers then we will remove n-1 duplicate fields. | There are no constraints. | Account should have at most n digits.",
      "definition": "Account Number should be unique."
    },
    {
      "term": "Suppose 100 people signup for our system and of the 100 people, 60 of them did not input an address. The system lists the values as NULL for these empty entries in the address field. Would this situation still have structure for our data? | No because the majority of data do not have a specific field filled, thus our originally defined structure is lost. | Yes the data has structure because we have placed a structural constraint on the data, thus the data will always have the originally defined structure.",
      "definition": "Yes the data has structure because we have placed a structural constraint on the data, thus the data will always have the originally defined structure."
    },
    {
      "term": "What is true between data modeling and the formatting of the data? | The data does not necessarily need to be formatted in a way that represents the data model. Just so long as it can be extrapolated. | There is always one specific schema for storing model data that is the best and preferred method for the specific data representation. | There is a one to one correspondence between formatting data and data modeling. For every model of data, there is only one way to store the data.",
      "definition": "The data does not necessarily need to be formatted in a way that represents the data model. Just so long as it can be extrapolated."
    },
    {
      "term": "What is streaming? | Utilizing real time data to compute and change the state of an application continuously. | Using sensors to manipulate the system, such as a smart car being able to drive by itself using sensors to detect road hazards. | Using static data stored from a real time source in order to process and guide the application. | Calculating results using real time data otherwise known as streaming data.",
      "definition": "Utilizing real time data to compute and change the state of an application continuously."
    },
    {
      "term": "Of the following, what best describes the properties of working with streaming data? | Data manipulation is near real time. | Independent computations that do not rely on previous or future data. | Small time windows for working with data. | Always unbounded in sequence, in other words, data is not guaranteed to be in order. | Does not ping the source interactively for a response upon receiving the data. | Data is always utilized for streaming the application.",
      "definition": "Data manipulation is near real time. | Small time windows for working with data."
    },
    {
      "term": "What is a characteristic of streaming data? | The data is finite and requires only finite time and space to process the data. | Data is unbounded in size but requires only finite time and space to process it. | Data is finite in size and size determines the time and space of processing the data. | The data is unbounded in size and the size determines the time and space of processing the data.",
      "definition": "Data is unbounded in size but requires only finite time and space to process it."
    },
    {
      "term": "What type of algorithm is required for analyzing streaming data? | Accurate and Memory Efficient | Fast and Complex | Accurate and Consistent | Fast and Simple",
      "definition": "Fast and Simple"
    },
    {
      "term": "What is lambda architecture? | A method to process streaming data by utilizing batch processing and real time processing. | A specific hardware architecture for a server made specifically for processing real time data. | A specific method for processing streaming data using special real time processes.",
      "definition": "A method to process streaming data by utilizing batch processing and real time processing."
    },
    {
      "term": "Of the following, which best represents the challenge regarding the size and frequency of data? | The size and frequency of the streaming data may be too small. | There may not be data to produce the notion of size and frequency. | The size and frequency of the streaming data may be sporadic.",
      "definition": "The size and frequency of the streaming data may be sporadic."
    },
    {
      "term": "What is the difference between data lakes and data warehouses? | Data lakes house raw data while data warehouses contain pre-formatted data. | Data lakes utilize hierarchical systems while data warehouses use object storage. | Data lakes contain only files while data warehouses contain only databases.",
      "definition": "Data lakes house raw data while data warehouses contain pre-formatted data."
    },
    {
      "term": "What is schema-on-read? | The process where data is pre-formatted prior to being read but the schema is loaded on read. | Another name for data lakes. | Data is stored as raw data until it is read by an application where the application assigns structure. | The process where formatted data is given structure when read.",
      "definition": "Data is stored as raw data until it is read by an application where the application assigns structure."
    }
  ]
}
