{
  "quizSrc": [
    {
      "term": "Although theories of motivation show that external (financial) rewards are less useful as a motivating factor, the instructor has highlighted financial rewards to be important in which of the following situations?A. When self-efficacy is low and task complexity is highB. When supervisory relationships are poorC. When making equity or fairness comparisons with other colleaguesD. When goals are too challenging.",
      "definition": "C. When making equity or fairness comparisons with other colleagues"
    },
    {
      "term": "What is true about team norm?A. Team norm is an important aspect of a well-functioning teamB. Norms can have a big impact on the team's work, although they have nothing to do with behaviorsC. All norms positively affect employee performanceD. Leaders, not employees, involve in developing norms",
      "definition": "A. Team norm is an important aspect of a well-functioning team"
    },
    {
      "term": "The bureaucratic cultural form could be defined asA. A leadership belief in strong, mutually reinforcing exchanges and linkages between employees and departmentsB. A leadership mind-set that values order, stability, status, and efficiency.C. A leadership belief in active monitoring of the external environment for emerging opportunities and threats and adapting to them.D. A leadership mind-set that encourages and values a highly competitive work environment.",
      "definition": "B. A leadership mind-set that values order, stability, status, and efficiency."
    },
    {
      "term": "White males are often seen as better leaders, and they are judged as more successful than their black or female counterparts for very similar performance. Older workers are generally perceived as less likely to adapt to change, while younger workers are often assumed as demanding, cynical, and lacking commitment. What is the issue underlying these cases?A. DiversityB. StereotypingC. Social categorisationD. Mental Modelling",
      "definition": "B. Stereotyping"
    },
    {
      "term": "According to Professor Robert Simons, what are the four types of control systems?A. The Balanced Scorecard, Boundary systems, Belief systems, and Information systemsB. Tracking measures from four perspectives: shareholders, customers, internal, and innovation and learningC. Enacted values, Organisational structure, Diagnostics systems, and Interactive systemsD. Belief, Boundary, Diagnostics, and Interactive systems",
      "definition": "D. Belief, Boundary, Diagnostics, and Interactive systems"
    },
    {
      "term": "Which of the following is one of the workforce segments according to Professors Lepak &amp; Snell's workforce segmentation model?A. SpecialistsB. CriticalsC. ProfessionalsD. DoersE. All of these",
      "definition": "E. All of these"
    },
    {
      "term": "The following explanations talk about different Leadership models. Which of them is about Fiedler's Contingency Leadership model?A. It has 4 styles (directive, supportive, participative, achievement-orientated) determined by 6 variables (Authoritarianism, Locus of Control, Ability, Task Structure, Formal Authority, Work Group)B. It has 4 styles (directing, coaching, supporting, delegating) determined by 4 variables (development level or degree of maturity)C. It has 2 styles (task or relationship-oriented) determined by 3 variables (leader-member relationship, task structure, and position power)D. It has 7 styles (from autocratic to participative) determined by 3 variables (boss, subordinate and situation)",
      "definition": "C. It has 2 styles (task or relationship-oriented) determined by 3 variables (leader-member relationship, task structure, and position power)"
    },
    {
      "term": "Which method of identifying key capabilities involves going through the key value adding activities in your organization in a detailed, systematic way?A. Checklist methodB. Conceptual frameworkC. Business senseD. All of these",
      "definition": "A. Checklist method"
    },
    {
      "term": "What makes it difficult to change culture?A. It is expensiveB. People in the organisation may be emotionally attached to the cultureC. It involves changing strategies as wellD. All are correct",
      "definition": "D. All are correct"
    },
    {
      "term": "Which type of leadership skill captures the ability to conceptualize a situation, look at various strategies and alternatives, and decide in directions that the organization needs to travel?A. technical skillsB. interpersonal skillsC. conceptual skillsD. All of these are correct",
      "definition": "C. conceptual skills"
    },
    {
      "term": "According to Tuckman's model of team process, which stage in the process involves members with different perspectives emerging and jostling for authority?A. FormingB. StormingC. NormingD. Performing",
      "definition": "C. Norming"
    },
    {
      "term": "Which statement is true about personality at work?A. Different personality traits are suited to different types of workB. Each one of us has a personality profile that reflects whether we are more or less conscientious, agreeable, neurotic, open to experience, and extrovertedC. Open people are more creative and can be good leadersD. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "What is the main purpose of the MARS model?2 answers:A. To identify different personalty dimensions and related behavioursB. To identify how the expectations of others affect work related behaviourC. To understand the sources and factors behind individual behaviourD. To analyse the fit between personality dimensions and job requirements",
      "definition": "B. To identify how the expectations of others affect work related behaviour  C. To understand the sources and factors behind individual behaviour"
    },
    {
      "term": "Which approach to conflict involves giving in completely to the other party with little or no attention to one's own interests?A. ForcingB. CollaboratingC. AvoidingD. Yielding",
      "definition": "D. Yielding"
    },
    {
      "term": "Which of the three basic risk types associated with strategy execution can be a problem when your strategy needs to change?A. Trade-off risksB. Flexibility risksC. Implementation risksD. None of the above",
      "definition": "B. Flexibility risks"
    },
    {
      "term": "Which component of expectancy theory captures the likelihood that you will actually get your reward if you perform?A. ValanceB. ExpectancyC. InstrumentalityD. None of these",
      "definition": "C. Instrumentality"
    },
    {
      "term": "Which of the following is NOT one of the dimensions of an effective team?A. Psychological safetyB. DependabilityC. ConflictD. Structure and clarity",
      "definition": "C. Conflict"
    },
    {
      "term": "What is NOT true about organisational culture?A. It could be summarized as the way people do things in an organizationB. It includes the values, norms, beliefs, and behaviors that people take for grantedC. People who live and breathe a particular organizational culture can easily identify itD. Culture can be very difficult to identify",
      "definition": "C. People who live and breathe a particular organizational culture can easily identify it"
    },
    {
      "term": "In order to increase the likelihood of job satisfaction, values should ideally fit with which of the following?Choose two answersA. Organisational cultureB. Whether you and your boss both like to play footballC. Ability to get to work on timeD. Job characteristics",
      "definition": "A. Organisational culture  D. Job characteristics"
    },
    {
      "term": "Which dimension among the six cultural dimensions in Hofstede model indicates the level of tolerance for ambiguity?A. power distanceB. individualism versus collectivismC. uncertainty avoidanceD. Long versus Short Term Orientation",
      "definition": "C. uncertainty avoidance"
    },
    {
      "term": "What is the main risk of linking KPIs to incentives?A. Your KPIs may not be linked to your business strategyB. Your KPIs may be inaccurateC. Your incentives may be ineffectiveD. People may manipulate the KPIs as an unintended consequence",
      "definition": "D. People may manipulate the KPIs as an unintended consequence"
    },
    {
      "term": "What is the best way for identifying key capabilities?A. Using your business senseB. Using Michael Porter's conceptual frameworkC. The checklist methodD. Triangulation of all of the above",
      "definition": "D. Triangulation of all of the above"
    },
    {
      "term": "Which dimension of personality reflects how anxious, depressed, and hostile versus calm we are?A. OpennessB. ConscientiousnessC. AgreeablenessD. Neuroticism",
      "definition": "D. Neuroticism"
    },
    {
      "term": "Michael is an experienced pilot in the Air Force. He was asked to fly a fighter jet towards a dangerous situation by his leader and he agreed to take on the mission. Often meaninglessness can happen at work when you put people at risk of physical or emotional harm. Why is Michael's situation not an example of meaninglessness at work?A. He may expect to receive a reward after successfully accomplishing the missionB. His decision to take the mission was an informed choice based on the understanding of all the risks associated with being a pilot in the Air ForceC. He is an experienced pilot and confident that he won't get hurt while he is on her missionD. He just doesn't think that this is unfair treatment by his leader and therefore thinks his work is meaningful",
      "definition": "B. His decision to take the mission was an informed choice based on the understanding of all the risks associated with being a pilot in the Air Force"
    },
    {
      "term": "Which of the following is NOT true about emotional intelligence?A. Emotional intelligence consists of four building blocks, namely self-awareness, self-management, social awareness, and relationship managementB. Emotional intelligence can have important benefits at workC. It is impossible to improve a person's emotional intelligenceD. Emotional intelligence should be considered at recruitment time, particularly for positions involving high emotional labor.",
      "definition": "C. It is impossible to improve a person's emotional intelligence"
    },
    {
      "term": "Which of the following statements is NOT true about values?A. Values are our basic enduring convictions about preferred ways of doing things, or preferred outcomes.B. Values are less stable than personality over timeC. Values are relatively stable.D. Values change between generations",
      "definition": "B. Values are less stable than personality over time"
    },
    {
      "term": "Which of the following personal traits could be NOT suitable for an expatriate in an overseas assignment?A. being nonjudgmentalB. having a learning orientationC. thinking flexibleD. being conservative",
      "definition": "D. being conservative"
    },
    {
      "term": "Which of the following statements is true?A. Trade-off risks can generally be mitigated by finding ways to preserve some of the benefits of the option that you are moving away fromB. Implementation risks can generally be mitigated by developing an effective change management approachC. Flexibility risks can generally be mitigated by building some flexibility into the organisation through encouraging a change-ready mindset throughoutD. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "The job of a coordinator is an example ofA. Relationship-related roleB. Task-related roleC. Both are correctD. Both are incorrect",
      "definition": "A. Relationship-related role     C. Both are correct  B. Task-related role"
    },
    {
      "term": "The following is the key problems that have emerged around HRM EXCEPT:A. The general empowerment focus in HRM that is based on McGregor's theory Y tends to be North American-centricB. HRM has generally failed to secure a seat at the top management tableC. The rhetorical promise of HRM tends to be quite different from the actual reality of HRMD. A universal HRM approach that focuses on maximising the development potential of every employee can become disconnected from business strategy",
      "definition": "B. HRM has generally failed to secure a seat at the top management table"
    },
    {
      "term": "According to which theory do leaders believe that employees want to have an intimate and environment with others they work with?A. Theory XB. Theory YC. Theory ZD. Pygmalion effect theory",
      "definition": "C. Theory Z"
    },
    {
      "term": "What is NOT one of diversity's benefitsA. Diversity increases job satisfaction and staff retentionB. Diverse thinking increases innovationC. Diversity may cause discrimination, which in turn negatively affects job attitudes, physical health outcomes, psychological health and work related outcomesD. A diverse workforce may gives access to more diversified clients",
      "definition": "C. Diversity may cause discrimination, which in turn negatively affects job attitudes, physical health outcomes, psychological health and work related outcomes"
    },
    {
      "term": "Which of the following types of values are generally regarded by employees as really repre organization's leaders?A. Espoused valuesB. Shared valuesC. Aspirational valuesD. Attributed values",
      "definition": "B. Shared values"
    },
    {
      "term": "When you want to structure a cost-conscious organisation, which of the following is the most logical structure to use?A. Matrix by specialisation and customer segmentB. Divisional by customer segmentC. Network with flexible organic reporting linesD. Functional by specialisation",
      "definition": "D. Functional by specialisation"
    },
    {
      "term": "According to Stanford Professor Pfeffer, the following HR practices can boost employee performance?A. Offer employees sufficient employment security, so that they offer their ideas, hard work, and commitment in returnB. Empower employees, such as encouraging teamwork through self managed teamsC. Adopt a more open less-hierarchical management styleD. All of these",
      "definition": "D. All of these"
    },
    {
      "term": "One of the most widely accepted models of personality at work is the Big 5 model. What are the five personality dimensions included in this model?A. Openness, Conscientiousness, Extroversion, Introversion, NeuroticismB. Openness, Conscientiousness, Extroversion, Agreeableness, NeuroticismC. Openness, Conscientiousness, Undependability, Agreeableness, NeuroticismD. None is correct",
      "definition": "B. Openness, Conscientiousness, Extroversion, Agreeableness, Neuroticism"
    },
    {
      "term": "According to Fred Luthans, which of these behaviours would successful managers excel at? Choose three answersA. Learning the written and unwritten rules of the organisational culture and where the power actually liesB. Developing good working relationships with people in positional powerC. Inspiring loyalty, hard work and enthusiasm in those they leadD. Building political coalitions",
      "definition": "A. Learning the written and unwritten rules of the organisational culture and where the power actually lies  B. Developing good working relationships with people in positional power  C. Inspiring loyalty, hard work and enthusiasm in those they lead"
    },
    {
      "term": "Among different types of value, which one is explicitly advocated by leaders?A. Espoused valuesB. Liberal valuesC. Military valuesD. Monetary values",
      "definition": "A. Espoused values"
    },
    {
      "term": "What are the two dimensions used in the workforce segmentation model to segment employees into four quadrants?A. Employee capability and firm resourceB. Firm resource and Skill uniquenessC. Skill uniqueness and Strategic centralityD. Firm resource and Strategic centrality",
      "definition": "C. Skill uniqueness and Strategic centrality"
    },
    {
      "term": "_________________captures the extent to which the team is committed to goals that align with the organization, while_________________ exists when there are strong team norms related to the minimization of conflictA. Cohesiveness, conformityB. Conformity, cohesivenessC. Cohesiveness, groupthinkD. Conformity, groupthink",
      "definition": "A. Cohesiveness, conformity"
    },
    {
      "term": "Among the four main elements of an organization, which one can be thought of as the equivalent of the bloodstream in human body?A. Organization structureB. PeopleC. Organizational cultureD. Organizational system",
      "definition": "B. People"
    },
    {
      "term": "If the Pygmalion Effect is accurate, which leadership attitude becomes problematic? Check only one option A. Self-efficacy as people will stop believing in their capacity to do the tasksB. Theory Z as people will become too attached to their teammates to focus on workC. Theory Y as they will become so content at being treated well they'll lose the motivation to work hardD. Theory X, as treating people like they are lazy and dislike work will result in them becoming lazy, disliking work and performing less effectively",
      "definition": "D. Theory X, as treating people like they are lazy and dislike work will result in them becoming lazy, disliking work and performing less effectively"
    },
    {
      "term": "Which dimension of personality reflects how imaginative, curious, flexible and sensitive we are?A. OpennessB. ConscientiousnessC. AgreeablenessD. Neuroticism",
      "definition": "A. Openness"
    },
    {
      "term": "The specific configuration of the four elements of the organization is often referred to asA. Organization designB. Organization structureC. Organizational cultureD. Organizational system",
      "definition": "A. Organization design"
    },
    {
      "term": "Which approach to conflict involves finding a solution that is beneficial for both parties?A. ForcingB. CollaboratingC. AvoidingD. Yielding",
      "definition": "B. Collaborating"
    },
    {
      "term": "Which type of diversity involves such factors as nationality, age, and gender and job related by profession or occupation?A. Categorical diversityB. Experiential diversityC. Cognitive diversityD. Thought diversity",
      "definition": "A. Categorical diversity"
    },
    {
      "term": "Values like affordability, customer service, quality and innovation belong to which level of breA. extended valuesB. emotional valuesC. higher-purpose valuesD. core values",
      "definition": "D. core values"
    },
    {
      "term": "What type of power involves the power to punishing people and withholding rewards to ensure compliance to the organizational norms?A. Reward powerB. Legitimate powerC. Coercive powerD. Referent power",
      "definition": "C. Coercive power"
    },
    {
      "term": "In a balance scorecard, what is the factor that actually drive current and future results?A. lag indicatorsB. lead indicatorsC. left indicatorsD. late indicators",
      "definition": "B. lead indicators"
    },
    {
      "term": "What type of power involves the power to punishing people and withholding rewards to ensure compliance to the organizational norms?A. Reward powerB. Legitimate powerC. Coercive powerD. Referent power",
      "definition": "C. Coercive power"
    },
    {
      "term": "Which approach to conflict involves trying and winning at the other person's expense?A. ForcingB. CollaboratingC. AvoidingD. Yielding",
      "definition": "A. Forcing"
    },
    {
      "term": "What is NOT one of diversity's benefitsA. Diversity increases job satisfaction and staff retentionB. Diverse thinking increases innovationC. Diversity may cause discrimination, which in turn negatively affects job attitudes, physical health outcomes, psychological health and work related outcomesD. A diverse workforce may gives access to more diversified clients",
      "definition": "C. Diversity may cause discrimination, which in turn negatively affects job attitudes, physical health outcomes, psychological health and work related outcomes"
    },
    {
      "term": "are teams that have the authority to make decisions about how work is completed and decide ontheir goals.A. Project teamsB. Self-managed teamsC. Virtual teamsD. Operational teams",
      "definition": "B. Self-managed teams"
    },
    {
      "term": "What is suggested to build a learning zone in your organization?A. Recognising ambiguity and interdependenceB. Fostering questioning, learning from failure, and challenging conventionC. Reframing as problem openingD. All of these",
      "definition": "D. All of these"
    },
    {
      "term": "Why is leadership \"more than common sense\"? Choose three answersA. It can result in passivity in followers - an interpretation of a world in which some are born to lead and others born to followB. It often leads to a distorted picture of reality, in which leaders are heroes guiding lesser mortals through the travails of organisational strategy and executionC. Most of the long-term ideas about leadership have scientifically been proven to be wrongD. The common sense view of leadership tends over-emphasise charisma, willpower and a clear and rational thought process",
      "definition": "A. It can result in passivity in followers - an interpretation of a world in which some are born to lead and others born to follow  B. It often leads to a distorted picture of reality, in which leaders are heroes guiding lesser mortals through the travails of organisational strategy and execution  D. The common sense view of leadership tends over-emphasise charisma, willpower and a clear and rational thought process"
    },
    {
      "term": "Which of the following concepts could capture the likelihood that our effort will achieve desired results?A. Understanding financial balance sheetsB. ExpectancyC. InstrumentalityD. Hostility",
      "definition": "B. Expectancy"
    },
    {
      "term": "Which type of leader is position at 1-9 (i.e., high concern for people but low concern for production) in the leadership grid?A. Country clubB. TeamC. AuthorityD. Middle-of-road",
      "definition": "A. Country club"
    },
    {
      "term": "Which approach to conflict is the most commonly used by people in organisations?A. ForcingB. CollaboratingC. AvoidingD. Yielding",
      "definition": "C. Avoiding"
    },
    {
      "term": "What is NOT true about organizational conflict?A. Conflict should always be avoided in organisationsB. Conflict can have negative implications in that it is often stressful and can distract employees from their work.C. Conflict can lead people to question old ways of doing thingsD. None of these",
      "definition": "A. Conflict should always be avoided in organisations"
    },
    {
      "term": "Which of the following statements is true about organizational culture?A. You should always embark on culture change when you find that a different type of culture offers unique benefitsB. Your organisational culture can be identified as fitting exclusively in one of the four culture types: clan, adhocracy, market, and hierarchyC. It is impossible to combine the benefits of different culture typesD. You should only consider culture change if the behaviours that your existing culture encourages are misaligned with the key capabilities your business strategy requires",
      "definition": "D. You should only consider culture change if the behaviours that your existing culture encourages are misaligned with the key capabilities your business strategy requires"
    },
    {
      "term": "Which of the following is a reason why diversity is important?A. Diversity is increasing in organisationsB. Diversity has a real effect on organisational performanceC. Diversity can bring great benefitsD. All of these",
      "definition": "D. All of these"
    },
    {
      "term": "Which of the four quadrants of workforce segmentation includes roles that are important for delivering your key capabilities and that involve a lot of firm-specific knowledge that's difficult to source in the labor market?A. SpecialistsB. CriticalsC. ProfessionalsD. Doers",
      "definition": "B. Criticals"
    },
    {
      "term": "Which of the following is the best description of a charismatic leader? Choose 3 answersA. A leader who possesses a dominant, self-centered, self-aggrandizing and narcissistic personality who uses charisma for self-glorification.B. A leader with an egalitarian, self-transcendent, and empowering personality who uses charisma for the benefit of others.C. A leader who offers a transformative vision or ideal which exceeds the status quo and then convinces followers to accept this course of action not because of its rational likelihood of success, but because of their implicit belief in the extraordinary qualities of the leader.D. A leader who seeks to maintain stability within an organization through regular economic and social exchanges that achieve specific goals for both the leaders and their followers.",
      "definition": "A. A leader who possesses a dominant, self-centered, self-aggrandizing and narcissistic personality who uses charisma for self-glorification. C. A leader who offers a transformative vision or ideal which exceeds the status quo and then convinces followers to accept this course of action not because of its rational likelihood of success, but because of their implicit belief in the extraordinary qualities of the leader. B. A leader with an egalitarian, self-transcendent, and empowering personality who uses charisma for the benefit of others."
    },
    {
      "term": "If we meet a new person, our stereotypes can interfere with our perception of who they really are as an individual. This represents the problem ofA. PerceptionB. RealityC. Perceptual shortcutsD. None of these",
      "definition": "C. Perceptual shortcuts"
    },
    {
      "term": "Which dimension of personality reflects how caring, cooperative, and trusting we are?A. OpennessB. ConscientiousnessC. AgreeablenessD. Neuroticism",
      "definition": "C. Agreeableness"
    },
    {
      "term": "How can a leader increase self-efficacy of employees? Which of the following is NOT one of the ways?A. Help employees think about their success in similar roles and circumstancesB. Give employees difficult tasks right from the beginning to challenge themC. Point out similar successful peopleD. Show a link between employees skills and the likelihood of success",
      "definition": "B. Give employees difficult tasks right from the beginning to challenge them"
    },
    {
      "term": "Which type of diversity reflects a person's approach to problem and viewpoints?A. Categorical diversityB. Experiential diversityC. Cognitive diversityD. None of these",
      "definition": "C. Cognitive diversity"
    },
    {
      "term": "What is the most important to remember when practicing culture change?A. Change some of the important culture levers, say organisational structure and incentive systemsB. Focus only on the soft levers like virtual stores and symbolsC. Develop a holistic approach in which all of the elements that reflect organizational culture are used togetherD. Do not involve the leadership team of the organization",
      "definition": "C. Develop a holistic approach in which all of the elements that reflect organizational culture are used together"
    },
    {
      "term": "__________________is that psychological affliction you experience when you work and live in a different country with different values and beliefs, which can be stressful and get you anxious, sometimes pressured and homesick.A. DiversityB. Cultural assimilationC. Culture shockD. None of these",
      "definition": "C. Culture shock"
    },
    {
      "term": "The main advantage ofis that each division can focus on its own customer segment, productline, or geographical region.A. Matrix structureB. Divisional structureC. Functional structureD. None of these",
      "definition": "B. Divisional structure"
    },
    {
      "term": "Which of the following is a downside of teams?A. It may cost time to resolve disagreements among team members and to develop a clear and shared understanding of their tasks and rolesB. Teams inhibit the diversity of skills and knowledge contributed to solving the taskC. Working in team is not suitable to deal with more complex tasks and multifaceted tasksD. Working in team hinders innovation",
      "definition": "A. It may cost time to resolve disagreements among team members and to develop a clear and shared understanding of their tasks and roles"
    },
    {
      "term": "Which of the following is NOT one of the five primary activities making up the value chain?A. Inbound logisticsB. OperationsC. ProcurementD. Outbound logistics",
      "definition": "C. Procurement"
    },
    {
      "term": "Which of the following statements is true about McGregor's Theory X and Y?A. When you subscribe to Theory Y, your management style is likely to be more participative and focused on empowering your employees to unlock their creative potential and stimulate their commitment to workB. According to McGregor's Theory X, employees are intrinsically motivated to do a good job because they're looking for a sense of self-fulfillment or self-actualisation through their work.C. When you subscribe to Theory X, your management style is likely to be more participative and focused on empowering your employees to unlock their creative potential and stimulate their commitment to work.D. According to McGregor's Theory Y, employees are not intrinsically motivated to work, and have a tendency to avoid their responsibilities if given the chance.",
      "definition": "A. When you subscribe to Theory Y, your management style is likely to be more participative and focused on empowering your employees to unlock their creative potential and stimulate their commitment to work"
    },
    {
      "term": "It is assumed that extroversion in itself is the most dominant quality of leadership, and all leaders should be extrovert. Why is that?Choose three answersA. Because extroversion was the trait that most seemed to correlate with leadership (i.e., many leaders studied possessed it) in the first scientific studies of the subjectB. It's a trait culturally celebrated in the USA and American theorists have long dominated the leadership fieldC. It's associated with assertiveness, self-confidence and high energy, all of which seem \"obvious\" leadership traits at lay levels.D. They are scientifically proven to be good leaders",
      "definition": "A. Because extroversion was the trait that most seemed to correlate with leadership (i.e., many leaders studied possessed it) in the first scientific studies of the subject  B. It's a trait culturally celebrated in the USA and American theorists have long dominated the leadership field  C. It's associated with assertiveness, self-confidence and high energy, all of which seem \"obvious\" leadership traits at lay levels."
    },
    {
      "term": "Ourreflects whether we are more or less conscientious, agreeable, neurotic, open toexperience, and extrovertedA qualificationB. personality profileC. abilityD. None of the above",
      "definition": "B. personality profile"
    },
    {
      "term": "One of the reasons that lead to a feeling of meaninglessness is that managers always override an employee's better judgement. Why is that?A. This makes an employee's work feel meaningless because the employee always knows bestB. This makes an employee's work feel meaningless because it removes their sense of autonomyC. Because it will always lead to bullyingD. Because it wastes valuable time",
      "definition": "B. This makes an employee's work feel meaningless because it removes their sense of autonomy"
    },
    {
      "term": "Which of the following is NOT what indicated by the two-factor theory?A. Dissatisfiers can make people unhappy when there are problems but they do not really motivate even when there are no problems.B. Dissatisfiers can make people unhappy when there are problems and turn into motivators when there are no problems.C. Satisfiers can make people enjoy the work and find it meaningfulD. All of these",
      "definition": "B. Dissatisfiers can make people unhappy when there are problems and turn into motivators when there are no problems."
    },
    {
      "term": "What is NOT true about perception?A. Perception influences behaviorB. It's reality, not perception, that influences behaviorC. One's values, attitudes, and experiences can all affect perceptionD. All of these",
      "definition": "B. It's reality, not perception, that influences behavior"
    },
    {
      "term": "Which type of organizational culture is externally focused on competitive achievement and will pursue this through very effective systems and processes?A. Adhocracy cultureB. Clan cultureC. Market cultureD. Hierarchy culture",
      "definition": "C. Market culture"
    },
    {
      "term": "What to do when you see advantages in another culture type than the one you are using for your organisation?A. Immediately invest in difficult and expensive culture change programsB. Copy the other company's culture and apply in your organisationC. Make sure that the behaviors your organizational culture stimulates fit the competitive strategy that you're pursuingD. Change strategy, then change culture",
      "definition": "C. Make sure that the behaviors your organizational culture stimulates fit the competitive strategy that you're pursuing"
    },
    {
      "term": "Which type of control system directly relates to organizational culture?A. Belief systemsB. Boundary systemC. Diagnostics systemD. Interactive system",
      "definition": "A. Belief systems"
    },
    {
      "term": "Which of the following could be considered a limitation of the Two Factor Theory?A. Dissatisfiers are difficult to changeB. Absence of dissatisfiers can make people unhappy if not present but do not affect motivation when presentC. Something can be a dissatisfier or a motivator, based on our perceptionD. Challenging goals affect motivation of employees.",
      "definition": "D. Challenging goals affect motivation of employees."
    },
    {
      "term": "An organization needs to know what they excel at to be able to successfully compete in the industry in the long run, or in other words, they need to define theirA. StrategyB. VisionC. key capabilitiesD. Direction",
      "definition": "C. key capabilities"
    },
    {
      "term": "When does \"vision trap\" happen?A. When there is a disconnect between the tasks that employees do and the bigger organizational purposeB. When a manager doesn't see a dangerous situation at work and an employee gets hurtC. When an employee does not complete the task given to them by their managerD. When an employee can't see what they are doing at work",
      "definition": "A. When there is a disconnect between the tasks that employees do and the bigger organizational purpose"
    },
    {
      "term": "What is the key trade-off causing the harmonica effect in which firms go through recurring cycles from centralisation to decentralisation and back again?A. Agreeableness vs ResponsivenessB. Responsiveness vs CoordinationC. Efficiency vs CoordinationD. None of the above",
      "definition": "B. Responsiveness vs Coordination"
    },
    {
      "term": "What is meant by perceptual shortcuts?A. They restrict our thinking, and they're not often based on realityB. They can lead to stereotypingC. They can interfere with our perception of who people really are as an individualD. All of these",
      "definition": "D. All of these"
    },
    {
      "term": "Which of the following belongs to interpersonal role of leadership?A. Monitor role, disseminator role, and spokesperson roleB. Entrepreneurial role and disturbance handler roleC. Leadership role, figurehead role, and liaison roleD. Resource allocator role and negotiator role",
      "definition": "C. Leadership role, figurehead role, and liaison role"
    },
    {
      "term": "What is NOT true about personality?A. It's a pattern of traits, thoughts, and behaviorsB. It never changesC. We adjust our personality to some degree to suit our environmentD. Our personality changes overtime, but overall it's relatively stable",
      "definition": "B. It never changes"
    },
    {
      "term": "What is organisational alignment?A. Aligning your key capabilities with your business strategyB. Aligning your strategy with the external environmentC. Aligning the organisational elements - people, structure, culture, systems - with the key capabilities required for the business strategyD. Aligning the organisational elements - people, structure, culture, systems - with the business strategy",
      "definition": "C. Aligning the organisational elements - people, structure, culture, systems - with the key capabilities required for the business strategy"
    },
    {
      "term": "Which of the following is the reason why expatriation is important for an international team?A. Expatriates fill the roles in foreign countries that perhaps the country doesn't have the skills availableB. With their social networks and expertise, expatriates act as the glue between these various units of a multinational companyC. It's part of the management development schemeD. All of these",
      "definition": "D. All of these"
    },
    {
      "term": "When is meaningful feedback most effective?A. When it is delivered by an angry managerB. When it occurs a long time after the work is completed.C. When it comes directly from the work itself, such as a satisfied customerD. When it is generic and does not link directly to the employee's work",
      "definition": "C. When it comes directly from the work itself, such as a satisfied customer"
    },
    {
      "term": "Which of the following is an approach to diversity management?A. Provide diversity awareness training in the organizationB. Let diverse individuals work together on important tasks that require cooperation and frequent interactionC. Increasing decision making transparency and use objective criteria for recruitment and promotion.D. All of these",
      "definition": "D. All of these"
    },
    {
      "term": "What is implied by Peter Drucker's saying \"Culture eats strategy for breakfast.\"?A. If the organizational culture works against strategies, the strategies may not work well.B. If the organizational culture works against strategies, the culture may not work well.C. Strategy is the most important factor of successD. Culture is a part of strategy",
      "definition": "A. If the organizational culture works against strategies, the strategies may not work well."
    },
    {
      "term": "According to the instructor, the most important aspects of designing an intrinsically motivating job isA. Physical working conditionsB. Financial rewardC. Goals, feedback on achievement of goals, self-efficacy, rewardD. Supervision quality",
      "definition": "C. Goals, feedback on achievement of goals, self-efficacy, reward"
    },
    {
      "term": "Imagine you are a manager and you are developing a position description for a new role at your organisation. You want your new employee to be a 'close fit' that aligns with your organisation's principles and work. As you develop your new position description which of the options below is an important consideration? Check only one option A. Considering the congruence between work and the employee in terms of their ability to undertake part-time workB. Considering the congruence between work and the employee in terms of their ability to care for the environmentC. Considering the congruence between work and the employee in terms of their ability to work late at night timeD. Considering the congruence between work and the employee in terms of their attributes and values",
      "definition": "D. Considering the congruence between work and the employee in terms of their attributes and values"
    },
    {
      "term": "While working on a project, a manager encourages one of their employees to utilize multiple skills to complete a task. What job characteristic has the manager used to create meaningful work for their employee?A. AutonomyB. FeedbackC. Skill varietyD. Task significant",
      "definition": "C. Skill variety"
    },
    {
      "term": "Which type of leadership skill captures the ability to communicate, to coach, to help, to build good relationships and endure relationships with the people that you are leading?A. technical skillsB. interpersonal skillsC. conceptual skillsD. All of these are correct",
      "definition": "B. interpersonal skills"
    },
    {
      "term": "Despite the downsides of teams, which type of task may benefit from teamwork?A. Tasks in which a truly innovative solution is neededB. Complex tasks requiring a broad range of perspectives and knowledgeC. Both A and BD. Neither A nor B",
      "definition": "C. Both A and B"
    },
    {
      "term": "Which component of expectancy theory captures the value of the reward?A. ValanceB. ExpectancyC. InstrumentalityD. None of these",
      "definition": "A. Valance"
    },
    {
      "term": "While_________people have good relationships with leaders,__________people are told what to do, and are imposed things to do.A. In-group, out-groupB. Out-group, in-groupC. Both are correctD. Both are incorrect",
      "definition": "B. Out-group, in-group"
    },
    {
      "term": "The following is the key problems that have emerged around HRM EXCEPT:A. The general empowerment focus in HRM that is based on McGregor's theory Y tends to be North American-centricB. HRM has generally failed to secure a seat at the top management tableC. The rhetorical promise of HRM tends to be quite different from the actual reality of HRMD. A universal HRM approach that focuses on maximising the development potential of every employee can become disconnected from business strategy",
      "definition": "B. HRM has generally failed to secure a seat at the top management table"
    },
    {
      "term": "One of the most widely accepted models of personality at work is the Big 5 model. What are the five personality dimensions included in this model?A. Openness, Conscientiousness, Extroversion, Introversion, NeuroticismB. Openness, Conscientiousness, Extroversion, Agreeableness, NeuroticismC. Openness, Conscientiousness, Undependability, Agreeableness, NeuroticismD. None is correct",
      "definition": "B. Openness, Conscientiousness, Extroversion, Agreeableness, Neuroticism"
    },
    {
      "term": "Among the four main elements of an organization, which one can be thought of as the equivalent of the bloodstream in human body?A. Organization structureB. PeopleC. Organizational cultureD. Organizational system",
      "definition": "B. People"
    },
    {
      "term": "What is NOT true about organisational culture?A. It could be summarized as the way people do things in an organizationB. It includes the values, norms, beliefs, and behaviors that people take for grantedC. People who live and breathe a particular organizational culture can easily identify itD. Culture can be very difficult to identify",
      "definition": "C. People who live and breathe a particular organizational culture can easily identify it"
    },
    {
      "term": "In order to increase the likelihood of job satisfaction, values should ideally fit with which of the following? Choose two answersA. Organisational cultureB. Whether you and your boss both like to play footballC. Ability to get to work on timeD. Job characteristics",
      "definition": "A. Organisational culture  D. Job characteristics"
    },
    {
      "term": "The following explanations talk about different Leadership models. Which of them is about Fiedler's Contingency Leadership model?A. It has 4 styles (directive, supportive, participative, achievement-orientated) determined by 6 variables (Authoritarianism, Locus of Control, Ability, Task Structure, Formal Authority, Work Group)B. It has 4 styles (directing, coaching, supporting, delegating) determined by 4 variables (development level or degree of maturity)C. It has 2 styles (task or relationship-oriented) determined by 3 variables (leader-member relationship, task structure, and position power)D. It has 7 styles (from autocratic to participative) determined by 3 variables (boss, subordinate and situation)",
      "definition": "C. It has 2 styles (task or relationship-oriented) determined by 3 variables (leader-member relationship, task structure, and position power)"
    },
    {
      "term": "What makes organisational culture important? Choose three answersA. It can be a source of competitive advantage, therefore, very difficult to copyB. It can be a hindrance to organizational change and agilityC. Culture can help prevent unethical behavior and corporate scandals.D. It costs the organizational a lot of money to constitute",
      "definition": "A. It can be a source of competitive advantage, therefore, very difficult to copy  B. It can be a hindrance to organizational change and agility  C. Culture can help prevent unethical behavior and corporate scandals."
    },
    {
      "term": "If responsiveness is most central to your strategy, which type of structure should you use for your organization?A. Divisional structureB. Matrix structureC. Functional structureD. None of these",
      "definition": "A. Divisional structure"
    },
    {
      "term": "When solving conflict, leaders can improve maximum mutual understanding or the extent to which each party really comprehends the interests of the other by applying which of the following conflict approach?A. Collaboration approachB. Forcing approachC. Avoiding approachD. Compromising approach",
      "definition": "A. Collaboration approach"
    },
    {
      "term": "What makes it difficult to change culture?A. It is expensiveB. People in the organisation may be emotionally attached to the cultureC. It involves changing strategies as wellD. All are correct",
      "definition": "D. All are correct"
    },
    {
      "term": "______________are defined as a set of differentiated skills, complimentary assets, and routines that provide the basis for a firm's competitive capacities.A. StrategyB. VisionC. Competitive advantagesD. Key capabilities",
      "definition": "D. Key capabilities"
    },
    {
      "term": "Why can organisational culture be an important source of competitive advantage?A. Because organisational culture is difficult to identifyB. Because organisational culture can be difficult to changeC. Because culture can make an organisation less agileD. Because it is difficult to copy which makes it more sustainable as a potential source of advantage",
      "definition": "D. Because it is difficult to copy which makes it more sustainable as a potential source of advantage"
    },
    {
      "term": "Emotional labor - particularly in service roles - have to project an emotion at a time when they're feeling a different emotion at work, how do they actually feel?A. They feel higher levels of stress and fewer positive emotions.B. They feel higher levels of stress and higher positive emotions.C. They feel lower levels of stress and fewer positive emotions.D. They feel lower levels of stress and higher positive emotions",
      "definition": "A. They feel higher levels of stress and fewer positive emotions."
    },
    {
      "term": "The common characteristic of manufacturing jobs is that they require substantial interaction with an organization's customers.A. TRUEB. FALSE",
      "definition": "B. FALSE"
    },
    {
      "term": "What is the main risk of linking KPIs to incentives?A. Your KPIs may not be linked to your business strategyB. Your KPIs may be inaccurateC. Your incentives may be ineffectiveD. People may manipulate the KPIs as an unintended consequence",
      "definition": "D. People may manipulate the KPIs as an unintended consequence"
    },
    {
      "term": "What is the main purpose of the MARS model?A. To identify different personalty dimensions and related behavioursB. To identify how the expectations of others affect work related behaviourC. To understand the sources and factors behind individual behaviourD. To analyse the fit between personality dimensions and job requirements",
      "definition": "B. To identify how the expectations of others affect work related behaviour  C. To understand the sources and factors behind individual behaviour"
    },
    {
      "term": "The bureaucratic cultural form could be defined as:A. A leadership belief in strong, mutually reinforcing exchanges and linkages between employees and departmentsB. A leadership mind-set that values order, stability, status, and efficiency.C. A leadership belief in active monitoring of the external environment for emerging opportunities and threats and adapting to them.D. A leadership mind-set that encourages and values a highly competitive work environment.",
      "definition": "B. A leadership mind-set that values order, stability, status, and efficiency."
    },
    {
      "term": "Phil is a brand manager in a medium size organisation in the FMCG sector. In launching a new brand of a soft drink, Phil has been focusing on promoting the features such as the ingredients, flavours, and the amount of caffeine. Which of the following benefits Phil has been focusing on?A. Self-expressive benefitsB. Social benefitsC. Functional benefitsD. Higher purpose values",
      "definition": "C. Functional benefits"
    },
    {
      "term": "Which approach to conflict involves giving in completely to the other party with little or no attention to one's own interests?A. ForcingB. CollaboratingC. AvoidingD. Yielding",
      "definition": "D. Yielding"
    },
    {
      "term": "When Matt avoids blame by manipulating information by distortion or deception, he is using the defensive behavior known asA. over-conformingB. playing safeC. playing dumbD. misrepresenting",
      "definition": "D. misrepresenting"
    },
    {
      "term": "Which of the following is NOT one of the dimensions of an effective team?A. Psychological safetyB. DependabilityC. ConflictD. Structure and clarity",
      "definition": "C. Conflict"
    },
    {
      "term": "Which of the following is NOT cited as a culture that creates a breeding ground for politicking?A. cultures with unclear performance evaluation systemsB. high trust culturesC. cultures with role ambiguityD. democratic decision-making cultures",
      "definition": "B. high trust cultures"
    },
    {
      "term": "One way people manage emotional labor and emotions generally at work, is emotional intelligence. You try to develop the ability to support those other people in managing their own emotions. Which element of emotional intelligence that you focus on?A. Self-awarenessB. Self-managementC. Social awarenessD. Relationship management",
      "definition": "D. Relationship management"
    },
    {
      "term": "According to Fred Luthans, which of these behaviours would successful managers excel at?Choose three answersA. Learning the written and unwritten rules of the organisational culture and where the power actually liesB. Developing good working relationships with people in positional powerC. Inspiring loyalty, hard work and enthusiasm in those they leadD. Building political coalitions",
      "definition": "A. Learning the written and unwritten rules of the organisational culture and where the power actually lies  B. Developing good working relationships with people in positional power  D. Building political coalitions"
    },
    {
      "term": "Who developed the balanced scorecard in the early 1990s?A. Kaplan and NortonB. MaslowC. Myer BridgeD. Jaco Lok",
      "definition": "A. Kaplan and Norton"
    },
    {
      "term": "According to which theory do leaders believe that employees want to have an intimate and happy working environment with others they work with?A. Theory XB. Theory YC. Theory ZD. Pygmalion effect theory",
      "definition": "C. Theory Z"
    },
    {
      "term": "Which model represents the theory that effective leadership depends upon a proper match between a leader's style of interacting with subordinates and the degree to which the situation gives control and influence to the leader?A. Leader-Member Exchange ModelB. Fiedler's Contingency ModelC. Hersey and Blanchard's Situational Leadership ModelD. Vroom and Yetton's Leader-Participation Model",
      "definition": "B. Fiedler's Contingency Model"
    },
    {
      "term": "All of the following factors increase the probability that cultural change can be successfully implemented EXCEPTA. the existence of a dramatic crisisB. a positive organizational cultureC. an organization that is both young and smallD. a weak dominant culture",
      "definition": "C. an organization that is both young and small"
    },
    {
      "term": "What is implied by the trade-off between efficiency and coordination in organisational structure?A. The harmonica effectB. Organizing based on efficiency leads to sub optimal decision making and can make coordination very difficultC. Whether to centralize and focuse on synergies through increased coordination, or decentralize and focuse on responsivenessD. Prioritizing the efficiency of the organization can inevitably cost the responsiveness",
      "definition": "B. Organizing based on efficiency leads to sub optimal decision making and can make coordination very difficult"
    },
    {
      "term": "Which of the following conflict approach may lead to groupthink?A. Collaboration approachB. Forcing approachC. Avoiding approachD. Compromising approach",
      "definition": "C. Avoiding approach"
    },
    {
      "term": "Which of the following statements is true about the fit between one's personality and his/her job? Choose 3 answersA. If your personality fits well with your job, you are much more likely to perform well and be satisfied at workB. Never talk to your mentor about the misfit if there is anyC. Sometimes you may find some misfit between your personality and your job. Then you will need to work to adapt your behavior to the situation.D. We mostly can see some fit between the personality of a great employee and the work they do",
      "definition": "A. If your personality fits well with your job, you are much more likely to perform well and be satisfied at work  C. Sometimes you may find some misfit between your personality and your job. Then you will need to work to adapt your behavior to the situation.  D. We mostly can see some fit between the personality of a great employee and the work they do"
    },
    {
      "term": "Which type of organizational culture emphasises innovation, creativity and risk-taking?A. Adhocracy cultureB. Clan cultureC. Market cultureD. Hierarchy culture",
      "definition": "A. Adhocracy culture"
    },
    {
      "term": "If the Pygmalion Effect is accurate, which leadership attitude becomes problematic?A. Self-efficacy as people will stop believing in their capacity to do the tasksB. Theory Z as people will become too attached to their teammates to focus on workC. Theory Y as they will become so content at being treated well they'll lose the motivation to work hardD. Theory X, as treating people like they are lazy and dislike work will result in them becoming lazy, disliking work and performing less effectively",
      "definition": "D. Theory X, as treating people like they are lazy and dislike work will result in them becoming lazy, disliking work and performing less effectively"
    },
    {
      "term": "According to Tuckman's model of team process, which stage in the process involves members with different perspectives emerging and jostling for authority?A. FormingB. StormingC. NormingD. Performing",
      "definition": "B. Storming"
    },
    {
      "term": "Organizational characteristics that can be substitutes for leadership include all of the following EXCEPTA. cohesive work groupsB. formalized goalsC. rigid rules and proceduresD. mentor relationships",
      "definition": "D. mentor relationships"
    },
    {
      "term": "Which type of leadership skill captures the ability to conceptualize a situation, look at various strategies and alternatives, and decide in directions that the organization needs to travel?A. technical skillsB. interpersonal skillsC. conceptual skillsD. All of these are correct",
      "definition": "C. conceptual skills"
    },
    {
      "term": "Michael is an experienced pilot in the Air Force. He was asked to fly a fighter jet towards a dangerous situation by his leader and he agreed to take on the mission. Often meaninglessness can happen at work when you put people at risk of physical or emotional harm. Why is Michael's situation not an example of meaninglessness at work?A. He may expect to receive a reward after successfully accomplishing the missionB. His decision to take the mission was an informed choice based on the understanding of all the risks associated with being a pilot in the Air ForceC. He is an experienced pilot and confident that he won't get hurt while he is on her missionD. He just doesn't think that this is unfair treatment by his leader and therefore thinks his work is meaningful",
      "definition": "B. His decision to take the mission was an informed choice based on the understanding of all the risks associated with being a pilot in the Air Force"
    },
    {
      "term": "Values like affordability, customer service, quality and innovation belong to which level of brand vision?A. extended valuesB. emotional valuesC. higher-purpose valuesD. core values",
      "definition": "D. core values"
    },
    {
      "term": "If you want to lose weight, and you measure your weight every day to track how you are going, your weight is an effect of something else. What is your weight that can be considered in a balance scorecard?A. lag indicatorsB.lead indicatorsC. left indicatorsD. late indicators",
      "definition": "A. lag indicators"
    },
    {
      "term": "When was the balanced scorecard developed?A. early 1990sB. early 1980sC. early 1970sD. early 1960s",
      "definition": "A. early 1990s"
    },
    {
      "term": "Conflict is likely to lead to negative outcomes when it is aimed at people and relationships and when it's hostile and emotional.A. TRUEB. FALSE",
      "definition": "A. TRUE"
    },
    {
      "term": "Which of the following effects are associated with transformational leadership? (2 correct answers)A. Improved organizational performance, culture, and learning.B. Improved critical thinking and cogntive flexibilityC. Improved follower organizational commitment.D. Improved discipline and bureaucracy",
      "definition": "A. Improved organizational performance, culture, and learning.  C. Improved follower organizational commitment."
    },
    {
      "term": "In the early 20th century, mass industrial production led to the problem of employees' emotic psychological disconnection from work, consequently, this led to all of the problem below excA. high productivityB. absenteeismC. strikesD. workplace resistance",
      "definition": "C. strikes"
    },
    {
      "term": "In order to minimize the downside of perceptual shortcuts, you should do all of the followingA. Using different sources of information to make decisions.B. Avoiding making assumption about people based on their gender or age.C. Seeing people as individuals with the whole characteristics of their group.D. Being mindful of the way you're categorizing them and the assumptions that you might be",
      "definition": "A. Using different sources of information to make decisions."
    },
    {
      "term": "Which of the following best describes the logo design of brands like Apple, Lacoste, and TwitA. Letter MarksB. Word MarksC. Abstract DesignD. Pictorial Design",
      "definition": "D. Pictorial Design"
    },
    {
      "term": "You understand your own strengths and weaknesses, and you understand how your interact people you're working off, your constantly cognisance of that kind of relational action. Which dimension of authentic leadership that you are holding?A. self-awarenessB. relational transparencyC. balanced processingD. internalised moral",
      "definition": "A. self-awareness"
    },
    {
      "term": "A group that I value and I'm very attached to is my research group. I'm happy that I belong to feel as though my membership is part of who I am at work.What kind of identification is reflected in this example?A. StrongB. WeakC. NormalD. Spontaneous",
      "definition": "A. Strong"
    },
    {
      "term": "For the dimension of alienation of Karl Marx - \"the work led workers to feel alienated from the world\", how does the natural world itself seem to be?A. It seems to be used up, burned through by industrial production.B. It stays unchanged.C. It seems to be built up, wisely used by industrial production.D. It seems to be put into a careful reservation plan of the government.",
      "definition": "A. It seems to be used up, burned through by industrial production."
    },
    {
      "term": "One way people manage emotional labor and emotions generally at work, is emotional intelli develop the ability of inspirational leadership, developing others, change catalyst. Which ele intelligence that you focus on?A. Self-awarenessB. Self-managementC. Social awarenessD. Relationship management",
      "definition": "D. Relationship management"
    },
    {
      "term": "In conflict process, what is the approach conflict that works to find a solution that is beneficia it's like a win-win approach, that is high in assertiveness, is concerned for ourselves and high cooperativeness?A. Collaboration approachB. Forcing approachC. Avoiding approachD. Compromising approach",
      "definition": "A. Collaboration approach"
    },
    {
      "term": "Well the situation we're currently in is not a good situation. We need to get from here to ther transform the organization.\"What type of leader should say this sentence?A. Transformational leaderB. Autocrat leaderC. Transactional leaderD. Designated leader",
      "definition": "A. Transformational leader"
    },
    {
      "term": "What are key capabilities?A. Key capabilities are \"a set of differentiated skills, complementary assets, and routines tha for a firm's competitive capacities\"B. Key capabilities are \"a set of differentiated knowledge, complementary assets, and habits firm's competitive capacities\"C. Key capabilities are \"a set of hard skills built from routines and culture of employees that for a firm's competitive capacities\"D. None is correct",
      "definition": "A. Key capabilities are \"a set of differentiated skills, complementary assets, and routines tha for a firm's competitive capacities\""
    },
    {
      "term": "People who are high in neuroticism tend to beA. More moodyB. Less moodyC. More negativeD. Less negative",
      "definition": "C. More negative"
    },
    {
      "term": "Advantages of the dashboard is that the balanced scorecard gives management an instant c that......A. enables them to focus on what is most importantB. helps them prevent sub-optimization based on measures that are too narrow in their scopC. All are correctD. None is correct",
      "definition": "C. All are correct"
    },
    {
      "term": "Karl Marx introduced the concept of alienation to show...A. the meaninglessness at workB. the meaningfulness at workC. the happiness at workD. the value at work",
      "definition": "A. the meaninglessness at work"
    },
    {
      "term": "There was a calling to labor, a deeply felt need on the part of people to work, to not be idle, t through their work and labor to the making of the world. This is the idea ofA. Max WeberB. Karl MarxC. Khng TD. Adam Smith",
      "definition": "A. Max Weber"
    },
    {
      "term": "Beer companies systematically monitoring what the government is thinking and doing in rela regulation as an important strategic contingency is an example of:A. A diagnostics systemB. A boundary systemC. An interactive systemD. A belief system",
      "definition": "C. An interactive system"
    },
    {
      "term": "Beer companies systematically monitoring what the government is thinking and doing in rela regulation as an important strategic contingency is an example of:A. A diagnostics systemB. A boundary systemC. An interactive systemD. A belief system",
      "definition": "C. An interactive system"
    },
    {
      "term": "What is theory X and Theory Y about?A. How workers can save time at workB. How workers feel about themselvesC. How managers believe the workers areD. How managers feel about themselves",
      "definition": "C. How managers believe the workers are"
    },
    {
      "term": "What should you focus on when designing a system for your organization?A. encourage behaviors that enable your strategyB. punish unwanted behaviorsC. measuring financial resultsD. hire the best employees",
      "definition": "A. encourage behaviors that enable your strategy"
    },
    {
      "term": "When the leader conveys a version of the future that is much better than the present and ma followers will follow him and get there.What is this behavior of the charismatic leader?A. idealized influenceB. inspirational motivationC. individual considerationD. intellectual stimulation",
      "definition": "A. idealized influence"
    },
    {
      "term": "What should not leaders focus on when designing goals?A. ProfitableB. VisionaryC. Emotionally appealingD. Meaningful",
      "definition": "A. Profitable"
    },
    {
      "term": "If the Pygmalion Effect is accurate, which leadership attitude becomes problematic?A. Theory Y as they will become so content at being treated well they'll lose the motivation tB. Theory X, as treating people like they are lazy and dislike work will result in them becomi work and performing less effectivelyC. Self-efficacy as people will stop believing in their capacity to do the tasksD. Theory Z as people will become too attached to their teammates to focus on work",
      "definition": "B. Theory X, as treating people like they are lazy and dislike work will result in them becomi work and performing less effectively"
    },
    {
      "term": "An effect of charismatic leadership is that the followers will totally and utterly unconditionally leader is doing, so the follower will...A. become more self-confidentB. become less self-confidentC. Stay normalD. become dependent on the leader",
      "definition": "D. become dependent on the leader"
    },
    {
      "term": "Starbucks' founder Howard Schultz was inspired by his fathers' struggles with poor health to the first American company to provide health care options to part-time employees. Schultz c his life experiences to build a company that was a reflection of his personal values. This is an example ofA. Autocratic leaderB. Democratic leaderC. Authentic leaderD. Bureaucratic leader",
      "definition": "C. Authentic leader"
    },
    {
      "term": "You are a physician. As you move through your education and work to become a physician, identify with this profession. The values that are central to being a physician become your va behave as you think a physician should. You think of yourself at work as less of an individual and more as a member who reflects the characteristics of this physician group. What kind of identification is reflected in this example?A. StrongB.WeakC. NormalD. Spontaneous",
      "definition": "A. Strong"
    },
    {
      "term": "Which is not an example of good organizational citizenship behavior?A. buying coffee for colleaguesB. volunteering for extra workC. cooperating with colleaguesD. sharing ideas",
      "definition": "A. buying coffee for colleagues"
    },
    {
      "term": "According to professor Jaco Lok, what is the most concerned reason for employees' resistarA. Asking them to change cultures is equivalent to asking them to change the very values th people.B. Asking them to change cultures is threatening them to lose their jobs.C. Asking them to change cultures is equivalent to underestimating their work performanceD. Asking them to change cultures is equivalent to negative feedback on their contribution t",
      "definition": "A. Asking them to change cultures is equivalent to asking them to change the very values th people."
    },
    {
      "term": "In the process of perception, people categorize themselves and others into groups, they defil comparatively. Then people simplify the way they perceive people in their group and people They believe that they are similar within a group and that there are differences between grou What is this process called?A. HomogenisationB. ClassificationC. SocializationD. Forming group",
      "definition": "A. Homogenisation"
    },
    {
      "term": "The main risk of linking KPIs to incentives is that.A. Your KPIs may not be linked to your business strategyB. Your KPIs may be inaccurateC. Your incentives may be ineffectiveD. People may manipulate the KPIs as an unintended consequence",
      "definition": "D. People may manipulate the KPIs as an unintended consequence"
    },
    {
      "term": "You are a manager. If your employees are intrinsically motivated to do a good job because tl a sense of self-fulfillment or self-actualization through their work, which theory of human mol you apply?A. Theory XB. Theory YC. Democratic leadershipD. Laissez Faire leadership",
      "definition": "B. Theory Y"
    },
    {
      "term": "Ethnocentricism is closest to which of the following statements hypothetically associated witl country MNE moving to a developing country where child labour is the norm?A. Let's understand why children are engaged in paid work in some countriesB. Children should not be engaged in paid work in developing countries.C. It is acceptable to engage children in paid work because of the local economic circumstarD. It is up to the local managers to decide whether to engage children in paid work",
      "definition": "B. Children should not be engaged in paid work in developing countries."
    },
    {
      "term": "Why is it important for leaders to enable a broader social-connectedness between employee workplace?A. Psychological wellbeing is at risk, as is cognitive performance, if people can't socialise atB. People with broad organisational knowledge that people like collaborating with seem to aC. The act of socialising with other people on a regular basis is increasingly being seen as n maintaining and increasing the information highways within the brain. It helps people think beD. People with friends at work tend to be happier and more productive",
      "definition": "A. Psychological wellbeing is at risk, as is cognitive performance, if people can't socialise at  B. People with broad organisational knowledge that people like collaborating with seem to a  C. The act of socialising with other people on a regular basis is increasingly being seen as n maintaining and increasing the information highways within the brain. It helps people think be"
    },
    {
      "term": "Which of the following is not the responsibility of Human resource management?A. remunerationB. processes and policiesC. talent managementD. patrolling property",
      "definition": "D. patrolling property"
    },
    {
      "term": "What does the management guru Peter Drucker mean when he states that \"culture eats stra breakfast.\"?A. Culture and strategy should be aligned to bring an organization to success.B. Strategy is more important than culture.C. Culture is more important than strategy.D. Strategy should be developed to serve the organizational culture.",
      "definition": "C. Culture is more important than strategy."
    },
    {
      "term": "How should leaders be when setting group norms for behavior and in strengthening group vaA. Very influentialB. Very aggressiveC. As friendly as possibleD. Avoiding and let the followers make decision",
      "definition": "A. Very influential"
    },
    {
      "term": "In the conflict process, what is the approach conflict that we apply if we believe there's a trac winning and losing?A. Collaboration approachB. Forcing approachC. Avoiding approachD. Compromising approach",
      "definition": "B. Forcing approach"
    },
    {
      "term": "Conflict can be very positive becauseA. Conflict leads people to question old ways of doing things and leads them to debate issueB. Conflict hides all different perspectives much more thoroughlyC. Conflict encourages organisations from continuing on the same tired pathD. Conflict strengthens the likelihood that organizations will ignore changes and opportunitie environment",
      "definition": "A. Conflict leads people to question old ways of doing things and leads them to debate issue"
    },
    {
      "term": "What should be bad advice for transformational leaders?A. They need to earn as much money as possibleB. They need to explain what is problematic about the current organizationC. They need to explain the promised land of the future organizationD. They need to break down the pathway of the journey of how the organization is going to is now, to where it is going.",
      "definition": "A. They need to earn as much money as possible"
    },
    {
      "term": "One way people manage emotional labor and emotions generally at work, is emotional intelli develop the ability of self-control transparency, adaptability, initiative. Which element of emc that you focus on?A. Self-awarenessB. Self-managementC. Social awarenessD. Relationship management",
      "definition": "B. Self-management"
    },
    {
      "term": "Since 2010, there have been scores of employee suicides by those producing Apple iPhones manufacturing premises in China because they found their job meaningless.Those manufacturing workers in China may have experienced work conditions that are not to those criticized by Karl Marx back in the 19th century in his theory of________________A. AlienationB. SpiritualC. NovelD. Industrial revolution",
      "definition": "A. Alienation"
    },
    {
      "term": "What is the effect of charismatic leadership?A. the followers believe in the rightness of the visionB. the followers doubt in the rightness of the visionC. the followers just complete their job as being toldD. the followers need high encourage to complete their tasks",
      "definition": "A. the followers believe in the rightness of the vision"
    },
    {
      "term": "There is a risk that leaders can take actions that unintentionally destroy meaning of work of t whenA. Leaders take their employees for granted and not recognizing their hard work.B. Leaders serves to connect employees from the bigger picture aims and purpose of the or team.C. Leaders offer fair distribution of resources and procedural justice.D. Leaders give employees opportunity to develop their skills.",
      "definition": "A. Leaders take their employees for granted and not recognizing their hard work."
    },
    {
      "term": "According to the instructor, a 'gatekeeper' best belongs to which of the following types of role one optionA. Shakespearean related roleB. Castle related roleC. Relationship related roleD. Business related role",
      "definition": "C. Relationship related role"
    },
    {
      "term": "In conflict process, what is the approach conflict that leads us to lose some and gain some, v achieving a mutually agreeable balance of loss and gain?A. Collaboration approachB. Forcing approachC. Avoiding approachD. Compromising approach",
      "definition": "D. Compromising approach"
    },
    {
      "term": "Conflict does not always lead to negative effects.A. TRUEB. FALSE",
      "definition": "A. TRUE"
    },
    {
      "term": "Which of the following is false about a personalized charismatic leader?A. CaringB. DominantC. NarcissisticD. Self-centered",
      "definition": "A. Caring"
    },
    {
      "term": "The four types of control systems are: belief systems, boundary systems, diagnostic system systems.Which system is about clearly stating the values of the company, which directly relates to or culture?A. belief systemsB. boundary systemsC. diagnostic systemsD. interactive systems",
      "definition": "A. belief systems"
    },
    {
      "term": "The concept of alienation by Karl Marx figured heavily in the work of 20th century scientists i business leaders, industrial relations specialists, personal managers, and governments.A. TRUEB. FALSE",
      "definition": "A. TRUE"
    },
    {
      "term": "The four types of control systems are: belief systems, boundary systems, diagnostic system systems.Which system is used to monitor performance?A. belief systemsB. boundary systemsC. diagnostic systemsD. interactive systems",
      "definition": "C. diagnostic systems"
    },
    {
      "term": "A 1997 study of 511 leaders found that 70 per cent were considered 'loners'. How did the instructor explain why this might be the case?Check only one optionA. They lacked interdependent and socially connected professional relationshipsB. They were often frustrated and impatient with others.C. The weren't highly intellectualD. They lacked the technical skills to lead",
      "definition": "A. They lacked interdependent and socially connected professional relationships"
    },
    {
      "term": "A brand has adopted a simple abstract mark for its logo, in which the logo can be interpreted in several ways, the sun, a wheel, or a ball. Such an abstract logo may suffer from...Check only one optionA. Both Conceptual and Visual ComplexityB. Neither of Visual or Conceptual ComplexityC. Conceptual ComplexityD. Visual Complexity",
      "definition": "C. Conceptual Complexity"
    },
    {
      "term": "A brand's tagline/slogan is \"lowest prices, every day\". This is an example of Check only one optionA. Motivational TaglineB. Competitive TaglineC. Provocative taglineD. Descriptive Tagline",
      "definition": "D. Descriptive Tagline"
    },
    {
      "term": "A disadvantage of team reward systems is which of the following:A. Team reward systems may increase social loafingB. Team reward systems may prevent dissentC. Individual reward systems are less costlyD. Teams do not have shared goals that are measurable",
      "definition": "A. Team reward systems may increase social loafing"
    },
    {
      "term": "A lot of of Shakespeare's work was written based on the iambic pentameter, using five strong beats and five weak beats. Why did he use this technique? Check only one option A. Because holding your breath for five seconds makes you better at geometryB. Because five seconds was considered the average length of a human breathC. Because five was Shakespeare's favorite numberD. Because playing an instrument is easier if you use five strong beats and five weak beats",
      "definition": "B. Because five seconds was considered the average length of a human breath"
    },
    {
      "term": "A manager provides employees discretion to respond to customer requests, greater responsibility over planning, scheduling and coordination, and work that does not just follow a narrow set of similar activities. Which of the following elements of the job characteristic theory has the manager activated?A. Skill varietyB. AutonomyC. Part-time employmentD. Task significance",
      "definition": "A. Skill variety   B. Autonomy   D. Task significance"
    },
    {
      "term": "A prescriptive leadership model: Check only one option A. Identifies contingency variables and leadership styles without specifying which style to use in a given situation.B. Provides a sequential set of questions that are rules that help determine the best leadership style for the situationC. Tells the user exactly which style to use in a given situation.D. Substitutes or neutralizes leadership through a set of specific situational characteristics",
      "definition": "C. Tells the user exactly which style to use in a given situation."
    },
    {
      "term": "A start-up business owner is considering different options for choosing the brand name, and eventually comes up with the idea of using an animal name, calling the business \"Cheetah\". Which of the following applies to this statement?Check only one optionA. This is an example of a \"Fabricated\" brand nameB. This is an example of \"Creative spelling\"C. The business owner has adopted the 'Metaphor\" option for the brand nameD. Such brand name strategy is called \"Descriptive\" and explicitly conveys the purpose of Business",
      "definition": "C. The business owner has adopted the 'Metaphor\" option for the brand name"
    },
    {
      "term": "A strategic approach to HRM... A. Identifies which roles are most critical for delivering on the required key capabilitiesB. Identifies which roles involve firm-specific knowledge that is difficult to source in the labour marketC. Centrally involves an acceptance of the fact that the investments you can make in developing and retaining your workforce are finite, and you therefore need to focus these investments on your most critical rolesD. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "According to a UK research study quoted by the instructor in the video on 'values and attitudes', which of the following is considered to have the smallest correlation with job satisfaction?A. Relationship with co-workersB. The nature of workC. Financial rewardsD. Quality of supervision",
      "definition": "C. Financial rewards"
    },
    {
      "term": "According to Boltanski and Chiapello's New Spirit of Capitalism the meaning of managerial work in particular has been reinvented since the crises of the 1960s and 1970s. With this in mind, which of the following statements are correct?Check all options that applyA. The meanings applied to managerial work have changed from it being seen as a largely administrative, unglamorous role, to now being written about as an inspiring, charismatic, innovative, authentic activity.B. The emergence and dominance of talk of business 'leadership' is an example of Boltanski and Chiapello's New Spirit of CapitalismC. The emergence of talk of business today being about such things as ethics, social responsibility, and sustainability is an example of Boltanski and Chiapello's new spirit.D. Boltanksi and Chiapello's work implies that business today is ethical, inspiring, sustainable and responsible.",
      "definition": "A. The meanings applied to managerial work have changed from it being seen as a largely administrative, unglamorous role, to now being written about as an inspiring, charismatic, innovative, authentic activity.   B. The emergence and dominance of talk of business 'leadership' is an example of Boltanski and Chiapello's New Spirit of Capitalism   C. The emergence of talk of business today being about such things as ethics, social responsibility, and sustainability is an example of Boltanski and Chiapello's new spirit."
    },
    {
      "term": "According to consumer psychology of brand model, the consumers are engaged with brands in three levels Check all that applyA. Functionally-driven engagementB. Consumer's self-centered engagementC. Social engagementD. Typical engagement",
      "definition": "A. Functionally-driven engagement   B. Consumer's self-centered engagement   C. Social engagement"
    },
    {
      "term": "According to Holland's model, Which of the following types of people are characterized by their problem solving skills? Choose all options that applyA. DangerousB. EnterprisingC. InvestigativeD. Conventional",
      "definition": "B. Enterprising   C. Investigative"
    },
    {
      "term": "According to Jeffrey Pfeffer, what are the negative behavioural knock-ons of inspirational modes of leadership and the fables and stories that accompany them?Check only one optionA. Change resistence and change fatigue when it becomes clear inspiration isn't enoughB. Cynicism for some and the development of an unrealistic expectations of ourselves for othersC. The stories are little more than catnip for people suffering in soul-crushing jobsD. The stories told about leaders are mythical, exaggerated or misreported, deliberately or accidentally, by the leaders themselves and those who write about and research them",
      "definition": "A. Change resistence and change fatigue when it becomes clear inspiration isn't enough"
    },
    {
      "term": "According to Jordan B Peterson, what is leadership?Check only one optionA. It can be predicted through measuring a person's emotional or social intelligenceB. It is often an illegitimate use of power that establishes needless hierarchiesC. It is a manifestation of hierarchical order as a biological imperative, in which superior specimens naturally rise to the topD. It is the expression of diverse ideas and perspectives, none of which should have inherent privilege, in a participative and safe environment",
      "definition": "C. It is a manifestation of hierarchical order as a biological imperative, in which superior specimens naturally rise to the top"
    },
    {
      "term": "According to Professor Albert Mehrabian what element is most crucial in building rapport? Check only one optionA. Body languageB. Average heightC. WordsD. Parental similarity",
      "definition": "A. Body language"
    },
    {
      "term": "According to Ron Warren's research approximately how many American workers have reported being bullied at work? And how many American workers actually report that they have been bullied at work?Check only one optionA. 37% and 0.05%B. 62% and 63%C. 90% and 20%D. 65% and 20%",
      "definition": "A. 37% and 0.05%"
    },
    {
      "term": "According to the article,'Organizational Distrust Is Rampant: Why Leaders Should Be Worried'by Christine Comaford, \"trust of CEOs is at an all-time low\". Which of these options is not an example of one of the three pitfalls that CEOs should try to avoid to regain the trust of their employees?Check only one optionA. Lying and cheating their employeesB. Asking for feedback yet not acting on itC. Unemotional or not compelling mission valuesD. Ineffective delegation",
      "definition": "A. Lying and cheating their employees"
    },
    {
      "term": "According to the instructor what is the most common feature found in the most viral TED Talks? Check only one optionA. The speaker's resume and qualificationsB. The speaker's accentC. The speaker's heightD. Personal stories",
      "definition": "D. Personal stories"
    },
    {
      "term": "According to the instructor, a 'gatekeeper' best belongs to which of the following types of roles? Check only one optionA. Castle related roleB. Relationship related roleC. Business related roleD. Shakespearean related role",
      "definition": "B. Relationship related role"
    },
    {
      "term": "According to the instructor, how can we ensure that our organisation can deliver on its strategy, while at the same time remaining sufficiently agile?A. Break the organization down into its main elements and align those elements with key capabilitiesB. Use the value chain analysis to formulate the vision and mission of the organisation.C. Focus on helping the organisation become number one in the market using key capabilities.D. Work with organisational members as a team and create a vision, and develop a strategy.",
      "definition": "A. Break the organization down into its main elements and align those elements with key capabilities"
    },
    {
      "term": "According to the instructor,we believe that people are similar within a group and that there are differences between groups. Which of the following concepts best captures this point? A. Group therapyB. ExtroversionC. Self-fulfilling prophecyD. Homogenisation",
      "definition": "D. Homogenisation"
    },
    {
      "term": "According to the instructor, what is the main criticism of Maslow's Heirarchy model? Check only one optionA. It does not include financial rewards as a motivationB. Its claim of upward movement on hierarchy of needs is unrealisticC. It does not explain why kings and queens are at the top of the social hierarchy in EnglandD. It does not highlight how important it is to look after the environment",
      "definition": "B. Its claim of upward movement on hierarchy of needs is unrealistic"
    },
    {
      "term": "According to the instructor, which of the following answers describes the most important aspects of designing an intrinsically motivating job?A. Supervision qualityB. Physical working conditionsC. Goals, feedback on achievement of goals, self-efficacy, rewardD. Financial reward",
      "definition": "C. Goals, feedback on achievement of goals, self-efficacy, reward"
    },
    {
      "term": "According to the instructor, which of the following is the most important reason there is no such thing as a perfect solution?A. There are risks involved in finding solutions to organisational problems.B. Solutions always involve trade offs.C. Implementation process might be more complex and expensive than anticipated.D. Solutions need to be flexible and match changes in the environment.",
      "definition": "B. Solutions always involve trade offs."
    },
    {
      "term": "According to the instructor, which of the following is the most important reason why cultural change is so difficult?A. Top management defends organisational culture.B. Cultural values tend to define who people are.C. People treat culture to be obvious and normalD. Cultural change is impossible.",
      "definition": "B. Cultural values tend to define who people are."
    },
    {
      "term": "According to the instructor, which of the following less useful actions managers tend to fall back on when they try to improve their organisation?A. They either try to re-shuffle job positions or change incentive structures.B. Develop key capabilities that match organisational mission and vision.C. Develop organisational mission and visionD. Identify the key characteristics of the organization's culture and determine its strategic fit.",
      "definition": "A. They either try to re-shuffle job positions or change incentive structures."
    },
    {
      "term": "According to the instructor, which of the following options is a prerequisite for building self-managed teams?A. Assign a team leader or coordinator to the team.B. Every team member likes to share foodC. Every team member is about the same heightD. Team members have the required skills to complete the task",
      "definition": "D. Team members have the required skills to complete the task"
    },
    {
      "term": "According to the instructor, which of the following value chain activity is considered important for a consulting firm?A. ProcurementB. HRMC. Firm technologyD. Outbound logistics",
      "definition": "B. HRM"
    },
    {
      "term": "According to the instructor, why is culture difficult to identify in an organisation?A. Cultural change is often associated with the top management.B. Culture involves taken for granted values, norms and behaviourC. Cultural change is often outsourced to external experts.D. Cultural change involves systems, structures and processes.",
      "definition": "B. Culture involves taken for granted values, norms and behaviour"
    },
    {
      "term": "According to the MARS model, which of the following captures the three most important factors that work together to influence what we do and how well we do it?A. Ability to hold down a job, emotional stability, heightB. Motivation, ability, role perceptionsC. Realistic attitude, investigative mindset, artistic flourishD. Extroversion, sound eyesight, strong familial relationships",
      "definition": "B. Motivation, ability, role perceptions"
    },
    {
      "term": "According to the TED talk 'How can groups make good decisions', crowd sourced ideas do not work because of which of the following reasons? Choose all options that applyA. Perceptions and views can be easily influencedB. People are often scared of big crowdsC. Smalls groups consider the views of all groups membersD. It is easier to agree on simple facts rather than on social issues",
      "definition": "A. Perceptions and views can be easily influenced   C. Smalls groups consider the views of all groups members   D. It is easier to agree on simple facts rather than on social issues"
    },
    {
      "term": "According to the TED talk 'How can groups make good decisions', which groups were more likely to reach consensus?A. Those with members who were attending counselling sessionsB. Those with members who were confident of their extreme viewsC. Those with members who were categorized as high-confident grayD. Those with members who were good at recycling and looking after the environment",
      "definition": "C. Those with members who were categorized as high-confident gray"
    },
    {
      "term": "According to the TED talk 'How can groups make good decisions', which of the following is true about the process of arriving at the 'robust average'?A. Ignore those who are confident but have extreme viewsB. Ignore those who complainC. Ignore those who don't talk much at workD. Ignore those who work only on computers",
      "definition": "A. Ignore those who are confident but have extreme views"
    },
    {
      "term": "According to the TED talk 'The puzzle of motivation' , extrinsic (financial) rewards are not suitable for which of the following types of work?A. Projects that always require expensive heavy construction equipmentB. Narrowly specified goalsC. Projects involving computersD. Projects involving creative problem solving",
      "definition": "D. Projects involving creative problem solving"
    },
    {
      "term": "According to the video lecture, which of the following statements about alienation is correct?Check only one option:A. Alienation applies only to manual or factory workers. Office workers cannot suffer from alienationB. Managers cannot experience alienationC. Alienation stopped being an issue in the twentieth century as work conditions improvedD. Widespread alienation at work is not conducive to a stable society.",
      "definition": "D. Widespread alienation at work is not conducive to a stable society."
    },
    {
      "term": "Amer likes to work with other people. Amer's manager encourages him to talk to his colleagues about new ideas and innovations. Amer feels as though his colleagues respect his work contributions and he believes he is a valuable member of the team. What type of 'job crafting' has Amer's manager implemented in this example? Check only one option A. Cognitive craftingB. Relational craftingC. Collegial bondingD. Task conflict",
      "definition": "B. Relational crafting"
    },
    {
      "term": "As outlined by the instructor which of these options best describes the term 'framing'? Check only one optionA. Framing is a term you can use to describe when a computer's mainframe doesn't workB. Framing is the process of defining a purpose or a set of goals in a particular, meaningful wayC. Framing is the process of putting a window up at your houseD. Framing is a current moment of experience",
      "definition": "B. Framing is the process of defining a purpose or a set of goals in a particular, meaningful way"
    },
    {
      "term": "Based on the article 'The cult of compulsory happiness ruining our workplacesOpens in a new tab', employee happiness is important for which of the following work situations? Check only one option A. An accountantB. An oil rig workerC. A receptionist at a hotelD. A financial analyst",
      "definition": "C. A receptionist at a hotel"
    },
    {
      "term": "Beer companies systematically monitoring what the government is thinking and doing in relation to alcohol regulation as an important strategic contingency is an example of:A. A boundary systemB. A diagnostics systemC. An interactive systemD. A belief system",
      "definition": "C. An interactive system"
    },
    {
      "term": "Before leaders develop intercultural competence, they need to develop which of the following skills? Please choose the most correct answer. Check only one optionA. Cultural appropriation skillsB. Strong presentation skillsC. Strong reading and writing skillsD. Intercultural sensitivity skills",
      "definition": "D. Intercultural sensitivity skills"
    },
    {
      "term": "Billy was given a work task by his manager. In this task Billy was asked to sit at the front desk and wait to see if a visitor might come through the door. Billy didn't like to do this job and he thought the job was meaningless. From the options below why do you think Billy thought this job was meaningless? Check only one option A. Meaninglessness brought on by disconnecting someone from their parents' valuesB. Meaninglessness brought on by putting a person at risk of physical or emotional taskC. Meaninglessness brought on by treating someone unfairlyD. Meaninglessness brought on by pointless work",
      "definition": "D. Meaninglessness brought on by pointless work"
    },
    {
      "term": "Bringing together people with diverse backgrounds results in knowledge sharing. What is this statement an example of? Choose only one optionA. Categorical diversityB. BiodiversityC. Value in diversityD. Experimental diversity",
      "definition": "C. Value in diversity"
    },
    {
      "term": "Collaborative overload suggests that the highest value-adding people in the organisation are also the most: Check only one option A. DisengagedB. IronicC. Likely to be promoted to leadership positionsD. Giving",
      "definition": "A. Disengaged"
    },
    {
      "term": "Consumers may use brands for several benefits. Check all that apply.",
      "definition": "Consumers brand choice can enable them to be a part of a social group they feel they share identities | This will give them a sense of belonging | Brands may give customers a different experiential vibe. | Consumers use brands to better express the self | Consumers use brands to fill the gap between their actual personality and ideal personality."
    },
    {
      "term": "Consumers who use brands to improve their personality are? Check only one optionA. Explicit self theoristB. Implicit self theoristC. Entity theoristD. Incremental theorist",
      "definition": "C. Entity theorist"
    },
    {
      "term": "Decisiveness was rated highly among all cultures, but while decisiveness means fast and general decision-making in the U.S., the French and Germans take it to mean being considerate, slow, and precise in decision-making.' This statement best reflects which of the following about the intercultural dimension of leadership styles?A. The influence of cultural dimensions varies across organisations and community groupsB. Australian people think that being decisive is a negative attributeC. Masculinity is high in the US and low in France and GermanyD. The influence of leadership attributes varies due to cultural differences across contexts",
      "definition": "D. The influence of leadership attributes varies due to cultural differences across contexts"
    },
    {
      "term": "Disagreements are seen in a negative light due to what following reason? Choose only one optionA. They will adversely affect the environmentB. They may result in difficult relationshipsC. They will cause an organisation to become bankruptD. They may allow employees to challenge assumptions",
      "definition": "B. They may result in difficult relationships"
    },
    {
      "term": "Ethnocentricism is closest to which of the following statements hypothetically associated with a developed country MNE moving to a developing country where child labour is the norm?A. Let's understand why children are engaged in paid work in some countriesB. It is acceptable to engage children in paid work because of the local economic circumstancesC. It is up to the local managers to decide whether to engage children in paid workD. Children should not be engaged in paid work in developing countries.",
      "definition": "D. Children should not be engaged in paid work in developing countries."
    },
    {
      "term": "Female workers would less likely do their jobs effectively when they perceive that their work would not get due recognition from their gender discriminating male superiors. Which of the following relationships best generalise this scenario based on the MARS model?A. Behaviour is determined by motivation, which is further shaped by perceptions.B. Behaviour is determined by emotions, which is further shaped by perceptions.C. Behaviour is determined by skill, which is further shaped by perceptionsD. Behaviour is determined by ability, which is further shaped by perceptions.",
      "definition": "A. Behaviour is determined by motivation, which is further shaped by perceptions.   B. Behaviour is determined by emotions, which is further shaped by perceptions.   C. Behaviour is determined by skill, which is further shaped by perceptions   D. Behaviour is determined by ability, which is further shaped by perceptions."
    },
    {
      "term": "Fred Luthans talks about successful and effective leaders/managers. Which of these behaviours would successful managers excel at? Check all that apply A. Building political coalitionsB. Inspiring loyalty, hard work and enthusiasm in those they leadC. Developing good working relationships with people in positional powerD. Learning the written and unwritten rules of the organisational culture and where the power actually lies",
      "definition": "A. Building political coalitions   C. Developing good working relationships with people in positional power   D. Learning the written and unwritten rules of the organisational culture and where the power actually lies"
    },
    {
      "term": "From a leader's perspective, what are some of the most important messages implied in the two-factor theory? Check only one optionA. Teamwork can build motivating connectionsB. People are motivated when they have a friendly supervisorC. Recognition for meaningful work is as important as financial rewardD. Part-time work leads to increased motivation",
      "definition": "C. Recognition for meaningful work is as important as financial reward"
    },
    {
      "term": "General Mental Ability and integrity are the best way to predict future performance. How might this be applied to predictions of leadership ability?Check all that applyA. It doesn't test for extraversion, which is proven to be the best indicator of leadership. Therefore, it cannot predict who will be good leaders.B. It should be applicable as they were testing for white collar management positions which is covalent with leadership in the contemporary sense, so should thus have the same efficacyC. While it seems to have predictive validity, the concept of GMA is arguably too narrow to be applied to the demands of contemporary interdependent work practice and integrity often predicts compliance, which might not be a useful trait for a leader to have.D. While it might make sense, there is little established research linking GMA and integrity to effective leadership performance",
      "definition": "B. It should be applicable as they were testing for white collar management positions which is covalent with leadership in the contemporary sense, so should thus have the same efficacy   C. While it seems to have predictive validity, the concept of GMA is arguably too narrow to be applied to the demands of contemporary interdependent work practice and integrity often predicts compliance, which might not be a useful trait for a leader to have.   D. While it might make sense, there is little established research linking GMA and integrity to effective leadership performance"
    },
    {
      "term": "Research into performance predictability suggests that testing General Mental Ability and integrity are the best way to predict future performance. How might this be applied to predictions of leadership ability? Check all that apply A. It doesn't test for extraversion, which is proven to be the best indicator of leadership. Therefore, it cannot predict who will be good leaders.B. It should be applicable as they were testing for white collar management positions which is covalent with leadership in the contemporary sense, so should thus have the same efficacyC. While it seems to have predictive validity, the concept of GMA is arguably too narrow to be applied to the demands of contemporary interdependent work practice and integrity often predicts compliance, which might not be a useful trait for a leader to have.D. While it might make sense, there is little established research linking GMA and integrity to effective leadership performance",
      "definition": "B. It should be applicable as they were testing for white collar management positions which is covalent with leadership in the contemporary sense, so should thus have the same efficacy   C. While it seems to have predictive validity, the concept of GMA is arguably too narrow to be applied to the demands of contemporary interdependent work practice and integrity often predicts compliance, which might not be a useful trait for a leader to have.   D. While it might make sense, there is little established research linking GMA and integrity to effective leadership performance"
    },
    {
      "term": "Goals need to be intrinsically motivating for employees. Following the instructor's arguments, which of the following is an implication of this statement?A. Goals should be developed by the leaderB. Abstract or vague goals can be usefulC. Involve people in setting their own goalsD. Goals should be as difficult as possible",
      "definition": "C. Involve people in setting their own goals"
    },
    {
      "term": "Hamdi Ulukaya, the founder of Chobani yogurt brand, has implemented different strategies focusing on purposeful branding. Which of the following are among the strategies implemented at Chobani? Check all that apply.A. Shape culture around purposeB. Extending product line rangeC. Pursue purpose-focused collaborationsD. Encourage employee ownership",
      "definition": "A. Shape culture around purpose   C. Pursue purpose-focused collaborations   D. Encourage employee ownership"
    },
    {
      "term": "Having enough money for food and rent is an example of what need in Maslow's hierarchy? Choose only one option A. Poverty and homelessnessB. SocialC. Self-actualizationD. Physiological",
      "definition": "D. Physiological"
    },
    {
      "term": "Henry Mintzberg was the first person to empirically research the day-to-day activities undertaken by a CEO. What best defines his findings? Check only one optionA. CEOs have to perform a multiplicity of interdependent roles in fast-paced, fragmented, regularly interrupted environmentsB. High cognitive ability and deep integrityC. Although there were many CEOS, very few actually displayed the styles and qualities of leadership identified in academic literatureD. CEOs were special people who are able to strategically plan years into the future and deal with long-term time horizons despite short-term pressuresE. CEOs were the source of the organisational vision, entrusted with the provision of purpose, values and motivation in the workers",
      "definition": "A. CEOs have to perform a multiplicity of interdependent roles in fast-paced, fragmented, regularly interrupted environments"
    },
    {
      "term": "Hostile leadership can lead to what serious health outcomes in organisations?Check all that applyA. Higher rates of strokesB. Greater staff turnoverC. Higher rates of heart attacksD. Premature death through stress",
      "definition": "A. Higher rates of strokes   C. Higher rates of heart attacks   D. Premature death through stress"
    },
    {
      "term": "How can leaders minimise social loafing?A. By making employees cut up their own sandwichesB. By making work meaningful for their team membersC. By making employees recycle their soft plasticsD. By making employees go to meetings at a bakery",
      "definition": "B. By making work meaningful for their team members"
    },
    {
      "term": "How many leadership styles did the GLOBE project identify?A. 123B. 2C. 6D. 134",
      "definition": "C. 6"
    },
    {
      "term": "How might a Theory Z style leader respond the behaviour of an employee at the D2 or M2 level? Check all that apply A. With a degree of confusion. As such a manager assumes the employee values a working environment in which such things as family, cultures and traditions (which have not changed), why is there a drop in motivation and commitmentB. By questioning the employee's long-term employment. Is this evidence that now the employee has moved beyond the initial enthusiasm stage, they are actually the wrong fit for the company?C. By reclarifying that his or her interpretation of employees bing inherenty lazy and demotivated is correctD. To strive to increase the level of challenge for the employee as they recognise drops in motivation as a sign the employee is ready for more challenge or responsibility",
      "definition": "A. With a degree of confusion. As such a manager assumes the employee values a working environment in which such things as family, cultures and traditions (which have not changed), why is there a drop in motivation and commitment   B. By questioning the employee's long-term employment. Is this evidence that now the employee has moved beyond the initial enthusiasm stage, they are actually the wrong fit for the company?"
    },
    {
      "term": "How might we best define the practice of leadership? Check only one optionA. A contemplative, largely solitary, process of strategic decision-makingB. A high-powered focus on the meta-narrative of organisation and businessC. Performing a lot of fragmented and non-routine work at a heavy paceD. Something very different to administration and management",
      "definition": "C. Performing a lot of fragmented and non-routine work at a heavy pace"
    },
    {
      "term": "How might you gain in legitimate power? Check only one option A. Using punishment and withholding rewardsB. Increasing my management experience and building political relationshipsC. Gaining access to vital information and knowledge and control over its distributionD. Appealing to people's values and aspirations",
      "definition": "B. Increasing my management experience and building political relationships"
    },
    {
      "term": "If Boltanski and Chiapello's arguments about a new spirit of capitalism are correct, then... Check all options that applyA. Businesses will increasingly be using their ingunuity to solve climate change and other crises that we face.B. We might well see another 'new spirit' of capitalism again in coming decades, as developments such as artificial intelligence generate widespread job redundancies and a new crisis of legitimacyC. This shows just how easily we can change even deep seated meanings that other people hold in the workplaceD. You, as someone interested in a career in management or business, will already be thinking that the work that you do will be exciting, important and inspiring.",
      "definition": "B. We might well see another 'new spirit' of capitalism again in coming decades, as developments such as artificial intelligence generate widespread job redundancies and a new crisis of legitimacy   D. You, as someone interested in a career in management or business, will already be thinking that the work that you do will be exciting, important and inspiring."
    },
    {
      "term": "If the Pygmalion Effect is accurate, which leadership attitude becomes problematic?Check only one optionA. Theory Y as they will become so content at being treated well they'll lose the motivation to work hardB. Theory Z as people will become too attached to their teammates to focus on workC. Theory X, as treating people like they are lazy and dislike work will result in them becoming lazy, disliking work and performing less effectivelyD. Self-efficacy as people will stop believing in their capacity to do the tasks",
      "definition": "C. Theory X, as treating people like they are lazy and dislike work will result in them becoming lazy, disliking work and performing less effectively"
    },
    {
      "term": "If you had a colleague exhibiting counter-productive emotionality in the workplace, what could you do in response? Check only one optionA. Use EQ skills to understand and manage my own reactions to the emotionality and help the person better manage it him or herselfB. Confront them and tell them such emotional behaviours are letting the team down and failing to support my leadershipC. Tell the person to take an extended break from work to recoverD. Nothing - I have a task-orientated leadership style and such emotionality is indicative of somebody who is the wrong fit",
      "definition": "A. Use EQ skills to understand and manage my own reactions to the emotionality and help the person better manage it him or herself"
    },
    {
      "term": "If you were to design a perfect leader, what qualities would they have? Check only one optionA. High cognitive ability and deep integrityB. A high need for power, a moderate need for achievement and a low need for affiliationC. High extraversion, moderate agreeableness, openness to experience and conscientiousnessD. There are too many contradictory models of leadership qualities to be able to pursue such a task",
      "definition": "D. There are too many contradictory models of leadership qualities to be able to pursue such a task"
    },
    {
      "term": "Imagine you are a brand manager for a fast-food business with an unhealthy image. You've decided to launch a new brand positioning it as an organic and healthy option. You name the new brand \"Healganic\". Which brand name strategy has the manager applied? Check only one option A. AcronymB. FounderC. MetaphorD. Fabricated",
      "definition": "D. Fabricated"
    },
    {
      "term": "Imagine you are a manager and you are developing a position description for a new role at your organisation. You want your new employee to be a 'close fit' that aligns with your organisation's principles and work. As you develop your new position description which of the options below is an important consideration?Check only one optionA. Considering the congruence between work and the employee in terms of their attributes and valuesB. Considering the congruence between work and the employee in terms of their ability to care for the environmentC. Considering the congruence between work and the employee in terms of their ability to work late at night timeD. Considering the congruence between work and the employee in terms of their ability to undertake part-time work",
      "definition": "A. Considering the congruence between work and the employee in terms of their attributes and values"
    },
    {
      "term": "In designing a brand logo, which of the following are among the four typology of logo design? Check all options that applyA. Letter MarksB. Abstract MarksC. FounderD. Word Marks",
      "definition": "A. Letter Marks   B. Abstract Marks   D. Word Marks"
    },
    {
      "term": "In developing a brand vision framework, which of the following are important considerations? Check all options that applyA. Defining core brand vision elementsB. Select common and broad brand vision dimensionsC. Keep the brand vision aspirational and motivationalD. Identify a higher purpose as the overall theme for your brand vision",
      "definition": "A. Defining core brand vision elements   C. Keep the brand vision aspirational and motivational   D. Identify a higher purpose as the overall theme for your brand vision"
    },
    {
      "term": "In order to boost the engagement and conversation, a car manufacturer has used a beauty influencer to endorse its brand. Which of the following is the main challenge of such an endorsement?Check only one optionA. The level of fit between the brand and the endorserB. The integration of such partnership and endorsementC. The exclusivity of such partnership and endorsementD. The duration of such partnership and endorsement",
      "definition": "A. The level of fit between the brand and the endorser"
    },
    {
      "term": "In some cultures people tend to be secretive about their large financial gains lest their relatives turn up to ask for a financial favour. This scenario best matches which of the following cultural dimensions?A. Avoidance therapyB. MasculinityC. CollectivismD. Long term orientation",
      "definition": "C. Collectivism"
    },
    {
      "term": "In some cultures you need address older people as Sir or Ma'am. This best reflects which of the following.?A. Deferential styleB. AgeismC. Power distanceD. A family first culture",
      "definition": "C. Power distance"
    },
    {
      "term": "In the article 'The cult of compulsory happiness ruining our workplacesOpens in a new tab', which of the following intervention is suggested by the author to make employees happy? Check only one option A. Quickly respond to challenges through organisational change initiativesB. Allow workers uninterruptible time to focus on important tasksC. Pay attention to negative emotions and address their causesD. Create comfortable and creative office space",
      "definition": "B. Allow workers uninterruptible time to focus on important tasks"
    },
    {
      "term": "In the article 'The Secret to Building High-performance Teams', Which of the following is considered to be the best way to facilitate psychological safety?A. Have one on one conversations to create trustB. Ignore the problem and hope it fixes itselfC. Focus on getting away from work as quickly as possibleD. Psychological safety is not important",
      "definition": "A. Have one on one conversations to create trust"
    },
    {
      "term": "In the article 'The Secret to Building High-performance Teams', which of the following types of tasks are considered best done by an individual?A. Tasks that requires a person with no friends at work to completeB. Tasks requiring a range of expertise and knowledgeC. Tasks that require creativity and specialisted knowledgeD. Tasks that require multiple perspectives",
      "definition": "C. Tasks that require creativity and specialisted knowledge"
    },
    {
      "term": "In the example of Walmart, which of the following helped Walmart to repair its damaged reputation and regain consumers trust?A. Full page ads in more than 100 newspapers, depicting happy employees and customersB. Delivering on its core promise, delivering cheap variety productsC. Using its supply chain distribution channels, providing aids to victims of Hurricane KatrinaD. Walmart's CEO, giving interviews to all the major TV channels, bringing investors back to the company",
      "definition": "C. Using its supply chain distribution channels, providing aids to victims of Hurricane Katrina"
    },
    {
      "term": "In the lecture on team leadership, the instructor identifies which of the following as a key aspect of an industrial organisation?Check only one optionA. Industrial organisations followed a participative decision making model where anyone could play a leadership roleB. Employees with inherent leadership traits rise in the hierarchy to achieve leadership positions.C. Industrial organisations helped workers develop into leaders through mentoring and trainingD. There were rigid hierarchies of command and control power systems in industrial organisations",
      "definition": "D. There were rigid hierarchies of command and control power systems in industrial organisations"
    },
    {
      "term": "In the video 'the neuroscience of meaning making' the instructor discussed research from the aviation and advertising industry. What similar conclusions do both industries draw in regards to decision-making?Check only one optionA. People always make good decisions if there is a financial rewardB. People always make decisions entirely based off facts and statisticsC. People make emotional decisionsD. People make better decisions if they work in pairs",
      "definition": "C. People make emotional decisions"
    },
    {
      "term": "In the YouTube vide 'Dark Side of Japan: Karoshi (Death by Overwork)' what are some of the reasons given by Japanese workers for their extremely long work days?Check all that applyA. Holding back access to work that could be doneB. Taking extra long lunch breaksC. Stringing out the work dayD. Worrying about becoming pregnant",
      "definition": "A. Holding back access to work that could be done   C. Stringing out the work day   D. Worrying about becoming pregnant"
    },
    {
      "term": "In what way are the elements of an organisation comparable to the parts of a human body?A. They need to be attuned to each other for the whole to work effectivelyB. The whole is greater than the sum of its individual partsC. They are an instrument for achieving a particular objectiveD. Leaders control the organisation just like the brain controls the body",
      "definition": "A. They need to be attuned to each other for the whole to work effectively"
    },
    {
      "term": "Jennifer Aaker conceptualised brand personality proposed 5 categories of personalities. Which of the following represents those 5 categories?A. Sincerity, Excitement, Joker, Dreamer, and ruggednessB. Joker, Dreamer, Mother, Sexy, and AdventurousC. Adventurous, Rebellious, Desirable, Playful, and CreativeD. Sincerity, Excitement, Competence, Sophistication and Ruggedness",
      "definition": "D. Sincerity, Excitement, Competence, Sophistication and Ruggedness"
    },
    {
      "term": "Lan is an experienced brand manager, recently tasked to boost the organisation's brand meaning. Conducting market analysis, Lan has decided to form the organisation meaning around agility, activity, and being fast. Lan has several options in communicating such a meaning using brand elements, which of the following are among the most effective tactics that could be implemented: Check all options that apply A. Lan adopted a pictorial logo design, using a horse as the logoB. Lan used a tagline: \"born to run\".C. Lan adopted a Crocodile as the new brand character to communicate agility and being fastD. Lan used an italic font",
      "definition": "A. Lan adopted a pictorial logo design, using a horse as the logo   B. Lan used a tagline: \"born to run\".   D. Lan used an italic font"
    },
    {
      "term": "Lan is an experienced pilot in the Air Force. Lan was asked to fly a fighter jet towards a dangerous situation by her leader and she agreed to take on the mission. Often meaninglessness can happen at work when you put people at risk of physical or emotional harm. Why is Lan's situation not an example of meaninglessness at work? Check only one option A. Lan is an experienced pilot and probably won't get hurt while she is on her missionB. Lan doesn't think that this is unfair treatment by her leader and therefore thinks her work is meaningfulC. Lan may have the opportunity for part-time work if this mission is successfulD. Lan has made an informed choice and understands the risks associated with being a pilot in the Air Force",
      "definition": "D. Lan has made an informed choice and understands the risks associated with being a pilot in the Air Force"
    },
    {
      "term": "In the reading 'Purposeful leaders' are winning hearts and minds in workplaces, study findsOpens in a new tab' , Which of the following is an important aspect of purposeful leadership? Check only one option A. Establish a clear link between rules and organisational visionB. Balancing financial goals and social responsibilitiesC. A perfect match between leaders' and organisational valuesD. Have a strong commitment to stakeholders",
      "definition": "D. Have a strong commitment to stakeholders"
    },
    {
      "term": "Nespresso coffee is a premium coffee brand (www.nespresso.com). A consumer buys Nespresso coffee from Nespresso boutique stores because the consumer feels that she belongs to a club that offers accessible luxury coffee experience. This is an example of which of the following types of brand meaning benefits? Check all that apply.A. Social benefitsB. Self-expressive benefitsC. Functional benefitsD. Emotional benefits",
      "definition": "A. Social benefits   B. Self-expressive benefits   D. Emotional benefits"
    },
    {
      "term": "Phil is a brand manager in a medium size organisation in the FMCG sector. In launching a new brand of a soft drink, Phil has been focusing on promoting the features such as the ingredients, flavours, and the amount of caffeine. Which of the following benefits Phil has been focusing on?A. Self-expressive benefitsB. Social benefitsC. Functional benefitsD. Higher purpose values",
      "definition": "C. Functional benefits"
    },
    {
      "term": "Refer to Scenario 1Opens in a new tabHow could you use boundary systems to help address the plane maintenance issues? A. Incorporate safety as a central theme in the training that is offered to your maintenance staffB. Develop a system for systematically capturing and reporting near misses in order to be able to learn from themC. Incorporate \"safety\" in the company's value statementD. Specify strict maintenance procedures that are also explicit about what is not acceptable practice, and create a safety and compliance function at a senior level in the organisation that carries out regular safety and compliance checks.",
      "definition": "D. Specify strict maintenance procedures that are also explicit about what is not acceptable practice, and create a safety and compliance function at a senior level in the organisation that carries out regular safety and compliance checks."
    },
    {
      "term": "Refer to Scenario 1Opens in a new tab If the training school owned all of the training planes, what would be the best formula for monitoring and managing the cost effectiveness of your planes, assuming that maintenance costs and fuel costs cover all of your plane operating costs, and maintenance costs per plane are fixed? A. Total fuel costs per plane + Total maintenance costs per plane = Total operating costs per planeB. Total operating costs per planeC. Total fuel costs + Total maintenance costs = Total operating costsD. Average flight hours per plane per month x (monthly fuel costs per flight hour + monthly maintenance costs per flight hour) = Total operating costs per plane",
      "definition": "D. Average flight hours per plane per month x (monthly fuel costs per flight hour + monthly maintenance costs per flight hour) = Total operating costs per plane"
    },
    {
      "term": "Refer to Scenario 1Opens in a new tabWhat could help explain the tendency for instructors to rush students through to their exams, even when the student does not feel ready? A. Instructors are rewarded for the total number of graduations under their supervision each termB. Instructors are rewarded based on the percentage of their students that pass their exam, divided by the average number of teaching hours per studentC. Instructors are rewarded based on the number of students they get through the curriculum, divided by their total teaching hours in a term, regardless of whether the students pass their exam.D. None of the above",
      "definition": "C. Instructors are rewarded based on the number of students they get through the curriculum, divided by their total teaching hours in a term, regardless of whether the students pass their exam."
    },
    {
      "term": "Refer to Scenario 1Opens in a new tabWhat would be an example of a useful interactive system for this company? A. Regular reporting on any forthcoming changes to regulatory compliance criteriaB. Regular reporting on any forthcoming changes in visa procedures or criteria for flight school traineesC. Regular focus groups with prospective students to track whether there are change trends in their needs, expectations, and price sensitivity in relation to pilot trainingD. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "Refer to Scenario 1Opens in a new tab to answer question 2. By applying the information in the case to Lepak and Snell's strategic workforce segmentation framework, the role of personal trainers that will be reporting into the new Director of Training should be categorized as: A. \"Professional\", because the role is strategically central, but should be relatively easy to source in the labour marketB. \"Critical\", because this role is strategically central, and likely to be relatively difficult to source in the labour marketC. \"Specialist\", because the role is strategically not that central, but likely to be relatively difficult to source in the labour marketD. \"Doer\", because the role is strategically not that central, and should be relatively easy to source in the labour market",
      "definition": "A. \"Professional\", because the role is strategically central, but should be relatively easy to source in the labour market"
    },
    {
      "term": "Refer to Scenario 1Opens in a new tab to answer question 3. The new organisation structure does not leave any room for your former gym directors. Instead, you are going to employ receptionists who are there to open and close the gym, deal with new gym enrolments, client enquiries, and personal trainer bookings insofar as these are not arranged online. These receptionists need to be professional, service-minded, and organised. And finally, you have decided to hire a specialist in gym equipment, who will be in charge of procurement and maintenance of all gym equipment, making sure that your company is always in step with the latest trends, and that all equipment is safe and always in top working order.By applying the information in the case to Lepak and Snell's strategic workforce segmentation framework, the receptionist role should be categorized as a: A. \"Critical\" or \"Specialist\", depending on how strategically central you assess their role to be, which is difficult to determine given the case informationB. \"Critical\"C. \"Specialist\"D. \"Doer\" or \"Professional\", depending on how strategically central you assess their role to be, which is difficult to determine given the case information",
      "definition": "D. \"Doer\" or \"Professional\", depending on how strategically central you assess their role to be, which is difficult to determine given the case information"
    },
    {
      "term": "Refer to Scenario 1Opens in a new tab to answer question 4. By applying the information in the case to Lepak and Snell's strategic workforce segmentation framework, the role of Head of Gym Equipment should be categorized as a: A. \"Critical\", because this role is strategically central, and likely to be relatively difficult to source in the labour marketB. \"Professional\", because the role is strategically central, but should be relatively easy to source in the labour marketC. \"Doer\", because the role is strategically not that central, and should be relatively easy to source in the labour marketD. \"Specialist\", because the role is strategically not that central, but likely to be relatively difficult to source in the labour market",
      "definition": "D. \"Specialist\", because the role is strategically not that central, but likely to be relatively difficult to source in the labour market"
    },
    {
      "term": "Refer to Scenario 1Opens in a new tab to answer question 5. A best practice approach to HRM based on theory Y that emphasizes job security and empowerment is not necessarily best in this case because.... A. The best practice approach to HRM is not based on theory YB. We can't be sure whether this approach will be effective in Singapore, given that it is based on a theory that is North America-centricC. It won't be effective for the personal trainers due to the relative strategic centrality and uniqueness of this roleD. It won't be effective for the Head of Gym Equipment due to the relative strategic centrality and uniqueness of this role",
      "definition": "B. We can't be sure whether this approach will be effective in Singapore, given that it is based on a theory that is North America-centric"
    },
    {
      "term": "Refer to Scenario 1Opens in a new tab to answer question 6. Which of the following is correct? Given the strategic centrality and uniqueness of your new Director of Training ..... A. You should adjust your HR practices to the strategically critical nature of this role to ensure that you encourage commitmentB. You should treat this person better than some other people in your organisation to ensure that they will want to stayC. This role is more important than some other roles, like the receptionist role for exampleD. You should try and find a best practice HR approach that helps motivate them, as well as the rest of the people in your organization",
      "definition": "A. You should adjust your HR practices to the strategically critical nature of this role to ensure that you encourage commitment"
    },
    {
      "term": "DownloadScenarios - Week 5 Graded QuizOpens in a new tab to complete this quiz.Refer to Scenario 1Opens in a new tab to answer quiz questions 1 - 6 By applying the information in the case to Lepak and Snell's strategic workforce segmentation framework, the new Director of Training should be categorized as a: A. \"Doer\", because the role is strategically not that central, and should be relatively easy to source in the labour marketB. \"Specialist\", because the role is strategically not that central, but likely to be relatively difficult to source in the labour marketC. \"Professional\", because the role is strategically central, but should be relatively easy to source in the labour marketD. \"Critical\", because this role is strategically central, and likely to be relatively difficult to source in the labour market",
      "definition": "D. \"Critical\", because this role is strategically central, and likely to be relatively difficult to source in the labour market"
    },
    {
      "term": "DownloadScenarios - Week 3 Graded QuizOpens in a new tab to complete this quiz.Note: Refer to Scenario 1Opens in a new tab to answer quiz questions 1-3. Which structure should you seriously consider as an alternative to the current divisional structure by gym location? A. A divisional structure by customer segment.B. A matrix structure that leaves the current divisions intact and overlays it with centralised functions for procurement, training methods, finance, HR, and marketing.C. A functional structure - e.g. procurement, gym operations, training methods, HR, finance, marketing - that gets rid of the gym directorsD. None of the above",
      "definition": "C. A functional structure - e.g. procurement, gym operations, training methods, HR, finance, marketing - that gets rid of the gym directors"
    },
    {
      "term": "DownloadScenarios - Week 4 Graded QuizOpens in a new tab to complete this quizRefer to Scenario 1Opens in a new tab to answer quiz questions 1-5.Which of the following types of control systems would be most relevant for controlling the plane maintenance issues? A. Belief systems, Boundary systems, and Diagnostic systemsB. Belief and Boundary systemsC. Diagnostics systems and Interactive systemsD. Diagnostics systems and Belief systems",
      "definition": "B. Belief systems, Boundary systems, and Diagnostic systems"
    },
    {
      "term": "Refer to Scenario 1Opens in a new tab.What is the key trade-off that is in play in the above example? A. The trade-off between local responsiveness and efficiency that a decentralised divisional structure gives you on the one hand, and the increased coordination that a more centralised structure could give you on the otherB. The trade-off between local responsiveness and coordination that a decentralised divisional structure gives you on the one hand, and the increased efficiency that a more centralised structure could give you on the otherC. The trade-off between the local responsiveness that a decentralised divisional structure gives you on the one hand, and the increased efficiency and coordination that a more centralised structure could give you on the otherD. The trade-off between the local coordination and efficiency that a decentralised divisional structure gives you on the one hand, and the increased responsiveness that a more centralised structure could give you on the other",
      "definition": "C. The trade-off between the local responsiveness that a decentralised divisional structure gives you on the one hand, and the increased efficiency and coordination that a more centralised structure could give you on the other"
    },
    {
      "term": "Refer to Scenario 1Opens in a new tab.What would be a good, valid reason to stick to the existing structure? A. Localised profit and loss (P&amp;L) responsibility is importantB. Upon further research you find that customer needs are actually highly localised, because customers really appreciate the feeling that they are dealing with a local business that is run by a person they know, instead of some large, branded corporateC. You could try to increase coordination in training methods and procurement by introducing some dotted line support functions in these two areas that can advise and support the gym directorsD. Changing the structure will necessarily cause increased complexity",
      "definition": "B. Upon further research you find that customer needs are actually highly localised, because customers really appreciate the feeling that they are dealing with a local business that is run by a person they know, instead of some large, branded corporate"
    },
    {
      "term": "Refer to Scenario 2Opens in a new tab for quiz question 7.If you wanted to increase control over operations, what type of control system would be most important to upgrade in order to obtain the information you need to get a more detailed view of what is going on in each of your gyms? A. Diagnostic systemB. Belief systemC. Boundary systemD. Interactive system",
      "definition": "A. Diagnostic system"
    },
    {
      "term": "Refer to Scenario 2Opens in a new tab for quiz question 8.From a financial perspective, what would be the problem with just using net profit for each gym as a basis for comparing their performance? A. Net profit per gym may be significantly skewed by the relative size of each gym, making it look as if your larger gyms are performing better even though this may not be the caseB. Net profit does not tell you what profitability is as a percentage of revenue, which would be a better indicator of the relative financial performance of each gymC. Net profit as a number does not give you any indication of the cost and revenue drivers that lie behind it, which makes it difficult to control and influence performanceD. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "Refer to Scenario 2Opens in a new tab for quiz question 9. What would be a good example of a useful interactive system measure for this company? A. Revenue per m2 per month for each gymB. Customer satisfaction %C. An explicit limit on the maximum number of clients that can be accepted per gym, adjusted for gym sizeD. Systematically keeping track of the latest trends, methods, and equipment in the industry to try and predict what clients will need or expect in the near future",
      "definition": "D. Systematically keeping track of the latest trends, methods, and equipment in the industry to try and predict what clients will need or expect in the near future"
    },
    {
      "term": "Refer to Scenario 2Opens in a new tab for quiz question 10. If the financial incentives of your gym directors were directly tied to net profit of their gym, what would be some of the ways they could artificially bump up their number at the end of the financial year, especially if they think they are not going to be around the following year anyway? A. They could ask customers to pre-pay membership fees that actually apply to the following year for a discountB. They could indefinitely postpone replacing old equipment and gym upgrade investmentsC. They could artificially sign up members towards the end of the year and have them pre-pay membership fees, with a promise of cancelling their memberships and refunding their fees as soon as the new financial year startsD. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "Refer to Scenario 2Opens in a new tab for quiz questions 4-6. Which of the following organisation structures is most unlikely to be suitable for your organisation? A. A divisional structure by country with an overlay of dotted line teaching method support functions for each of the main subject areas that coordinate training and continued teaching method developmentB. A divisional structure by country with a centralized, global training center for training new teachers in the specific teaching method of their subject areaC. A global functional structure by teaching area, with local principals there for regulatory purposes, local coordination and adaptation, and directing local support functions, but with no direct hiring or supervisory responsibilities over the teaching staff who report into their global functionD. A matrix structure in which teachers report both to their local principal, as well as the global head of their particular subject area",
      "definition": "C. A global functional structure by teaching area, with local principals there for regulatory purposes, local coordination and adaptation, and directing local support functions, but with no direct hiring or supervisory responsibilities over the teaching staff who report into their global function"
    },
    {
      "term": "Refer to Scenario 2Opens in a new tab for quiz questions 6 - 10.How could you use control systems to help prevent client injury due to negligence, which could seriously damage your reputation? A. You could use the belief system to emphasize values like \"client well-being\" or \"client safety\", or \"safety\" more generally.B. You could use boundary systems to clearly specify the processes that every trainer needs to follow, including what practices are explicitly forbidden, and tie serious consequences to breaking these rulesC. You can use diagnostics measures not only to keep track of client injuries after they have occurred, but also begin to record and report \"near misses\", so you can learn from these before accidents occur.D. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "Refer to Scenario 2Opens in a new tab to answer question 8. By applying the information in the case to Lepak and Snell's strategic workforce segmentation framework, the role of teaching assistant should be categorized as: A. \"Professional\", because the role is strategically central, but should be relatively easy to source in the labour marketB. \"Critical\", because this role is strategically central, and likely to be relatively difficult to source in the labour marketC. \"Specialist\", because the role is strategically not that central, but likely to be relatively difficult to source in the labour marketD. \"Doer\", because the role is strategically not that central, and should be relatively easy to source in the labour market",
      "definition": "D. \"Doer\", because the role is strategically not that central, and should be relatively easy to source in the labour market"
    },
    {
      "term": "Refer to Scenario 2Opens in a new tab to answer question 9. Which of the following is false? When applying the information in the case to Lepak and Snell's strategic workforce segmentation framework ..... A. School Principals are more unique than Global teaching area headsB. Global teaching area heads are more unique than local teaching area headsC. Local teaching area heads are more strategically central than Deputy PrincipalsD. Both global and local teaching area heads should be classified as \"criticals\"",
      "definition": "A. School Principals are more unique than Global teaching area heads"
    },
    {
      "term": "Refer to Scenario 2Opens in a new tab to answer question 10. Which of the following statements is true for the level of pay you should be considering across the different roles in your organisation? A. The roles that are classified as \"critical\" should be the highest paidB. The roles that are classified as highest on uniqueness (specialists and criticals) should be the highest paidC. The roles that are classified as \"specialists\" should be paid more than \"professionals\"D. None of the above; pay level should not be determined based on the role classifications in the Lepak and Snell workforce segmentation framework",
      "definition": "D. None of the above; pay level should not be determined based on the role classifications in the Lepak and Snell workforce segmentation framework"
    },
    {
      "term": "Refer to Scenario 2Opens in a new tab to answer questions 7 - 10.By applying the information in the case to Lepak and Snell's strategic workforce segmentation framework, the Global Teaching Area Heads should be categorized as a: A. \"Professional\", because the role is strategically central, but should be relatively easy to source in the labour marketB. \"Specialist\", because the role is strategically not that central, but likely to be relatively difficult to source in the labour marketC. \"Doer\", because the role is strategically not that central, and should be relatively easy to source in the labour marketD. \"Critical\", because this role is strategically central, and likely to be relatively difficult to source in the labour market",
      "definition": "D. \"Critical\", because this role is strategically central, and likely to be relatively difficult to source in the labour market"
    },
    {
      "term": "Refer to Scenario 2Opens in a new tab. What are the conditions under which you could reasonably consider a matrix structure for this organisation? A. Global standardisation is actually most important for your strategy, but you do need some local adaptation, mainly for regulatory purposes.B. Both local responsiveness and global efficiency are really important for your strategy; and your teaching staff is capable of balancing the demands of reporting into two bossesC. Both local responsiveness and global standardisation of teaching methods are equally important for your strategy; efficiency is not a critical concern; and your teaching staff is capable of balancing the demands of reporting into two bossesD. Local responsiveness is actually most important but you would like to be able to coordinate the standardised teaching methods as well",
      "definition": "C. Both local responsiveness and global standardisation of teaching methods are equally important for your strategy; efficiency is not a critical concern; and your teaching staff is capable of balancing the demands of reporting into two bosses"
    },
    {
      "term": "Refer to Scenario 2Opens in a new tab. What is the key trade-off that is in play in the above example? A. The trade-off between local efficiency and global coordinationB. The trade-off between local coordination and global coordinationC. The trade-off between local responsiveness and global efficiencyD. The trade-off between local responsiveness and global coordination",
      "definition": "D. The trade-off between local responsiveness and global coordination"
    },
    {
      "term": "Refer to Scenario 3Opens in a new tab for quiz questions 7-8. Under what conditions would you reasonably consider a divisional structure by country with each country director responsible for their own Profit and Loss (P&L)? A. If each country requires a significant amount of adaptation to specific local needs, not just in your sales and marketing approach, but also in software developmentB. If efficiency is not of primary importance to your business strategyC. If the sales and marketing approach that is required in each country is highly country specificD. Never; a divisional structure by country simply is not suitable for this type of business",
      "definition": "A. If each country requires a significant amount of adaptation to specific local needs, not just in your sales and marketing approach, but also in software development"
    },
    {
      "term": "Refer to Scenario 3Opens in a new tab for quiz questions 7-8.With global expansion and additional product lines in mind, what is NOT a convincing reason for considering a functional structure in which sales and marketing is country and product specific, but everything else is centralised globally? A. This is the most responsive solutionB. This is the most efficient solutionC. This is the least complex solutionD. This enhances your ability to coordinate centrally",
      "definition": "A. This is the most responsive solution"
    },
    {
      "term": "Refer to Scenario 4Opens in a new tab for quiz questions 9-10.Under what conditions would you reasonably consider a divisional structure by product line, with each product-based Business Unit responsible for its own profit and loss (P&L)? A. Not all product lines are sold in every countryB. The different product lines are so distinct that they require their own specific development teams, manufacturing processes, and sales channelsC. The different product lines require their own specific sales channels because they are treated very differently by hospital procurement, but development and manufacturing of the different product lines is similarD. Never, a divisional structure by product line is simply not going to be suitable for this type of business",
      "definition": "B. The different product lines are so distinct that they require their own specific development teams, manufacturing processes, and sales channels"
    },
    {
      "term": "Refer to Scenario 4Opens in a new tab.Why is a divisional structure by country unlikely to be appropriate for this organisation? A. Because local product needs across different countries don't require any product adaptation, and efficiency is important to the business strategyB. Because each country requires its own customised sales approachC. Because the different country Business Units would be difficult to coordinateD. Because a matrix structure would be better",
      "definition": "A. Because local product needs across different countries don't require any product adaptation, and efficiency is important to the business strategy"
    },
    {
      "term": "Research finds that circular logos may convey different meanings compared to angular logos Check all options that applyA. Angular logo can signal durabilityB. Circular logo can convey comfortablenessC. Circular logo can convey softnessD. Angular logo can convey comfortableness",
      "definition": "A. Angular logo can signal durability   B. Circular logo can convey comfortableness   C. Circular logo can convey softness"
    },
    {
      "term": "Research shows that incomplete letter and word marks can be resulted in a different perception and meaning compared to a complete mark. Check all options that applyA. Incomplete marks can be resulted in perceptions of less trustworthy meaningB. Incomplete marks can be resulted in perceptions of more innovativeness meaningC. Incomplete marks can be resulted in perceptions of energetic meaningD. Incomplete marks can be resulted in perceptions of boring meaning",
      "definition": "A. Incomplete marks can be resulted in perceptions of less trustworthy meaning   B. Incomplete marks can be resulted in perceptions of more innovativeness meaning"
    },
    {
      "term": "Rosalinde Torres in her Tedx video 'What it takes to be a great leader'Opens in a new tab talks about the three things that are crucial for effective leadership. Which of the following is NOT one of those aspects?Check one option only A. Leaders do not become complacent about their successB. Leaders are not narrowly focused but gaze far and wide for useful insights.C. Leaders are not scared of disagreement and conflictD. Leaders quickly respond to important trends in their industry.",
      "definition": "D. Leaders quickly respond to important trends in their industry."
    },
    {
      "term": "Schweppes, the soft drink brand, which ran the campaign \"Dress to Respect\", is an example of a brand that focuses on which of the following options? Check all that apply.A. Extended featuresB. Motivational visionC. Functional benefitsD. Higher purpose values",
      "definition": "B. Motivational vision   D. Higher purpose values"
    },
    {
      "term": "Sometimes when people move overseas they experience a condition called 'culture shock'. What are some of the symptoms of 'culture shock' outlined by the industry expert in the video about 'Expatriation'?A. AnxietyB. DepressionC. HomesicknessD. Food poisoning",
      "definition": "A. Anxiety   B. Depression   C. Homesickness"
    },
    {
      "term": "Studies from social psychology tell us that metaphors and analogies are meaningful and persuasive because they: Check only one optionA. Make the works of William Shakespeare more interestingB. Remind us of our early childhoodC. Help build up a person's physical staminaD. Trigger a state of active thinking as the listener puzzles over the meaning and makes sense of it",
      "definition": "D. Trigger a state of active thinking as the listener puzzles over the meaning and makes sense of it"
    },
    {
      "term": "The \"substance\" of leadership, as opposed to leading by vision and style, is all about:A. Analysing the degree of organisational alignmentB. Defining your differentiating key capabilitiesC. Becoming a reactive firefighter who can solve whatever problem is in front of themD. Enabling the organisation to execute the business strategy through the effective configuration of culture, structure, systems, and people practices",
      "definition": "D. Enabling the organisation to execute the business strategy through the effective configuration of culture, structure, systems, and people practices"
    },
    {
      "term": "The article 'Talent management at multinational firms in China' considers which of the following Hofstede's dimensions as a significant hurdle to hiring and managing local Chinese talent?A. Power distanceB. Fashion and design stylesC. Multi-dimensional managementD. Musical preferences",
      "definition": "A. Power distance"
    },
    {
      "term": "The concept of contingent motivation, discussed in the TED talk 'The puzzle of motivation', best relates to which of the following concepts?A. ValenceB. DisappointmentC. Biased motivationD. Dysfunctional social circles",
      "definition": "A. Valence"
    },
    {
      "term": "The conceptualisation of culture is typically divided into the \"right culture\" for the organisational type, and strong cultures and weak cultures. Which of the following are behaviours most associated with the concept of strong culture? Check only one optionA. Active monitoring of the external environment for emerging opportunities and threats and adapting to them.B. Strong, mutually reinforcing exchanges and linkages between employees and departments.C. Passion for achievement, results oriented and goal-driven, and learning from mistakesD. Order, stability, status, and efficiency",
      "definition": "C. Passion for achievement, results oriented and goal-driven, and learning from mistakes"
    },
    {
      "term": "The GLOBE project focused on which of the following Hofstede's dimensions?A. MasculinityB. Long term orientationC. CollectivismD. Power distance",
      "definition": "C. Collectivism"
    },
    {
      "term": "The harmonica effect of recurring cycles from centralisation to decentralisation and back again is an effect of which key trade-off?A. Agreeableness vs ResponsivenessB. Responsiveness vs CoordinationC. Efficiency vs CoordinationD. None of the above",
      "definition": "B. Responsiveness vs Coordination"
    },
    {
      "term": "The instructor claims that symbols are important due to two main reasons. What are the reasons she outlines? Check all options that applyA. Symbols are important because they have an effect on our cognition (our thinking)B. Symbols are important because they have an effect on our affect (our feelings)C. Symbols are important because they will always improve our ability to give presentations at workD. Symbols are important because they will definitely help us to become better cooks at home",
      "definition": "A. Symbols are important because they have an effect on our cognition (our thinking)   B. Symbols are important because they have an effect on our affect (our feelings)"
    },
    {
      "term": "The instructor claims that when people have an affective or emotional response to one object or event, they tend to assign the same meaning and response to a surrounding or related theme. So if people are positive about a symbol, they will tend to be positive about the associated theme. Consider this statement. Rebecca is a leader with a proven record of accomplishments and she often uses symbols at work to effectively create meaning. What might best explain Rebecca's success? Check only one option A. Rebecca can draw symbols really well and this helps them to be more effectiveB. Rebecca has an accomplished leadership reputation and this helps her to use symbols effectivelyC. Rebecca knows that she can use symbols to manipulate and trick peopleD. Rebecca has been known to get really lucky with her choice of symbols and that's why people like them",
      "definition": "B. Rebecca has an accomplished leadership reputation and this helps her to use symbols effectively"
    },
    {
      "term": "The instructor identifies an example of baseball players who were paid lower than their cohort for three years had a lower batting average which picked up again once their wages returned to the equitable level. This example relates to which of the following theories?A. Equity theoryB. Expectancy theoryC. Disbelief theoryD. Maslow's theory on 'baseball culture and values'",
      "definition": "A. Equity theory"
    },
    {
      "term": "The instructor mentions a study at Apple that found that when teams had members who represented a target end-user, the entire team was more likely to understand that end-user. This study relates to which of the following benefits of diversity?A. Quick decision makingB. Improved organisational performanceC. Client diversityD. Job satisfaction",
      "definition": "C. Client diversity"
    },
    {
      "term": "The instructor mentions Nelson Mandela in which of the following contexts? Check only one optionA. During the times of organisational silence, leaders often reflect on their actions.B. Leadership needs to be seen in terms of the service role it performs in an organisationC. Leaders adapt to challenging situations when they are forced to confront pain.D. Leadership can emerge anywhere within a team",
      "definition": "D. Leadership can emerge anywhere within a team"
    },
    {
      "term": "The instructor narrates a story about President Kennedy who visited NASA in 1961 and he introduced himself to a janitor and asked him what he did - the janitor replied \"I am helping put a man on the moon!\". Which of the following elements of the Job Characteristics theory does this anecdote relate to? Choose all options that apply A. Task significanceB. AutonomyC. Task identityD. Part-time work",
      "definition": "A. Task significance"
    },
    {
      "term": "The instructor refers to a speech by President Obama and claims that there are a number of key elements present in his storytelling. What are they? Check all options that apply.A. The set-upB. The solutionC. The obstacleD. The villain",
      "definition": "A. The set-up   B. The solution   C. The obstacle"
    },
    {
      "term": "The instructor suggests using Porter's frameworks, when identifying key capabilities, for which of the following purposes?A. To use your business experience have a sense of what your business needs to be really good at to succeed with its strategy.B. To identify key capabilities that match organisational mission and strategic goals.C. To identify the typical key capabilities that are relevant to your organisation's industry.D. To go through the key value-adding activities in your organization in a systematic way.",
      "definition": "D. To go through the key value-adding activities in your organization in a systematic way."
    },
    {
      "term": "The interpersonal roles of leadership are used to: Check only one optionA. Accomplish objectives, perform rituals and interact with other teamsB. Gather, send and provide informationC. Authorise activities and handle negotiationsD. Innovate new products and take action during crisis",
      "definition": "A. Accomplish objectives, perform rituals and interact with other teams"
    },
    {
      "term": "The likelihood that our effort will achieve desired results is captured by which of the following concepts?A. Understanding financial balance sheetsB. ExpectancyC. HostilityD. Instrumentality",
      "definition": "B. Expectancy"
    },
    {
      "term": "The main principle of the best practice approach to HRM is ... A. To develop and reward your best peopleB. To offer employees greater job security so that they offer their ideas, hard work, and commitment in returnC. To help create an organisational climate that fosters employee competence and commitment through training and empowermentD. To make strategic distinctions between role types based on their strategic centrality and uniqueness",
      "definition": "C. To help create an organisational climate that fosters employee competence and commitment through training and empowerment"
    },
    {
      "term": "The main risk of linking KPIs to incentives is that:A. Your KPIs may not be linked to your business strategyB. Your KPIs may be inaccurateC. Your incentives may be ineffectiveD. People may manipulate the KPIs as an unintended consequence",
      "definition": "D. People may manipulate the KPIs as an unintended consequence"
    },
    {
      "term": "The operations process in the Porter's value chain framework is defined as_____________.A.The process of getting the finished goods to the customer.B. The activity of transforming raw materials into finished goods.C. The process of getting raw materials to operations.D. The production related processes in a manufacturing business.",
      "definition": "B. The activity of transforming raw materials into finished goods."
    },
    {
      "term": "The term Karl Marx used to refer to a systemic, structural meaninglessness of work within capitalist society was:Check only one optionA. EstrangementB. RedundancyC. AlienationD. Autonomy",
      "definition": "C. Alienation"
    },
    {
      "term": "Theories of motivation show that external (financial) rewards are less useful as a motivating factor. But the instructor has highlighted financial rewards to be important in which of the following situation?A. When making equity or fairness comparisons with other colleaguesB. When goals are too challenging.C. When self-efficacy is low and task complexity is highD. When supervisory relationships are poor",
      "definition": "A. When making equity or fairness comparisons with other colleagues"
    },
    {
      "term": "Values like affordability, customer service, quality and innovation belong to which level of brand vision?A. Such values are core valuesB. Such values are emotional valuesC. Such values are extended valuesD. Such values are higher-purpose values",
      "definition": "A. Such values are core values"
    },
    {
      "term": "Values should ideally fit with which of the following to increase the likelihood of job satisfaction? Choose all options that applyA. Whether you and your boss both like to play footballB. Job characteristicsC. Ability to get to work on timeD. Organisational culture",
      "definition": "B. Job characteristics   D. Organisational culture"
    },
    {
      "term": "We discussed several meanings that can be communicated via italic fonts, among them were:A. Not serious and funnyB. ActiveC. Fast, AgileD. Luxury and Exclusive",
      "definition": "B. Active   C. Fast, Agile   D. Luxury and Exclusive"
    },
    {
      "term": "We simplify our relationships and decision making processes by using which of the following? Check all options that applyA. Mental ModellingB. Social categorisation.C. StereotypingD. Market processing",
      "definition": "A. Mental Modelling   B. Social categorisation.   C. Stereotyping"
    },
    {
      "term": "What are the core functional roles of culture? Check only one optionA. To moderate expected behaviour and recognize and celebrate accomplishmentsB. To create internal unity and to adapt to the external environmentC. To help employees feel value and become creative and innovativeD. To ensure a quick response to change and a strategy-culture fit",
      "definition": "B. To create internal unity and to adapt to the external environment"
    },
    {
      "term": "What are the four dimensions of Emotional Intelligence?A. Self-awareness, social-awareness, self-managment, relationship managementB. Extraversion, openness to experience, agreeableness, conscientiousnessC. Assertiveness, desire to take charge, energetic determination, goal-driven hard-workD. Controlling others, competitiveness, confrontational behaviour, seeking status",
      "definition": "A. Self-awareness, social-awareness, self-managment, relationship management"
    },
    {
      "term": "What are the four types of control systems that Professor Robert Simons has defined?A. Enacted values, Organisational structure, Diagnostics systems, and Interactive systemsB. Tracking measures from four perspectives: shareholders, customers, internal, and innovation and learningC. Belief, Boundary, Diagnostics, and Interactive systemsD. The Balanced Scorecard, Boundary systems, Belief systems, and Information systems",
      "definition": "C. Belief, Boundary, Diagnostics, and Interactive systems"
    },
    {
      "term": "What are the key components of expectancy theory? Choose all options that applyA. ValanceB. InstrumentalityC. ExpectancyD. Self-absorption",
      "definition": "A. Valance   B. Instrumentality   C. Expectancy"
    },
    {
      "term": "What are the qualities of somebody who possesses \"socialized charisma\"? Check only one optionA. An egalitarian, self-transcendent, and empowering character who uses charisma for the benefit of others.B. A dominant, self-centered, self-aggrandizing and narcissistic character who uses charisma for self-glorificationC. The ability to imagine different and better conditions and the ways to achieve them.D. The ability to offer a transformative vision or ideal which exceeds the status quo and then convince followers to accept this course of action through their implicit belief in the extraordinary qualities of the person",
      "definition": "A. An egalitarian, self-transcendent, and empowering character who uses charisma for the benefit of others."
    },
    {
      "term": "What assumption underpins Vertical-Dyad Theory and LMX? Check only one option A. Followers will try to project a favorable image to gain an immediate benefit or improve a long-term relationship with the leader.B. That relationships between the leader and followers better predicts follower outcomes than leadership traits of behavioursC. It engenders discretionary behaviour and high levels of organisational citizenship.D. That there will always be in-groups and out-groups in teams and leaders must learn how to treat them differently",
      "definition": "B. That relationships between the leader and followers better predicts follower outcomes than leadership traits of behaviours"
    },
    {
      "term": "What best characterises the femininity dimension of culture? Check only one optionA. A concern for maintaining personal happiness and for living for the present.B. An emphasis on assertiveness and a competitive drive for money and material objects.C. An emphasis on developing and nurturing personal relationships and a high quality of lifeD. A state of mind wherein the values and goals of the group - whether extended family, ethnic group, company, or community - are primary.",
      "definition": "C. An emphasis on developing and nurturing personal relationships and a high quality of life"
    },
    {
      "term": "What best defines adaptive leadership? Check only one optionA. The skill, temperament, and motives that some people have and some people don't.B. Leadership means taking the responsibility for direction, protection and orderC. Leadership means influencing the community to follow the leader's visionD. Leadership means influencing the community to face its problems.",
      "definition": "D. Leadership means influencing the community to face its problems."
    },
    {
      "term": "What best defines people with a high Need for Achievement? Check only one optionA. They seek close relationships, desire to be like others, enjoy social activities and seek to belongB. They like influencing others and seek positions of authorityC. They are reluctant to play the bad-guy roleD. They are goal oriented, take moderate risks, desire concrete feedback and work hard",
      "definition": "D. They are goal oriented, take moderate risks, desire concrete feedback and work hard"
    },
    {
      "term": "What conceptual and practical challenges are there in employing the situational leadership model? Check all that apply A. Reframing leadership from a hard and natural skillset to a soft and performative skillsetB. A possible loss of trust: can we read who the leader really is if his or her behaviours are constantly changing in reaction to the situationC. It's far to clumsy and complex to be used effectively in practiceD. Given the rapidly changing nature and increasing complexity of work, how well can any leader actually perform the leadership styles as they might not have the tehcnical knowhow to judge their employee's level or coach them to improve",
      "definition": "A. Reframing leadership from a hard and natural skillset to a soft and performative skillset   D. Given the rapidly changing nature and increasing complexity of work, how well can any leader actually perform the leadership styles as they might not have the tehcnical knowhow to judge their employee's level or coach them to improve"
    },
    {
      "term": "What course of action does the instructor prescribe in order to define the critical issues facing an organisation?A. Use a 4 step model to diagnose the problems underlying the issue faced by your organisation.B. Assess whether there is a capability gap to address.C. Evaluate the degree of alignment between the key capabilities and the four elements of the organization.D. Cluster related problems together, so that you can reduce the main problem areas down to a maximum of about three.",
      "definition": "A. Use a 4 step model to diagnose the problems underlying the issue faced by your organisation."
    },
    {
      "term": "What do organisations constantly identify as being the number one communicative skill lacking in graduates? Check only one option A. ListeningB. Oral communicationC. WritingD. Inability to deal with criticism",
      "definition": "A. Listening"
    },
    {
      "term": "What is \"cognitive flexibility\"? Check only one option A. Combining ideas/data from different domains to generate a novel concept/directionB. The objective analysis and evaluation of an issue in order to form a judgement.C. A presentation of self meant to match audience expectations and preferencesD. The ability to see a single problem from multiple perspectives",
      "definition": "D. The ability to see a single problem from multiple perspectives"
    },
    {
      "term": "What is \"power to\"? Check only one optionA. A relationship in which one person has power over another personB. A traditional relationship in the sense that dominance and coercion are used time and again before other alternatives are sought.C. The capacity, ability and willingness to actD. The practice of creating an alliance between those with apparent formal power, and those with less or no formal power",
      "definition": "C. The capacity, ability and willingness to act"
    },
    {
      "term": "What is important to note about the M2 or D2 follower level in the Situational Leadership model? Check only one option A. The challenge has become too difficult for the person's skillset, so the person experiences anxietyB. The challenge has become too easy for the person's skillset, meaning the person experiences boredomC. An improvement in capability is matched by a decrease in motivation.D. The challenge is at the right level for the person's skillset and is increasing their developmental capacity at the right pace",
      "definition": "C. An improvement in capability is matched by a decrease in motivation."
    },
    {
      "term": "What is it about authentic leadership that is most challenging to those trying to capture, theorise and predict good leadership? Check only one optionA. It proves that leaders don't need to be formally trained or developed to become great leaders. Leadership thus has a natural quality that isn't something that can be learned.B. The evidence suggest it is far more effective than all other theories, making them somewhat redundantC. The authenticity that informs the leadership practice seems to come from highly personal and uniquely individual experiences, meaning there is no way it can be codified.D. It is more to do with highly biased storytelling from the leader themselves than evidence-based research",
      "definition": "C. The authenticity that informs the leadership practice seems to come from highly personal and uniquely individual experiences, meaning there is no way it can be codified."
    },
    {
      "term": "What is organisational alignment?A. Aligning the organisational elements - people, structure, culture, systems - with the key capabilities required for the business strategyB. Aligning the organisational elements - people, structure, culture, systems - with the business strategyC. Aligning your strategy with the external environmentD. Aligning your key capabilities with your business strategy",
      "definition": "A. Aligning the organisational elements - people, structure, culture, systems - with the key capabilities required for the business strategy"
    },
    {
      "term": "What is the best way for identifying key capabilities?A. Using your business senseB. Using Michael Porter's conceptual frameworkC. The checklist methodD. Triangulation of all of the above",
      "definition": "D. Triangulation of all of the above"
    },
    {
      "term": "What is the Dark Triad?A. Three extremes of personality (psychopathy, narcissism and Machiavellianism)B. Derailing traits of a leader (hostility, tension, rigidity)C. Derailing traits of a leader (tension, need for control, competitivenessD. Something 20% of corporate leaders have",
      "definition": "A. Three extremes of personality (psychopathy, narcissism and Machiavellianism)"
    },
    {
      "term": "What is the main criticism of contingency leadership theories? Check only one optionA. They try to force fit incompatible ideas togetherB. They are outdated and old-fashionedC. While they seem good in theory or in the lab, they are complex or unworkable in practiceD. They rely on an overly subjective judgment on employee or follower behaviours",
      "definition": "C. While they seem good in theory or in the lab, they are complex or unworkable in practice"
    },
    {
      "term": "What is the perceived problem with the \"pragmatic follower\"? Check only one option A. They don't get involved.B. They often feel cheated when producing exemplary workC. They tend to be the \"yes people\"D. Their behavior can be viewed as \"playing political games\".Incorrect",
      "definition": "D. Their behavior can be viewed as \"playing political games\"."
    },
    {
      "term": "What is work avoidance in the adaptive leadership model? Check only one optionA. Holding onto past assumptions, blaming authority, scapegoating, and externalizing the enemyB. When people resist the pain, anxiety, or conflict that accompanies a sustained interaction with a probelmatic situation and the changes it demandsC. The loss of critical thought produced by habitual deference to dominanceD. The inclination of naturally lazy workers to resist or escape from hard work",
      "definition": "B. When people resist the pain, anxiety, or conflict that accompanies a sustained interaction with a probelmatic situation and the changes it demands"
    },
    {
      "term": "What makes teams different from groups?A. Teams are only made up of a small number of peopleB. Team members influence each otherC. Team members always wear uniforms to workD. Teams are conscious of shared goals",
      "definition": "D. Teams are conscious of shared goals"
    },
    {
      "term": "What practices best define informal backstage leadership? Check only one option A. Political awareness, power to, political savvyB. Networking, reciprocity, coalition buildingC. Loyalty, honesty, getting recognition for achievementsD. Thinking and acting differently from the norm, a breadth of social connections and knowledge, collaborative generosity",
      "definition": "D. Thinking and acting differently from the norm, a breadth of social connections and knowledge, collaborative generosity"
    },
    {
      "term": "What problems are there with the concept of authentic leadership? Check all that applyA. There is deep confusion between the psychological and philosophical interpretations of authenticityB. There seems to be a gap in the self-description of authentic leaders and how those who worked with them recognise that descriptionC. The research paper that \"statistically proves its efficacy\" has been criticised for deliberately misrepresenting evidence and for being mathematically incoherent.D. There is no method for measuring any aspect of authenticity",
      "definition": "A. There is deep confusion between the psychological and philosophical interpretations of authenticity   B. There seems to be a gap in the self-description of authentic leaders and how those who worked with them recognise that description   C. The research paper that \"statistically proves its efficacy\" has been criticised for deliberately misrepresenting evidence and for being mathematically incoherent."
    },
    {
      "term": "What three personality profiles constitute the 'Dark Triad'?Check all that applyA. PsychopathB. NarcissistC. MachiavellianD. Toxicity",
      "definition": "A. Psychopath   B. Narcissist   C. Machiavellian"
    },
    {
      "term": "What types of leadership does behavioural research ultimately support? Check all that applyA. It doesn't support any single leadership style, suggesting there is no one best leadership style in all situationsB. Democratic, people-centered, consideration and concern for peopleC. Autocratic, job-centred, initiating structures and concern for productionD. Co-leadership, in which one leader is production-oriented and one is people-oriented",
      "definition": "A. It doesn't support any single leadership style, suggesting there is no one best leadership style in all situations   D. Co-leadership, in which one leader is production-oriented and one is people-oriented"
    },
    {
      "term": "What was the goal of contingency theories of leadership? Check only one option A. To illustrate how effective leadership styles vary greatly from place to place.B. To \"fit together\" the components of all the pre-existing theories, including the capability and motivation of followers, the personality traits, behaviours and experience of leaders, and the task, structure and environment of the situation.C. To illustrate how messy and fragmented management and leadership was in practiceD. To illustrate how effective leaders need multicultural backgrounds and experiences.",
      "definition": "B. To \"fit together\" the components of all the pre-existing theories, including the capability and motivation of followers, the personality traits, behaviours and experience of leaders, and the task, structure and environment of the situation.  "
    },
    {
      "term": "When day-to-day activities are meaningful for organizational members, what are they able to better deal with at work? Check all options that applyA. Finding the meaning of lifeB. Low wagesC. Challenging tasksD. Dirty and stigmatized work",
      "definition": "B. Low wages   C. Challenging tasks   D. Dirty and stigmatized work"
    },
    {
      "term": "When is meaningful feedback most effective? Check only one optionA. When it occurs a long time after the work is completed.B. When it comes directly from the work itself, such as a satisfied customerC. When it is generic and does not link directly to the employee's workD. When it is delivered by an angry manager",
      "definition": "B. When it comes directly from the work itself, such as a satisfied customer"
    },
    {
      "term": "When you want to structure a cost conscious organisation that offers a service that centrally involves specialists who are expensive to train, and who can't be trained across multiple specialisations, which of the following is the most logical structure to use? A. Network with flexible organic reporting linesB. Functional by specialisationC. Matrix by specialisation and customer segmentD. Divisional by customer segment",
      "definition": "B. Functional by specialisation"
    },
    {
      "term": "Which behaviours are best associated with transformational leadership? Check only one optionA. Idealized influence, inspirational motivation, individual consideration, intellectual stimulationB. Making a case for change, presenting a shared vision, leading the transformation, institutionalising the changeC. Service to others over self-interest, earning and keeping others' trust, effective listening, helping others discover their inner spiritD. Great communication skills, self-confidence and moral conviction, ability to inspire trust, high risk orientation",
      "definition": "A. Idealized influence, inspirational motivation, individual consideration, intellectual stimulation"
    },
    {
      "term": "Which best defines the bureaucratic cultural form? Check only one optionA. A leadership belief in strong, mutually reinforcing exchanges and linkages between employees and departments.B. A leadership belief in active monitoring of the external environment for emerging opportunities and threats and adapting to them.C. A leadership mind-set that encourages and values a highly competitive work environment.D. A leadership mind-set that values order, stability, status, and efficiency.",
      "definition": "D. A leadership mind-set that values order, stability, status, and efficiency."
    },
    {
      "term": "Which dimension of authentic leadership is reflected in Bridgewater's methodology of critiquing ideas in a formalised and consistent manner? Check all that applyA. Balanced processing: it ensures the leader gets a cognitively diverse and often challenging set of ideas and interpretations before making a decision to act, meaning they are forced to reflect on personal biasesB. Internalized moral perspective: it ensures the leader's behaviours are consistent with his or her valuesC. Self-awareness; it helps the leader reflect on his or her own feelings and thoughtsD. Relational transparency: because the leader is being critiqued and asked questions, it helps him develop a better understanding of his or her authentic self",
      "definition": "A. Balanced processing: it ensures the leader gets a cognitively diverse and often challenging set of ideas and interpretations before making a decision to act, meaning they are forced to reflect on personal biases   D. Relational transparency: because the leader is being critiqued and asked questions, it helps him develop a better understanding of his or her authentic self"
    },
    {
      "term": "Which of the following affects work behavior? Choose all options that applyA. Perceptions about the role being performedB. Perceptions about the role being performed affects work behaviorEmotions associated with workC. Emotions associated with work affects work behavior Expectations of others at work D. Stress experienced at work",
      "definition": "A. Perceptions about the role being performed   B. Perceptions about the role being performed affects work behavior   C. Emotions associated with work affects work behavior   D. Stress experienced at work Expectations of others at work "
    },
    {
      "term": "Which of the following answers is incorrect? Prioritization and focus requires courage from a leader because .....A. Without it the leader and the organisation both lose strategic focus, making it more difficult to execute the strategyB. Focusing on the decisions that really matter involves the risk of getting it wrong; as a leader you need to be prepared to accept such calculated risk.C. Prioritization and focus regularly involve telling people \"Perhaps, but not now\", making it seem as if their problems aren't worth addressing.D. It's often easier to keep doing what you're doing, trying to solve all of the problems that come your way, instead of making the big, difficult choices",
      "definition": "A. Without it the leader and the organisation both lose strategic focus, making it more difficult to execute the strategy"
    },
    {
      "term": "Which of the following are among the benefits of having higher purpose values? Check all that apply",
      "definition": "Over the long-term it also reduces costs. | Consumers also will be proud of supporting such organizations | It will enable employees to show a greater level of commitment | Employees will be more committed to organisations that care about the society and community | Employees will be proud of working for the organization"
    },
    {
      "term": "Which of the following are among the considerations in crafting brand tagline/slogan?Check all options that applyA. ProvocativeB. CompetitiveC. Imperative and MotivationalD. Not stimulating",
      "definition": "A. Provocative   B. Competitive   C. Imperative and Motivational"
    },
    {
      "term": "Which of the following are among the key strategies Lyft (the ride sharing brand) implemented to distinguish itself from competitors? Check all that apply.A. Focusing on building a more environmentally and socially responsible businessB. Building consumer goodwill through being a brand activistC. Positioning the itself based on mission-based valuesD. Positioning itself as a red car service",
      "definition": "A. Focusing on building a more environmentally and socially responsible business   B. Building consumer goodwill through being a brand activist   C. Positioning the itself based on mission-based values"
    },
    {
      "term": "Which of the following are among the options to choose a brand name? Check all options that applyA. FabricatedB. MetaphorC. Creative SpellingD. Pictorial Mark",
      "definition": "A. Fabricated   B. Metaphor   C. Creative Spelling"
    },
    {
      "term": "Which of the following are characteristics of organisational culture?A. It is difficult to change because it is difficult to identifyB. It is only reflected in rituals and routines, stories, and symbolsC. It is difficult to identify because most of culture resides underneath the surface level of behaviourD. It is difficult to change because people become identified with an organisational culture and can resist culture change as a result",
      "definition": "A. It is difficult to change because it is difficult to identify  C. It is difficult to identify because most of culture resides underneath the surface level of behaviour  D. It is difficult to change because people become identified with an organisational culture and can resist culture change as a result"
    },
    {
      "term": "Which of the following are the basic elements of an organisation, as discussed by the instructor?A. Structure, systems, culture, people practicesB. Strategic advantage, capabilities. competencies, strengthC. Finance, administration, human resource, supply chainD. Value chain, management, operations, customer service",
      "definition": "A. Structure, systems, culture, people practices"
    },
    {
      "term": "Which of the following are the key contributions of building brand personality and meaning? Check all that applyA. Brand personality provides energyB. Brand personality dilutes brand meaningC. Brand personality guides brand-building programsD. Brand personality represents and communicates benefits",
      "definition": "A. Brand personality provides energy   C. Brand personality guides brand-building programs   D. Brand personality represents and communicates benefits"
    },
    {
      "term": "Which of the following are the myths that the instructor identifies in the video: Levers of cultural change? (Select all that apply)A. Cultural change involves systems, structures, and processes.B. Whatever RE-flects the culture of an organisation can also be used to AF-fect it.C. Culture involves both the soft aspects of an organisation.D. Culture change can therefore be delegated or outsourced to specialists.",
      "definition": "A. Cultural change involves systems, structures, and processes.   C. Culture involves both the soft aspects of an organisation.   D. Culture change can therefore be delegated or outsourced to specialists."
    },
    {
      "term": "Which of the following are the reasons that make key capabilies so important? Choose all that apply.A. They help focus the organisation on what it needs to be really good at to succeed with its strategy.B. They can help organisations choose its long term vision and mission.C. They can form the basis of sustainable competitive advantage.D. They help focus leaders by enabling them to prioritize what issues are most important.",
      "definition": "A. They help focus the organisation on what it needs to be really good at to succeed with its strategy.   C. They can form the basis of sustainable competitive advantage.   D. They help focus leaders by enabling them to prioritize what issues are most important."
    },
    {
      "term": "Which of the following best captures a key element of business strategy?A. To commit to making operational improvementsB. Use customer relationship management more effectivelyC. To become the top company in the industryD. What customer segments you are targeting",
      "definition": "D. What customer segments you are targeting"
    },
    {
      "term": "Which of the following best captures the main purpose of the MARS model? Check all that applyA. To understand the sources and factors behind individual behaviour.B. To identify different personalty dimensions and related behavioursC. To analyse the fit between personality dimensions and job requirementsD. To identify how the expectations of others affect work related behaviour",
      "definition": "A. To understand the sources and factors behind individual behaviour.   D. To identify how the expectations of others affect work related behaviour"
    },
    {
      "term": "Which of the following best describes market culture?A. Focused on outsourcing business processes to external partners.B. Externally focused on competitive achievement and will pursue this through very effective systems and processes.C. Internally focused and ensures that processes and procedures are strictly followed.D. Watching the moves of competitors very carefully so as to devise strategies.",
      "definition": "B. Externally focused on competitive achievement and will pursue this through very effective systems and processes."
    },
    {
      "term": "Which of the following best describes the adhocracy culture?A. Internally focused compliance with processes.B. Competitive achievement and efficient processes.C. Innovation, creativity and risk taking.D. Loyalty and feeling part of a family.",
      "definition": "C. Innovation, creativity and risk taking."
    },
    {
      "term": "Which of the following best describes the logo design of brands like Apple, Lacoste, and TwitterCheck only one optionA. Word MarksB. Pictorial DesignC. Letter MarksD. Abstract Design",
      "definition": "B. Pictorial Design"
    },
    {
      "term": "Which of the following best describes the logo design of brands like Unilever, Westinghouse, and TeslaCheck only one optionA. Abstract DesignB. Letter MarksC. Word MarksD. Pictorial Design",
      "definition": "B. Letter Marks"
    },
    {
      "term": "Which of the following best describes the phrase 'process losses'? Check only one option A. When a food processing company loses moneyB. When team members do not share goalsC. Teams taking additional time to complete tasks due to the processD. When a team member loses their staff identification",
      "definition": "C. Teams taking additional time to complete tasks due to the process"
    },
    {
      "term": "Which of the following best describes the phrase 'vision trap'? Check only one optionA. When an employee can't see what they are doing at workB. When there is a disconnect between the tasks that employees do and the bigger organizational purposeC. When an employee does not complete the task given to them by their managerD. When a manager doesn't see a dangerous situation at work and an employee gets hurt",
      "definition": "B. When there is a disconnect between the tasks that employees do and the bigger organizational purpose"
    },
    {
      "term": "Which of the following best reflect 'openness to experience', which is a key dimension under the OCEAN model of personality?A. How imaginative, curious, flexible, and sensitive we areB. How caring, cooperative and trusting we areC. How tall, attractive, good at sport and intelligent we areD. How careful, artistic, angry and anxious we are",
      "definition": "A. How imaginative, curious, flexible, and sensitive we are"
    },
    {
      "term": "Which of the following best reflects our tendency to ignore information that is contrary to our beliefs and values?A. Profound IgnoranceB. Selective hearingC. Confirmation biasD. Fake news",
      "definition": "C. Confirmation bias"
    },
    {
      "term": "Which of the following best relates to a solution to the diversity problem identified in the Tedtalk on diversity by Arwa Mahdawi under the topic 'explore cultural intelligence'? Check only one optionA. Change in city demographics do not match employee diversityB. Companies hire ethnically diverse people because of tokenismC. Superficial focus on diversity is harmful to those who are discriminated againstD. Discrimination is often at a subconscious level",
      "definition": "D. Discrimination is often at a subconscious level"
    },
    {
      "term": "Which of the following best relates to the main conclusion drawn by the instructor about the prevalence of psychopathic behaviours?Check only one optionA. Everyone is capable of exhibiting some of the pyschopathic behaviours in some contextsB. We can look at the bad behavior of a leader through the lens of the dark triadC. Only a small number people exhibit some psychopathic behaviours in some contextsD. Psychopathic behaviour is only observed in serial killers.",
      "definition": "A. Everyone is capable of exhibiting some of the pyschopathic behaviours in some contexts"
    },
    {
      "term": "Which of the following brand elements is/are not a visual element? Check only one optionA. TypefaceB. Tagline/SloganC. CharacterD. Logo",
      "definition": "B. Tagline/Slogan"
    },
    {
      "term": "Which of the following can help improve team coordination? Check all options that applyA. The expertise of team members is knownB. Teams have common resourcesC. When every team member wears a clean uniformD. When social loafing is low.",
      "definition": "A. The expertise of team members is known   B. Teams have common resources   D. When social loafing is low."
    },
    {
      "term": "Which of the following combination of values best reflects the ideal values in an organisation?A. Monetary valuesB. Home cooked valuesC. Espoused and aspirational valuesD. Business values",
      "definition": "C. Espoused and aspirational values"
    },
    {
      "term": "Which of the following concepts is the answer to the riddle: \"Those who live it, ..... understand it, ....... but can't see it, ..... and those who don't live it, ....... can see it, ....... but can't understand it? A. CultureB. StructureC. SystemsD. Strategy",
      "definition": "A. Culture"
    },
    {
      "term": "Which of the following could be considered a limitation of the Two Factor Theory?A. Challenging goals affect motivation of employees.B. Absence of dissatisfiers can make people unhappy if not present but do not affect motivation when presentC. Something can be a dissatisfier or a motivator, based on our perceptionD. Dissatisfiers are difficult to change",
      "definition": "C. Something can be a dissatisfier or a motivator, based on our perception"
    },
    {
      "term": "Which of the following could be considered the most significant weakness of Hofstede's model of cultural dimensions?A. Hofstede did not consider how many people lived in a countryB. Hofstede did not consider the variation in culture inside countriesC. Hofstede did not consider the carbon footprint a country may have and will have in the futureD. Hofstede did not consider the impact of globalisation on cultural dimensions",
      "definition": "B. Hofstede did not consider the variation in culture inside countries"
    },
    {
      "term": "Which of the following describe a component of categorical diversity? Check all options that applyA. Professional expertise and world viewB. Being a member of a professionC. Having a diverse record collectionD. The number of years worked in different positions",
      "definition": "A. Professional expertise and world view   B. Being a member of a profession   D. The number of years worked in different positions"
    },
    {
      "term": "Which of the following do you need to be mindful of, when using the 4 step model to define critical issues facing your organisation?A. Identify the key capability gap.B. Develop concrete solutions to the critical problem areas.C. Don't forget about the importance of existing key capabilities.D. Assess the degree of alignment between the different elements of the organization and the key capabilities.",
      "definition": "C. Don't forget about the importance of existing key capabilities."
    },
    {
      "term": "Which of the following DOES NOT relate to the trade off risks?A. You give up the benefits of an organizational option that you are not choosing.B. you can't have a hierarchical culture and an innovative adhocracy culture at the same time.C. The implementation process might be more complex and expensive than anticipated.D. If you move from a divisional structure to a functional structure you may gain on efficiencies, but you may lose some responsiveness.",
      "definition": "C. The implementation process might be more complex and expensive than anticipated."
    },
    {
      "term": "Which of the following effects are associated with transformational leadership? Check all that applyA. Improved organizational performance, culture, and learning.B. Improved follower organizational commitment.C. Improved creativity and decision qualityD. Improved critical thinking and cogntive flexibility",
      "definition": "A. Improved organizational performance, culture, and learning.   B. Improved follower organizational commitment.   C. Improved creativity and decision quality"
    },
    {
      "term": "Which of the following GLOBE Study dimensions relates best to the Hofstede's dimension of Masculinity?A. IndividualismB. AssertivenessC. Muscular body typesD. Humane Orientation",
      "definition": "B. Assertiveness"
    },
    {
      "term": "Which of the following Hofstede's dimensions relates to the way a society approaches hierarchies?A. Uncertainty avoidanceB. MasculinityC. Power distanceD. Collectivism",
      "definition": "C. Power distance"
    },
    {
      "term": "Which of the following ideas are covered in the article 'How cultural factors affect leadership'? Select all options that applyA. Leaders have the power to tackle climate change and reduce global warmingB. Understanding of leadership varies from culture to cultureC. There are universally acknowledged leadership traitsD. Charismatic leadership traits are controversial",
      "definition": "B. Understanding of leadership varies from culture to culture   C. There are universally acknowledged leadership traits   D. Charismatic leadership traits are controversial"
    },
    {
      "term": "Which of the following is a myth around the use of the Porter's value chain framework?A. This framework helps us zoom in on those activity groups that add the most value.B. It's only appropriate for analyzing manufacturing firms.C. For service firms inbound or outbound logistics may not be very important.D. It's often misapplied and applied for its own sake.",
      "definition": "B. It's only appropriate for analyzing manufacturing firms."
    },
    {
      "term": "Which of the following is a risk associated with strategy execution?A. Implementation riskB. Market riskC. Trade off riskD. Flexibility risk",
      "definition": "A. Implementation risk  C. Trade off risk  D. Flexibility risk"
    },
    {
      "term": "Which of the following is an approach to conflict that involves giving up something in return for gaining some benefits?A. CompromisingB. Team workC. AvoidingD. Inheriting",
      "definition": "A. Compromising"
    },
    {
      "term": "Which of the following is an assumption of the adaptive leadership model? Check only one optionA. Organisational life may include silence and restlessnessB. Problems are embedded in complex and interactive systemsC. Leaders have authority if they are assigned authority by peopleD. Dissonance is required for reaching a harmonious state",
      "definition": "B. Problems are embedded in complex and interactive systems"
    },
    {
      "term": "Which of the following is an example of a trade-off risk?A. Loss of responsiveness if you decide to move from a divisional to a functional structureB. Loss of employee loyalty and commitment if you decide to move from a clan culture to a market cultureC. Staff complaints when you decide to focus your HR development budget exclusively on your most critical roles, instead of the current practice of offering training opportunities to everyone in the organisationD. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "Which of the following is considered to be the the most important factor in team design ?A. Team nameB. Team heightC. Team member characteristicsD. Team interdependence",
      "definition": "C. Team member characteristics"
    },
    {
      "term": "Which of the following is NOT a reason why key capabilities are important?A. Key capabilities are key to realising sustainable competitive advantage because they can be difficult to copyB. Key capabilities help focus the leadership teamC. Key capabilities are the things the organisation needs to be really good at to deliver on its business strategyD. Key capabilities can help focus the whole organisation by clearly indicating what the organisation needs to be really good at to succeed",
      "definition": "C. Key capabilities are the things the organisation needs to be really good at to deliver on its business strategy"
    },
    {
      "term": "Which of the following is NOT a solution suggested by Arwa Mahdawi in her Tedx talk? Check only one optionA. Organise corporate trainings and awareness seminarsB. Use humour to convey diversity messagesC. Take small actions to bring large scale changesD. Take steps to reduce unconscious bias",
      "definition": "A. Organise corporate trainings and awareness seminars"
    },
    {
      "term": "Which of the following is NOT one of the four key steps for ensuring that your management reports are linked to your strategy?A. What is our vision and what are our strategic objectives in relation to this vision?B. If we succeed in our vision, how will we be differentiated from our competition from a number of different perspectives?C. What are the Critical Success Factors for strategic success from each of the perspectives?D. What are the critical measures that enable us to track and influence the Key Performance Indicators (KPIs)?",
      "definition": "D. What are the critical measures that enable us to track and influence the Key Performance Indicators (KPIs)?"
    },
    {
      "term": "Which of the following is NOT one of the four steps involved in moving from a misalignment diagnosis of each of the organisational elements to deciding what organisational changes are required:A. Develop concrete solutions to all of the misalignment issues you have identified using your diagnostic toolsB. Assess the degree of alignment between the different elements of the organisation and the required key capabilitiesC. Cluster the most important misalignment issues into a small number of critical underlying problemsD. Identify the key capability gap",
      "definition": "A. Develop concrete solutions to all of the misalignment issues you have identified using your diagnostic tools"
    },
    {
      "term": "Which of the following is NOT one of the key problems that have emerged around HRM?A. The general empowerment focus in HRM that is based on McGregor's theory Y tends to be North American-centricB. The rhetorical promise of HRM tends to be quite different from the actual reality of HRMC. A universal HRM approach that focuses on maximising the development potential of every employee can become disconnected from business strategyD. HRM has generally failed to secure a seat at the top management table",
      "definition": "D. HRM has generally failed to secure a seat at the top management table"
    },
    {
      "term": "Which of the following is not one of the main reasons why organisational culture is important:A. Organisational culture can be a source of competitive advantageB. Organisational culture can be an obstacle to organisational agilityC. Organisational culture can help prevent unethical behaviour and corporate scandalsD. Organisational culture eats strategy for breakfast",
      "definition": "D. Organisational culture eats strategy for breakfast"
    },
    {
      "term": "Which of the following is the motivation of going beyond functional benefits in building meaningful brands?A. Creating meaning based on functional benefits is often ineffectiveB. Customers are rational in their product decisions.C. Customer want quality products at low prices.D. Consumer choice of a brand is based on emotional associations",
      "definition": "D. Consumer choice of a brand is based on emotional associations"
    },
    {
      "term": "Which of the following is the underlying source of conflict? Choose the most correct option. Choose only one optionA. Supervisory relationshipsB. Generational differencesC. PerceptionsD. Bad people engaging in unethical behavior",
      "definition": "C. Perceptions"
    },
    {
      "term": "Which of the following options include the four dimensions of authentic leadership?Check only one optionA. Vision, charisma, external locus of control, heroism, commitmentB. External locus of control, heroism, relational transparency, self awarenessC. Internalised moral perspective, balanced processing, heroism, commitmentD. Internalised moral perspective, balanced processing, relational transparency, self awareness",
      "definition": ""
    },
    {
      "term": "Which of the following options include the four dimensions of authentic leadership? Check only one optionA. Vision, charisma, external locus of control, heroism, commitmentB. External locus of control, heroism, relational transparency, self awarenessC. Internalised moral perspective, balanced processing, heroism, commitmentD. Internalised moral perspective, balanced processing, relational transparency, self awareness",
      "definition": "D. Internalised moral perspective, balanced processing, relational transparency, self awareness"
    },
    {
      "term": "Which of the following represent capabilities of an alchemist? Check only one optionA. Places value on organisational adaptability, attentive to unique market niches,B. Focus on long-term goals. Future is envisioned as vivid and inspiring;C. Interested in own and others' unique self-expression; seeks independent, creative workD. Attentive to own action, and deeply concerned with multi-faceted perspectives on a given situation or problem",
      "definition": "D. Attentive to own action, and deeply concerned with multi-faceted perspectives on a given situation or problem"
    },
    {
      "term": "Which of the following represents our basic convictions about preferred ways of doing things or preferred outcomes?A. EmotionsB. AngerC. ValuesD. Apathy",
      "definition": "C. Values"
    },
    {
      "term": "Which of the following stages in the model of culture shock adjustment discussed under the topic of expatriation correspond to a situation where expatriates experience overwhelming emotions and become infatuated with the language, people and food in their new surroundings?A. The 'self-actualized' stageB. The cultural appreciation stageC. The honeymoon stageD. The infatuation stage",
      "definition": "C. The honeymoon stage"
    },
    {
      "term": "Which of the following statements about the matrix structure is true?A. The matrix structure is generally preferable over other structure types because it can help you coordinate the organisation along multiple dimensions at the same timeB. When you have a functional structure that is too silo-ed, it is a good idea to use a matrix structure to improve coordination across the functional silosC. Matrix structures are oriented at coordination along multiple dimensions, such as geography and product line, for exampleD. The matrix structure is not necessarily more complex and costly than the divisional structure",
      "definition": "C. Matrix structures are oriented at coordination along multiple dimensions, such as geography and product line, for example"
    },
    {
      "term": "Which of the following statements can be inferred from Weber's concept of the spirit of capitalism?Check all options that applyA. Past religious ideas may have formed our deeply held views regarding business todayB. The meaning that work has for people in society can predate their lives and concious awarenessC. If I feel guilty not working when I am supposed to be working, this may be an indication of Weber's spirit of capitalism.D. For Weber, business and religion are very similar practices",
      "definition": "A. Past religious ideas may have formed our deeply held views regarding business today   B. The meaning that work has for people in society can predate their lives and concious awareness   C. If I feel guilty not working when I am supposed to be working, this may be an indication of Weber's spirit of capitalism."
    },
    {
      "term": "Which of the following statements is false?A. \"Specialists\" need to be retained because of their high strategic centralityB. \"Criticals\" are characterized by high strategic centrality and a significant amount of firm-specific knowledge that is difficult to source in the labour marketC. \"Doers\" may be outsourced because the strategic centrality of these roles is relatively low, and they are relatively easy to source in the labour marketD. \"Professionals\" are strategically critical but their jobs are characterized by knowledge that is relatively easy to source in the labour market",
      "definition": "A. \"Specialists\" need to be retained because of their high strategic centrality"
    },
    {
      "term": "Which of the following statements is false?A. A hierarchy culture is generally inferior to the other culture types because it is closely associated with bureaucracyB. A market culture is externally oriented and focused on stability and controlC. A clan culture is the diagonal opposite of a market cultureD. An adhocracy culture is the diagonal opposite of a hierarchy culture",
      "definition": "A. A hierarchy culture is generally inferior to the other culture types because it is closely associated with bureaucracy"
    },
    {
      "term": "Which of the following statements is generally true?A. Once you have zoomed in on a particular organisational element as the most important source of a critical misalignment issue, you don't need to bother with recommending changes to any of the other elementsB. Once you have defined your most critical organisational problems and have developed solutions for them, implementation should be relatively straightforwardC. It is a good idea not to make the risks associated with your organisational recommendations explicit, because this could weaken the strength of your recommendationsD. Prioritization and focus takes leadership courage because it requires making difficult trade-off decisions that involve risk",
      "definition": "D. Prioritization and focus takes leadership courage because it requires making difficult trade-off decisions that involve risk"
    },
    {
      "term": "Which of the following statements is true:A. According to McGregor's Theory Y, employees are not intrinsically motivated to work, and have a tendency to avoid their responsibilities if given the chance.B. When you subscribe to Theory Y, your management style is likely to be more participative and focused on empowering your employees to unlock their creative potential and stimulate their commitment to work.C. According to McGregor's Theory X, employees are intrinsically motivated to do a good job because they're looking for a sense of self-fulfillment or self-actualisation through their work.D. When you subscribe to Theory X, your management style is likely to be more participative and focused on empowering your employees to unlock their creative potential and stimulate their commitment to work.",
      "definition": "B. When you subscribe to Theory Y, your management style is likely to be more participative and focused on empowering your employees to unlock their creative potential and stimulate their commitment to work."
    },
    {
      "term": "Which of the following statements is true?A. All control related issues can be resolved most effectively through the use of ITB. All control systems are IT systems in the sense that control systems are a sub-set of IT systemsC. The managerial relevance of IT systems usually comes down to just one thing: \"control\", either performance control or risk controlD. All IT systems are control systems in the sense that IT systems are a sub-set of control systems",
      "definition": "C. The managerial relevance of IT systems usually comes down to just one thing: \"control\", either performance control or risk control"
    },
    {
      "term": "Which of the following statements is true?A. Trade-off risks can generally be mitigated by finding ways to preserve some of the benefits of the option that you are moving away fromB. Implementation risks can generally be mitigated by developing an effective change management approachC. Flexibility risks can generally be mitigated by building some flexibility into the organisation through encouraging a change-ready mindset throughoutD. All of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "Which of the following statements is true?A. You should always embark on culture change when you find that a different type of culture offers unique benefitsB. Your organisational culture can be identified as fitting exclusively in one of the four culture types: clan, adhocracy, market, and hierarchyC. You should only consider culture change if the behaviours that your existing culture encourages are misaligned with the key capabilities your business strategy requiresD. It is impossible to combine the benefits of different culture types",
      "definition": "C. You should only consider culture change if the behaviours that your existing culture encourages are misaligned with the key capabilities your business strategy requires"
    },
    {
      "term": "Which of the following strategies used by a manager is likely to overcome a self-fulfilling prophecy?A. Display confidence in employee's competence.B. Using different sources of information to make decisionsC. Challenge first impressionsD. Be aware of assumptions made in judging people and situations",
      "definition": "A. Display confidence in employee's competence.   B. Using different sources of information to make decisions   C. Challenge first impressions   D. Be aware of assumptions made in judging people and situations"
    },
    {
      "term": "Which of the following types of interdependence means that workers need to work on the task simultaneously?A. Reciprocal interdependenceB. Pooled interdependenceC. Super interdependenceD. Dependent and needy workers",
      "definition": "A. Reciprocal interdependence"
    },
    {
      "term": "Which of the following types of values are explicitly advocated by leaders?A. Military valuesB. Monetary valuesC. Liberal valuesD. Espoused values",
      "definition": "D. Espoused values"
    },
    {
      "term": "Which of the following was highlighted as a derailer for the low level leadership stage of the opportunist? Check only one optionA. views rules as loss of freedom; views luck as central; rejects critical feedbackB. Face-saving essential; loyalty to immediate group; feels shame if violates normC. Aware of and tempted by the dark side of powerD. Perfectionist; chooses efficiency over effectiveness; dogmatic",
      "definition": "A. views rules as loss of freedom; views luck as central; rejects critical feedback"
    },
    {
      "term": "Which of the following would help promote cultural adjustment of an expatriate employee? Choose all options that applyA. High tolerance for ambiguityB. Sound cultural appropriation skillsC. Long honeymoon stageD. Small cultural distance",
      "definition": "A. High tolerance for ambiguity   C. Long honeymoon stage   D. Small cultural distance"
    },
    {
      "term": "Which of these are variables to consider in the Path-Goal model? Check all that apply A. Extent employees defer to others.B. The size of the organization is considered and the time needed for participation.C. Extent employees believe they control goal achievement (internal) or it is controlled by others (external).D. Extent of employees' ability to perform tasks and achieve goals.",
      "definition": "A. Extent employees defer to others.   C. Extent employees believe they control goal achievement (internal) or it is controlled by others (external).   D. Extent of employees' ability to perform tasks and achieve goals."
    },
    {
      "term": "Which of these best describes the term 'social identity'? Check only one optionA. How a person talks differently is social situations when they are with their friends than with their familyB. How a person decides what clothes they should wear when they are with their friendsC. How a person communicates in social settings such as going to a football game or out clubbingD. How a person defines themselves in terms of a social group and our emotional attachment to that group",
      "definition": "D. How a person defines themselves in terms of a social group and our emotional attachment to that group"
    },
    {
      "term": "Which of these best explains Fiedler's Contingency Leadership model? Check only one option A. It has 4 styles (directing, coaching, supporting, delegating) determined by 4 variables (development level or degree of maturity)B. It has 7 styles (from autocratic to participative) determined by 3 variables (boss, subordinate and situation)C. It has 2 styles (task or relationship-oriented) determined by 3 variables (leader-member relationship, task structure, and position power)D. It has 4 styles (directive, supportive, participative, achievement-orientated) determined by 6 variables (Authoritarianism, Locus of Control, Ability, Task Structure, Formal Authority, Work Group)",
      "definition": "C. It has 2 styles (task or relationship-oriented) determined by 3 variables (leader-member relationship, task structure, and position power)"
    },
    {
      "term": "Which of these describes a charismatic leader? Check all that applyA. A leader who seeks to maintain stability within an organization through regular economic and social exchanges that achieve specific goals for both the leaders and their followers.B. A leader who offers a transformative vision or ideal which exceeds the status quo and then convinces followers to accept this course of action not because of its rational likelihood of success, but because of their implicit belief in the extraordinary qualities of the leader.C. A leader who possesses a dominant, self-centered, self-aggrandizing and narcissistic personality who uses charisma for self-glorification.D. A leader with an egalitarian, self-transcendent, and empowering personality who uses charisma for the benefit of others.",
      "definition": "B. A leader who offers a transformative vision or ideal which exceeds the status quo and then convinces followers to accept this course of action not because of its rational likelihood of success, but because of their implicit belief in the extraordinary qualities of the leader.   C. A leader who possesses a dominant, self-centered, self-aggrandizing and narcissistic personality who uses charisma for self-glorification.   D. A leader with an egalitarian, self-transcendent, and empowering personality who uses charisma for the benefit of others."
    },
    {
      "term": "Which of these leadership styles shows a high concern for people? Check only one optionA. Laissez-faireB. Country clubC. Initiating structureD. Middle-of-the-road",
      "definition": "B. Country club"
    },
    {
      "term": "Which of these options best describes the drive to comprehend? Choose only one optionA. Our motivation to satisfy our curiosity, to know and understand ourselves, and our environmentB. Our motivation to protect ourselves physically, psychologically, and sociallyC. Our motivation to interact with other people at workD. Our motivations to seek and retain objects and personal experiences",
      "definition": "A. Our motivation to satisfy our curiosity, to know and understand ourselves, and our environment"
    },
    {
      "term": "Which of these options describes positive aspects of the 'contact hypothesis' as outlined by the instructor? Choose all options that apply A. The 'contact hypothesis' theorizes that interaction changes the way people think, moving them from seeing people in terms of categories to seeing them as individuals.B. The contact hypothesis theorizes that contact between two organisations will ensure that they will no longer compete with one anotherC. The contact hypothesis theorizes that working together on a shared project will reduce the prejudice and bias between two groupsD. The 'contact hypothesis' theorizes that contacting and connecting with family and friends will reduce depression and anxiety",
      "definition": "A. The 'contact hypothesis' theorizes that interaction changes the way people think, moving them from seeing people in terms of categories to seeing them as individuals.   C. The contact hypothesis theorizes that working together on a shared project will reduce the prejudice and bias between two groups"
    },
    {
      "term": "Which one of the following is classified as a primary activity in a value chain?A. Marketing and salesB. ProcurementC. Technology implementationD. Firm Infrastructure",
      "definition": "A. Marketing and sales"
    },
    {
      "term": "Which one of the following is classified as a secondary activity in a value chain?A. Outbound logisticsB. HRMC. OperationsD. Inbound logistics",
      "definition": "B. HRM"
    },
    {
      "term": "Which one of the following is the best approach to conflict?A. YieldingB. CollaborationC. ConfusingD. Forcing",
      "definition": "B. Collaboration"
    },
    {
      "term": "Which one of the following is the most common approach to conflict?A. YieldingB. AvoidingC. CompromisingD. Forcing",
      "definition": "B. Avoiding"
    },
    {
      "term": "Which personality trait most correlates with leadership? Check only one optionA. None doB. ExtraversionC. Openness to ExperienceD. Concientiousness",
      "definition": "A. None do"
    },
    {
      "term": "Which stage of the team building process is usually marked by collaborative and trusting interaction among the team?A. PerformingB. NormingC. StormingD. Forming",
      "definition": "A. Performing"
    },
    {
      "term": "Which statement is false?A. Organisational structure decisions often become politicised, which makes it more difficult to implement the most effective oneB. Organisation structure is the most effective lever for ensuring that the organisation is aligned with the required key capabilitiesC. One of the key limitations of organisational structure is that just because you re-draw the boxes on an org chart does not necessarily mean that people's behaviours change to fitD. One of the key difficulties with deciding on an organisation structure is that it involves trade-off decisions that are inevitable",
      "definition": "B. Organisation structure is the most effective lever for ensuring that the organisation is aligned with the required key capabilities"
    },
    {
      "term": "While working on a project, a manager encourages one of their employees to utilize multiple skills to complete a task. What job characteristic has the manager used to create meaningful work for their employee? Check only one optionA. Conflict avoidanceB. AutonomyC. Skill varietyD. Part-time work",
      "definition": "C. Skill variety"
    },
    {
      "term": "Why can it be difficult to pursue Evidence-Based Leadership? Check all that applyA. Leadership is the natural preserve of great people, not something that can be taught or developedB. Research evidence is not the central focus of study for many business students, MBAs, or executive education programsC. Businesses are characterized by the belief that the particulars of their organization are special and uniqueD. It can threaten managers' personal freedom to run their organizations as they see fit.",
      "definition": "B. Research evidence is not the central focus of study for many business students, MBAs, or executive education programs   C. Businesses are characterized by the belief that the particulars of their organization are special and unique   D. It can threaten managers' personal freedom to run their organizations as they see fit."
    },
    {
      "term": "Why can organisational culture be an important source of competitive advantage?A. Because organisational culture is difficult to identifyB. Because organisational culture can be difficult to changeC. Because it is difficult to copy which makes it more sustainable as a potential source of advantageD. Because culture can make an organisation less agile",
      "definition": "C. Because it is difficult to copy which makes it more sustainable as a potential source of advantage"
    },
    {
      "term": "Why do so many extroverts seem to get into leadership positions? Check all that applyA. It's a trait culturally celebrated in the USA and American theorists have long dominated the leadership fieldB. It's associated with assertiveness, self-confidence and high energy, all of which seem \"obvious\" leadership traits at lay levels.C. Because extroversion was the trait that most seemed to correlate with leadership (i.e.many leaders studied possessed it) in the first scientific studies of the subjectD. They are scientifically proven to be good leaders",
      "definition": "A. It's a trait culturally celebrated in the USA and American theorists have long dominated the leadership field   B. It's associated with assertiveness, self-confidence and high energy, all of which seem \"obvious\" leadership traits at lay levels.   C. Because extroversion was the trait that most seemed to correlate with leadership (i.e.many leaders studied possessed it) in the first scientific studies of the subject"
    },
    {
      "term": "Why do we engage in a homogenisation process? Choose all options that applyA. To define ourselves comparativelyB. To categorise ourselves and othersC. To process a large quantity of informationD. To engage in self fulfilling prophecies",
      "definition": "A. To define ourselves comparatively   B. To categorise ourselves and others   C. To process a large quantity of information"
    },
    {
      "term": "Why does Jeffrey Pfeffer find authentic leadership to be problematic? Check all that applyA. CEO pay has skyrocket since the 1970s, meaning there is a major gap between their and worker compensationB. The theory is prescriptive and has many call to actions rather than evidence-basedC. Lying is endemic and rarely sanctioned in many organisationsD. There is good evidence that great leaders continually remake themselves and might thus be inauthentic",
      "definition": "B. The theory is prescriptive and has many call to actions rather than evidence-based   D. There is good evidence that great leaders continually remake themselves and might thus be inauthentic"
    },
    {
      "term": "Why is it important for leaders to enable a broader social-connectedness between employees in the workplace? Check all that apply A. People with friends at work tend to be happier and more productiveB. Psychological wellbeing is at risk, as is cognitive performance, if people can't socialise at workC. People with broad organisational knowledge that people like collaborating with seem to add the most valueD. The act of socialising with other people on a regular basis is increasingly being seen as necessary for maintaining and increasing the information highways within the brain. It helps people think better.",
      "definition": "B. Psychological wellbeing is at risk, as is cognitive performance, if people can't socialise at work   C. People with broad organisational knowledge that people like collaborating with seem to add the most value   D. The act of socialising with other people on a regular basis is increasingly being seen as necessary for maintaining and increasing the information highways within the brain. It helps people think better."
    },
    {
      "term": "Why is leadership \"more than commonsense' ?Check all that applyA. It often leads to a distorted picture of reality, in which leaders are heroes guiding lesser mortals through the travails of organisational strategy and executionB. The common sense view of leadership tends over-emphasise charisma, willpower and a clear and rational thought processC. Most of the long-term ideas about leadership have scientifically been proven to be wrongD. It can result in passivity in followers - an interpretation of a world in which some are born to lead and others born to follow",
      "definition": "A. It often leads to a distorted picture of reality, in which leaders are heroes guiding lesser mortals through the travails of organisational strategy and execution   B. The common sense view of leadership tends over-emphasise charisma, willpower and a clear and rational thought process   D. It can result in passivity in followers - an interpretation of a world in which some are born to lead and others born to follow"
    },
    {
      "term": "Why is social-connectedness important to a leader? Check all that apply A. It reduces the need for coercive powerB. Research suggests that highly connected people are also high performing peopleC. A lack of social-connectedness correlates with poorer psychological wellbeing and cognitive abilityD. It is the desired outcome of three core political behaviours: Networking, Reciprocity and Coalition Building",
      "definition": "B. Research suggests that highly connected people are also high performing people   C. A lack of social-connectedness correlates with poorer psychological wellbeing and cognitive ability   D. It is the desired outcome of three core political behaviours: Networking, Reciprocity and Coalition Building"
    },
    {
      "term": "Why should we be sceptical about Simon Sinek's golden circle model of motivation? Check all that applyA. Unlike his claims, the why-how-what model does not mimic the circuitry of the human brainB. Many of stories that support it seem to be biased, cherry-picked observations of leadership activityC. Finding your purpose is not motivationalD. His summary of the Apple story is a simplistic post-rationalisation, privileging marketing as the core reason for its success",
      "definition": "A. Unlike his claims, the why-how-what model does not mimic the circuitry of the human brain   B. Many of stories that support it seem to be biased, cherry-picked observations of leadership activity   D. His summary of the Apple story is a simplistic post-rationalisation, privileging marketing as the core reason for its success"
    },
    {
      "term": "Why shouldn't a manager always override an employee's better judgement? Check only one optionA. Because it will always lead to bullyingB. This makes an employee's work feel meaningless because it removes their sense of autonomyC. Because it wastes valuable timeD. This makes an employee's work feel meaningless because the employee always knows best",
      "definition": "B. This makes an employee's work feel meaningless because it removes their sense of autonomy"
    },
    {
      "term": "Why was it good strategy by NASA to provide its employees with the 'concrete objective' of \"putting a man on the moon and returning him safely to earth\"? Check only one option A. Concrete objectives are easier for employees to connect with rather than abstract goalsB. Concrete objectives can stop an organisation from reaching its ultimate visionC. Concrete objectives are useful in the building and construction industry onlyD. Putting a man on the moon is an impossible objective",
      "definition": "A. Concrete objectives are easier for employees to connect with rather than abstract goals"
    },
    {
      "term": "Which of the following are negative consequences of meaningless work? Check options that apply | High staff turnover | Greater employee self-expression | Staff absenteeism | Poor work performance",
      "definition": "High staff turnover | Staff absenteeism | Poor work performance"
    },
    {
      "term": "A study of over 10,000 young people found what characteristic as being the most important in looking for a good job? Check only one option | Interesting work | Job security | Superannuation | Part-time work opportunities",
      "definition": "Interesting work"
    },
    {
      "term": "According to the Job Characteristics model what three core job characteristics bring meaningfulness to work? Check options that apply | Task identity | Task significance | Part-time work | Skill variety",
      "definition": "Task identity | Task significance | Skill variety"
    },
    {
      "term": "From the list of answers select three examples related to the term 'job crafting'.Check options that apply | Changing the content of work | Changing the quality and amount of interaction with others while working | Changing the way we approach arts and crafts activities | Changing the way we think about our work",
      "definition": "Changing the content of work | Changing the quality and amount of interaction with others while working | Changing the way we think about our work"
    },
    {
      "term": "A number of studies suggest that a sense of meaning is increased when there is a 'close fit' between an individual's self-concept and their work role. Why might this be the case? Please select the most correct option. Check only one option | A 'close fit' allows employees to express themselves, their values, their beliefs and their perspectives through work | A 'close fit' allows employees to reduce an organisation's waste, pollution and environmental impact | A 'close fit' allows employees to fit into their work clothes more easily | A 'close fit' is when a manager allows their employees to go to the gym during work hours so that they can remain fit and healthy",
      "definition": "A 'close fit' allows employees to express themselves, their values, their beliefs and their perspectives through work"
    }
  ]
}
